{"title": "i-Razor: A Differentiable Neural Input Razor for Feature Selection and Dimension Search in DNN-Based Recommender Systems", "authors": "Yao Yao; Bin Liu; Haoxun He; Dakui Sheng; Ke Wang; Li Xiao; Huanhuan Cao", "pub_date": "2023-11-12", "abstract": "Input features play a crucial role in DNN-based recommender systems with thousands of categorical and continuous fields from users, items, contexts, and interactions. Noisy features and inappropriate embedding dimension assignments can deteriorate the performance of recommender systems and introduce unnecessary complexity in model training and online serving. Optimizing the input configuration of DNN models, including feature selection and embedding dimension assignment, has become one of the essential topics in feature engineering. However, in existing industrial practices, feature selection and dimension search are optimized sequentially, i.e., feature selection is performed first, followed by dimension search to determine the optimal dimension size for each selected feature. Such a sequential optimization mechanism increases training costs and risks generating suboptimal input configurations. To address this problem, we propose a differentiable neural input razor (i-Razor) that enables joint optimization of feature selection and dimension search. Concretely, we introduce an end-to-end differentiable model to learn the relative importance of different embedding regions of each feature. Furthermore, a flexible pruning algorithm is proposed to achieve feature filtering and dimension derivation simultaneously. Extensive experiments on two large-scale public datasets in the Click-Through-Rate (CTR) prediction task demonstrate the efficacy and superiority of i-Razor in balancing model complexity and performance.", "sections": [{"heading": "INTRODUCTION", "text": "I N this era of information overload, recommender systems powered by information technology and deep learning have become an effective way to retrieve potentially useful information for users from a huge range of options [1], [2], [3]. Deep learning recommender systems enhance recommendation performance by capturing complex correlations between features [4]. Experts resort to feature engineering, generating categorical, numerical, statistical, and cross features, to better understand the user's interests. However, due to the universal approximation property [5] of deep neural networks (DNN), feeding noisy features into a DNN model can adversely affect predictive performance [4], [6]. Meanwhile, because the embedding lookup table dominates both the size and inductive bias of DNN-based recommendation models [7], the embedding dimensions of input features are crucial to the performance and complexity of recommender systems. Therefore, it is highly desired to efficiently identify effective features from the original feature set and specify appropriate embedding dimensions. As illustrated in Figure 1, conventional industrial practices typically optimize feature selection and embedding dimension allocation separately. In contrast, this work explores jointly optimizing both in an end-to-end fashion. Feature selection is a crucial task in recommender systems and has been the subject of extensive research. Previous studies have categorized feature selection methods into three main categories: Filter, Wrapper, and Embedded methods [8], [9], [10]. Filter methods measure the discriminant attributes of features through criteria such as information gain [11] and feature consistency [12], so as to extract high-ranked features. Wrapper methods optimize feature subsets by using performance assessments such as the K-nearest neighbor (KNN) algorithm and linear discriminant analysis (LDA) instead of solely relying on evaluation criteria [13]. Compared with Filter and Wrapper, Embedded methods, such as the least absolute shrinkage and selection operator (LASSO) [14] and the gradient-boosting decision tree (GBDT) [15], [16], incorporate feature selection as part of the training process. Despite compensating for the drawbacks of low efficiency in Filter and high computational cost in Wrapper, the effectiveness of Embedded methods is substantially dependent on conductive parameters and strict model assumptions [9]. Although the aforementioned feature selection methods have proven effective in several scenarios, there could be a mismatch between the subset of features selected to optimize the feature selection model and the subset that would ideally serve the target DNN model. Recognizing that DNN models can capture more complex feature interactions, it would be logical to use the target DNN model to guide feature selection directly. In light of this, we propose a model-consistent feature selection approach that integrates the target DNN model into the feature selection process. Our approach belongs to the Embedded methods in a broad sense, but there is a notable difference between our study and previous work: we evaluate the importance of features from the point of view of each feature's optimal embedding dimension size under the target DNN model.\nIn recent years, there has been an increasing interest in studying embedding dimensions, as the embedding layer impacts on both the scale and the inductive bias of DNNbased recommendation models [7]. Specifying an adaptive embedding dimension for each feature is a problem of exponential complexity. A common practice is to set a unified value for all features by hyperparameter tuning experiments or relying on expert knowledge. However, such practice does not distinguish between different features and can be memory inefficient. Inspired by recent progress in neural architecture search (NAS) [17], methods based on reinforcement learning [18], differentiable search [19], [20], pruning [21], and so forth, have been proposed to perform dimension search at either field level or feature level 1 . Despite the ability of these methods to reduce model parameters without compromising model performance given a carefully selected feature subset, their effectiveness without feature selection remains unexplored. The dependency on feature selection effectively equates to assuming all input features are beneficial during the dimension search process. We believe that there is a necessity to conduct dimension search under the assumption that not all features in the original feature set are helpful, as the updating of features can be very frequent in industrial practice. With this objective, we propose a differentiable framework that identifies redundantly assigned embedding dimensions for pruning. Specifically, a feature with its embedding dimension pruned to 0 is considered unimportant. It is worth noting that features are typically grouped into fields for practical reasons in industrial recommender systems, and these fields can 1. Field-level methods assign the same dimension to all features within the same field while feature-level ones can assign diverse dimensions to different features within the same field.\nhave significantly varying cardinalities. For example, the field Gender generally contains two features \"Female\" and \"Male\", while the field Browsed Goods may have millions of features. While individual dimension assignment for each feature (i.e., feature-level methods) might boost performance, field selection and field-level dimension search are often prioritized in large-scale recommender systems to reduce complexity and enhance implementation ease. This paper emphasizes assigning different dimension sizes to fields based on their importance, and discarding less important fields during the retraining stage. Unless otherwise specified, the term \"feature selection\" hereafter refers to the selection of fields.\nTo guide the input configuration towards better optima, we propose a differentiable neural input razor (i-Razor) that is capable of simultaneously pruning unnecessary fields and assigning adaptive embedding dimensions. The training of i-Razor consists of two stages. i) In the pretraining stage, we refine the dimension search space to learn the importance of different fields and different embedding regions. Meanwhile, to control the number of model parameters and avoid overfitting, we introduce a novel regularization term to regularize the model complexity. ii) In the retraining stage, a proposed pruning algorithm is executed to remove redundant fields and preserve the desired embedding dimensions for the remaining fields according to the relative weights of each embedding region. We then reconstruct the DNN model and retrain it with the training dataset based on the derived input configuration. We conduct extensive experiments on two large-scale public datasets for the CTR prediction task. The experimental results show that i-Razor achieves higher prediction accuracy while saving fields than several state-ofthe-art methods.\nThe main contributions of this paper are threefold. • Traditionally, feature selection and embedding dimension search were treated as separate processes. Our research presents a pioneering approach that explores their joint optimization. This innovative leap not only bridges the gap between feature selection and dimension search but also hints at a higher level of alignment between the two, which has the potential to discover input configurations that more closely approach optimal solutions. The remainder of this paper is organized as follows: Section 2 discusses the related literature on feature selection and embedding dimension search. We formulate the input configuration optimization problem and present the framework of i-Razor in Section 3. In Section 4, we elaborate on our experimental setup and empirical results. Finally, we conclude our work and discuss its potential future extensions in Section 5.", "publication_ref": ["b0", "b1", "b2", "b3", "b4", "b3", "b5", "b6", "b7", "b8", "b9", "b10", "b11", "b12", "b13", "b14", "b15", "b8", "b6", "b16", "b17", "b18", "b19", "b20"], "figure_ref": ["fig_0"], "table_ref": []}, {"heading": "RELATED WORK", "text": "In this section, we briefly review the works related to our study, including two branches of the literature: feature selection approaches and dimension search techniques.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Feature Selection Approaches", "text": "Feature selection refers to the process of finding out a subset from the original feature set without losing useful information [22]. Existing feature selection methods include the following three categories: Filter, Wrapper, and Embedded methods [23]. Filter methods measure the association between the feature and the class label via some specific evaluation criteria [22], such as information gain [24], minimum redundant maximum relevance [25], and spatiotemporal preserving representations [26]. This stream of research also includes feature selection methods based on statistical tests, e.g., Chi-squared [27], Pearson correlation, and ANOVA F-value test [28]. Input features that demonstrate a significant statistical relationship with the output variable are retained and utilized for further analysis, while others are discarded. Filter methods are expected to have the highest computational efficiency and tend to keep more features from the total feature space [9], [10]. By contrast, Wrapper methods adopt specific learning techniques such as KNN [29], Naive Bayes [30], LDA [31], and adaptive semisupervised feature analysis [32] to assess the performance of feature combinations [13]. Though more efficient for feature selection than Filter methods, Wrapper methods require higher computational resources [33]. In these two types of feature selection methods, the feature selection process and the model training process are distinctly separate.\nUnlike Filter and Wrapper methods, Embedded methods such as LASSO [14], GBDT [15], and semi-supervised recurrent convolutional attention models [34] integrate the feature selection process with the model training process, i.e., feature selection is performed automatically during the model training process [8]. Recently, the advancement of NAS has spawned a new research hotspot in Embedded methods, the automatic search for useful features with AutoML techniques [10], [35]. For instance, AutoFIS [36] proposes a gating mechanism to identify and mask the intersection of useless features in factorization models. AutoField [37] assigns two operators to each field, one for selecting and the other for ignoring that field. By comparing the relative importance of these two operators, it determines whether to select that field or not. Operators of each field of AutoField [37] and AutoFIS [36] are independent of each other, while AdaFS [38] assigns associated operators to each field through softmax operation, and measures the relative importance of fields corresponding to each operator by comparing the weight of each operator, so as to screen features. Meanwhile, there has been a growing interest in automatic feature selection in deep learning-based sequential recommendation systems. For instance, NASR [35] made significant strides in designing a hybrid sequential recommendation model with the aim to ensemble the capacity of both self-attention and convolutional architectures. The proposed method can automatically select the architecture operation on each layer.\nInspired by these advancements, our approach, i-Razor, also belongs to the Embedded category, but with a unique perspective. i-Razor facilitates model-consistent feature selection by evaluating the importance of each feature concerning its optimal embedding dimension in the target DNN model. Building upon the foundation laid by AutoField, we propose a 0-dimension absorbing operator, which signifies the action of deselecting a specific feature. In addition, we enhance the existing design of the dimension search space, which commonly segments the embedding dimensions, by introducing the concept of the 0-dimension operator into this process. The weight associated with each operator measures the relative importance of these divisions, with 0 dimension indicating that all regions should be masked. By considering combinations of these operators, we derive the final input configuration. This method allows us to perform dimension search and feature selection concurrently, offering a more efficient manner to ensure that the chosen features and embedding dimensions contribute to the target model's performance.", "publication_ref": ["b21", "b22", "b21", "b23", "b24", "b25", "b26", "b27", "b8", "b9", "b28", "b29", "b30", "b31", "b12", "b32", "b13", "b14", "b33", "b7", "b9", "b34", "b35", "b36", "b36", "b35", "b37", "b34"], "figure_ref": [], "table_ref": []}, {"heading": "Dimension Search Techniques", "text": "Since assigning unified embedding dimensions to all features is incompatible with their heterogeneity, the new paradigm of mixed dimensions has gained more and more attention [7], [18], [20], [39]. To be specific, in a mixed dimension scheme, different features can have different embedding dimensions. There are two types of dimension search methods: featurelevel and field-level. Feature-level methods aim to assign different embedding dimensions to different features within the same field. For example, NIS [18] applies reinforcement learning to generate decision sequences on the selection of dimensions for different features. Other heuristic approaches, such as MDE [39], DPG [40], and MGQE [41], attempt to assign higher dimensions to features with higher frequencies. However, these methods suffer from numerous unique values in each field, while the feature frequencies are highly dynamic and not pre-known in real-life situations. Although the frequency of different features can be estimated by sampling, the fine-grained dimension search at feature level introduces a sizeable computational overhead and additional complexity. In this work, we focus on the second group for its efficiency, which aims to allocate different dimensions to different fields, while different features in the same field share a common dimension size. Based on advances in NAS [42], the second type of dimension search method normally adopts an AutoML style to search for the desired embedding dimension from a set of predefined candidate embedding dimensions. Inspired by DARTS [17], [43], AutoDim [19] proposes a differentiable search method to analyze the suitability of different candidate embedding dimensions by calculating the attention coefficients of the corresponding operators. After the search, AutoDim assigns to each field the candidate dimension size whose corresponding operator has maximum attention. DNIS [7] eliminates the dependency on predefined candidate dimensions by directly pruning non-informative embedding blocks whose values are less than a given threshold. Although existing dimension search methods work well in the case of a well-selected subset of fields, their effectiveness in the presence of the original set of fields without feature selection remains understudied.\nSimilar to AutoDim, our objective is to automatically search for the optimal embedding dimension configuration on a given set of embedding dimension candidates. We differ from AutoDim: i) We consider dimension search on the original field set and avoid dimension assignment to useless fields by introducing a novel candidate dimension, i.e., dimension 0. After the search is completed, the redundant dimensions and the fields dominated by dimension 0 will be discarded, which means that dimension search and feature selection can be achieved simultaneously. ii) There is overlap between different candidate dimensions in AutoDim, i.e., the larger embedding dimensions cover the smaller ones, whereas the candidate dimensions in i-Razor do not overlap with each other. iii) Unlike AutoDim, which uses the argmax operator for dimension pruning, we propose a flexible pruning algorithm that allows more fine-grained dimension assignment.", "publication_ref": ["b6", "b17", "b19", "b38", "b17", "b38", "b39", "b40", "b41", "b16", "b42", "b18", "b6"], "figure_ref": [], "table_ref": []}, {"heading": "METHODOLOGY", "text": "In this section, we first formulate the feature selection and embedding dimension search problem. Then, we describe the proposed i-Razor, a two-stage end-to-end framework to automatically select important fields and assign adaptive dimensions to the selected fields.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Problem Formulation", "text": "We assume that the original field set F consists of N fields, whether useful or not. Meanwhile, taking online resources into consideration, we can roughly give the search space of dimension search:\nD = {d 1 , • • • , d K }, where K represents the number of candidate dimensions and d 1 < • • • < d K .\nA solution A to the input configuration optimization problem involves not only filtering a field subset F ⊆ F in favor of the target DNN model, but also specifying the corresponding embedding dimension size for these selected fields. Denoting the configuration of A by C A = {(f i , d fi ) | f i ∈ F}, we can formulate the problem of finding the configuration that maximizes the performance of the target DNN model as follows:\nmin A L (C A , W (A)) ,(1)\nwhere L is a task-specific loss function, W(A) denotes the optimal parameters of the DNN model under configuration A, and d fi specifies the unified dimension size assigned to all features in field f i .\nFinding the optimal solution to the input configuration optimization problem is an NP-Hard problem, with an incredibly huge space (typical size of 2 N K ) to search for. For the purpose of automatically selecting essential features from a noisy feature set while learning proper dimensions simultaneously without loss of generality and model performance, we propose an end-to-end differentiable framework, i-Razor. The overall framework is illustrated in Figure 2, which is made up of two stages: the pretraining stage and the retraining stage. We design the search space and the differentiable architecture for dimension search in the pretraining stage. To be specific, after an embedding layer, we adopt the target DNN structure to get model-consistent field importance evaluation by learning the relative weights of different operators. After that, in the retraining stage, a pruning algorithm is proposed to abandon unnecessary fields and determine the dimensions of the selected fields so that the target model can be retrained with the ultimate configuration.", "publication_ref": [], "figure_ref": ["fig_1"], "table_ref": []}, {"heading": "Pretraining Stage", "text": "The input search problem is actually consistent with hyperparameter optimization [44] in a broad sense, since the decision of the field subset F and the corresponding dimension configuration C A can be regarded as model hyperparameters to be determined before retraining the target model. However, the main difference is that the search space of C A in our problem is much larger than that of conventional hyperparameter optimization problems.", "publication_ref": ["b43"], "figure_ref": [], "table_ref": []}, {"heading": "Search Space", "text": "Before performing the input search, a suitable search space should be given in advance for dimension search. Generally, previous work [7], [19] defined the dimension candidate set D as a set of positive integers, which implicitly assumes that every field is indispensable to the performance of the model. The assumption holds well under fine-grained feature engineering. However, in industrial recommender systems, features are iterated rapidly to continuously improve the user experience, but not all newly generated features/fields are beneficial. When only given the original field set F rather than a well-chosen subset F ⊆ F, allocating dimensions to noisy fields would introduce superfluous memory consumption and lead to suboptimal performance. To avoid forcing dimension assignment to noisy fields, we propose a masking operator corresponding to dimension 0, which helps identify and filter out fields detrimental to the target DNN model. Despite the fact that neural networks can automatically adjust weights related to useless fields, the introduction of dimension 0 makes it easier to learn and observable for us to understand the importance of the field. We can easily obtain the ideal F for the retraining stage by removing the fields in F that are dominated by dimension 0.", "publication_ref": ["b6", "b18"], "figure_ref": [], "table_ref": []}, {"heading": "Embedding Division", "text": "In this paper, we assign the same search space to all fields for simplicity, and it is straightforward to introduce varying candidate sets. Instead of directly concatenating the K candidate embedding dimensions together, a sharing embedding architecture is introduced in order to reduce storage space and increase training efficiency. As shown in Figure 3, we allocate a d K -dimensional embedding to each field f i , denoted by e i , which is divided into K independent regions. Specifically, the first region covers the front d 1 embedding blocks (corresponding to no dimensional blocks in the case of d 1 = 0) and the j-th (1 < j ≤ K) region ranges from the (d j-1 + 1)-th digit to the d j -th digit of e i . To automatically learn the relative importance of each embedding region to the performance of the target DNN model, we assign a corresponding operator O i j ∈ R d K to the j-th region. The elements in these operators are either 1 or 0, where 1 in a operator reflects control over the embedding block at the corresponding position, while 0 indicates the embedding block at that position is masked so that the operator is independent of that block. By determining whether to keep each region in the retraining stage individually, the dimension search problem can be reformulated as an operator selection problem.\nIn contrast to existing dimension search methods [19], [20], where different operators may share the front dimensions, the proposed decoupled structure is tailored for learning the relative importance of each independent embedding region, allowing for greater flexibility in selecting the appropriate combination of embedding regions based on the importance weights. Notice that by setting D subtly, such as\nd j | d j = j×(j-1) 2 , j ∈ [1, K] or d j | d j = 2 j-1 , j ∈ [1, K]\n, the actual dimension search space we can get is able to cover all the integers in the interval [d 1 , d K ] when we aim to select some of the embedding regions to determine the final dimension size after pruning unconsidered regions. For example, given D = {0, 1, 3, 6}, we can get the dimension size of 5 by selecting the third region with 2 embedding blocks and the fourth region with 3 blocks. In contrast, previous methods can only select an embedding size that belongs to D because the regions controlled by different operators are overlapping, and the importance of these coupled operators is not independent of each other.\n𝑒 ! \" 𝑒 # \" e $ \" 𝑒 % \" 𝑒 & \" 𝑒 ' \" 𝑒 ( \" 𝑒 ) \" 𝑒 ! Batch Norm 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 0 1 1 1 1 𝑒 ! ! 𝑂 ! \" 𝑂 # \" 𝑂 $ \" 𝑂 % \" 𝑂 & \" Operators when 𝒟 = [0,1,2,4,8] Output Embedding 𝑒 ! \" = (𝑎 \" ! 𝑂 \" ! + 𝑎 # ! 𝑂 # ! + 𝑎 $ ! 𝑂 $ ! + 𝑎 % ! 𝑂 % ! + 𝑎 & ! 𝑂 & ! ) * 𝑒 ! !\nFig. 3: Embedding transformation and division in i-Razor.", "publication_ref": ["b18", "b19"], "figure_ref": [], "table_ref": []}, {"heading": "Continuous Relaxation", "text": "Inspired by DARTS [17], [43], we formulate the problem of joint optimization of feature selection and dimension search as an operator selection problem by incorporating continuous architecture parameters. Specifically, we introduce a soft layer that assigns varying weights\nα i = α i 1 , • • • , α i K to learn the relative contribution of different embedding regions of field f i . Trainable variables w i = w i 1 , • • • , w i\nK are introduced to calculate the value of each α i j :\nα i j = exp(w i j /τ ) K j=1 exp(w i j /τ ) , for j = 1, 2, . . . , K,(2)\nwhere τ > 0 is the temperature hyperparameter. Note that the magnitude of the values in e i can be different and easily coupled with other parameters in DNN, making it difficult for the architecture parameters α i to represent the relative importance of different embedding regions. Following [36],\n[45], we adopt the batch normalization [46] technique before the embedding transformation to eliminate the scale issue. The normalized embedding e\ni ′ = {e i ′ 1 , • • • , e i ′ d K } is calculated as: e i ′ j = e i j -µ i j (B) [σ i j (B)] 2 + ϵ , for j = 1, 2, . . . , d K ,(3)\nwhere µ i j (B) and σ i j (B) are the mean and standard deviation of e i j over a mini-batch B, and ϵ is a small positive constant to avoid numerical overflow. With this trick, we can force each value in e i ′ to approximately follow the Gaussian distribution N(0, 1), making them comparable with each other. As illustrated in Figure 3, the transformed embedding e i of field f i can be computed as:\ne i = e i ′ ⊙ K j=1 α i j O i j ,(4)\nwhere e i ′ is the output of the batch normalization layer and ⊙ is the element-wise product.\nBy applying Equation (4) to all fields and feeding all output embedding to the target DNN structure, we can obtain the relative importance of different embedding regions in the target model with a training set. Such an end-to-end importance evaluation mechanism allows the DNN model to softly select different embedding regions during model training, and an ideal subset of fields F ⊆ F and the corresponding discrete mixed dimension scheme C A can then be derived after training.", "publication_ref": ["b16", "b42", "b35", "b45"], "figure_ref": [], "table_ref": []}, {"heading": "Loss Function", "text": "In recommendation tasks, it is common for the number of features in different fields to vary greatly. For example, the field Gender usually has two features, while the field Browsed Goods may have millions of features. Therefore, varying even one embedding dimension on fields like Browsed Goods can lead to a significant change in the embedding lookup table size. In order to balance model performance and memory consumption, inspired by [42], we propose a novel regularization term L p to regularize the number of model parameters:\nL p = N i=1 |f i | N j=1 |f j | × K m=1 c m α i m ,(5)\nc m = d 1 , m = 1; d m -d m-1 , otherwise,(6)\nwhere |f i | indicates the number of features contained in field f i and c m represents the size of the embedding region that operator O i m controls. We intuitively expect the weighting scheme of L p to penalize those fields and regions with large cardinality, thus facilitating the compression of the model. In this paper, we focus on the CTR prediction task, where cross-entropy loss is commonly used. We combine it with L p to define the loss function of the pretraining stage as follows:\nL(y, ŷ) = -y log ŷ -(1 -y) log(1 -ŷ) + λL p ,(7)\nwhere y ∈ {0, 1} is the real label, ŷ ∈ [0, 1] is the predicted probability of y = 1, and the hyperparameter λ is a coefficient to control the degree of regularization.", "publication_ref": ["b41"], "figure_ref": [], "table_ref": []}, {"heading": "Algorithm 1:", "text": "The CPT-based Pruning Algorithm\nInput: The value of α i after pretraining, the threshold cpt (0 ≤ cpt ≤ 1), and the search space\nD = {d 1 , • • • , d K }.\nOutput: a pruned dimension size d fi assigned to field f i . 1 Sort the architecture weights α i in the descending order:\nα i = [α i j1 , • • • , α i j K ], satisfying α i j1 ≥ α i j2 ≥ • • • ≥ α i j K ; 2 sum = 0 ;\n// The cumulative weight 3 d fi = 0 ; // The cumulative dimension size 4 for t ∈ [1, 2, . . . , K] do 5\nd fi = d fi + c jt ;\n// c jt is the embedding size of α i jt calculated from Eq.( 6) \n6 sum = sum + α i jt ; //", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "One-level Optimization", "text": "In this work, we reparameterize the problem of feature selection and dimension search as a structural search problem and relax the selection of different operators to be continuous and differentiable. We slightly abuse the symbol\nA = [ α 1 , • • • , α N ]\nto denote all the continuous architecture parameters and W(A) to represent the downstream DNN parameters. Different from DARTS-style works [7], [17], [19] that use bi-level optimization to iteratively update A and W(A), we follow the setting of [36] and use one-level optimization to simultaneously train A and W(A) on the training set T . In addition to being time-consuming, [36] empirically demonstrated that bi-level optimization might downgrade the final performance due to the accumulation of errors from multiple approximations. On the other hand, we argue that there are many causes that can affect the performance and stability of bi-level optimization, such as the size of the validation set and the switch interval during iterative training. Hence, we adopt one-level optimization for practicality and efficiency by simultaneously updating A and W(A) via gradient descent as follows:\n∂ A L (T ; A, W (A)) and ∂ W(A) L (T ; A, W (A)). (8)", "publication_ref": ["b6", "b16", "b18", "b35", "b35"], "figure_ref": [], "table_ref": []}, {"heading": "Retraining Stage", "text": "After the pretraining stage, we can obtain the relative importance of different operators. We then seek to derive the optimal subset F ⊆ F and the corresponding dimension configuration C A . Retraining the target DNN model with F and C A aims to eliminate suboptimal influence since the unpicked fields in F and the redundant embedding dimensions are also involved during the pretraining stage.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Input Configuration Derivation", "text": "Despite the hard selector argmax being widely used in previous DARTS-style work [17], [19], we argue that it can lead to an inconsistency between the pretraining model and the retraining model, resulting in inferior performance. For instance, assume there is a field that has three candidate dimensions with corresponding weights of {0.33, 0.33, 0.34}. It is difficult to judge which operator is better since the gap is too small, and dropping all of the relatively smaller operators can lead to a dilemma that the total weight of the dropped operators is much higher than the selected one. Moreover, due to randomness during DNN model training, the derived optimal operators can also be unstable. To alleviate such issues, we set a cumulative probability threshold (CPT) to flexibly adjust the minimum amount of information kept in the retraining stage, supplemented with a pruning algorithm to derive the embedding dimension d fi for each field f i . The details are presented in Algorithm 1. The intuition behind this is that embedding regions with higher weights contain more effective information and should be retained in preference during pruning.\nRecall that d fi = 0 means that the corresponding field f i is useless and thus can be removed in the retraining stage. By applying Algorithm 1 to each field separately, we simultaneously complete feature selection and dimension search to obtain the pruned neural architecture of the retraining model. Compared with those selection algorithms based on the argmax operator, the proposed CPT-based pruning algorithm can generate more fine-grained embedding dimension configurations. Meanwhile, our algorithm can cover some common embedding search methods by flexibly adjusting the threshold. For example, the argmax operator in DART-style work [17], [19] becomes a special case with cpt = 0, while cpt = 1 means retaining all regions.", "publication_ref": ["b16", "b18", "b16", "b18"], "figure_ref": [], "table_ref": []}, {"heading": "Model Retraining", "text": "As shown in Figure 2, we discard useless fields and redundant dimensions to redefine the architecture of the retraining model. Specifically, we only allocate embedding dimensions to fields in F according to C A and concatenate all of these dimensions to feed into the subsequent DNN model. Note that as the dimension size of the embedding layer changes, the first layer of the DNN model needs to be adjusted accordingly. In addition, batch normalization is not used during retraining since there are no comparisons between different operators in each field. All parameters in the retraining model will be trained on the training set T by only minimizing the cross-entropy loss.", "publication_ref": [], "figure_ref": ["fig_1"], "table_ref": []}, {"heading": "Complexity Analysis and Discussion", "text": "Similar to FM-style approaches [47], [48], [49], the space complexity of i-Razor is near O(nd K ), where n is the total number of features contained in all N fields and d K is the largest candidate dimension in the search space. In terms of training speed, the continuous relaxation and embedding transformation in i-Razor has a complexity of O(N Kd K ), which slows down the training when setting up candidates of large embedding dimensions. Overall, the proposed i-Razor elegantly converts the joint optimization of feature selection and dimension search into an operator selection process, which improves the flexibility and interpretability of feature engineering, while goes beyond the convention of \"feature selection before dimension search\". Given a suitable search space, i-Razor is efficient and conforms to the demand of recommendation scenarios.", "publication_ref": ["b46", "b47", "b48"], "figure_ref": [], "table_ref": []}, {"heading": "EXPERIMENTS", "text": "Extensive experiments were conducted on two well-known public datasets to answer the following research questions:\n• RQ1: How does i-Razor perform when compared to other input search methods? • RQ2: How do key components, i.e., the setting of d 1 = 0 and the CPT-based pruning algorithm, affect the performance? • RQ3: How do different hyperparameters affect i-Razor?\n• RQ4: How does the search space setting affect i-Razor?\n• RQ5: What is the interpretability of i-Razor?\n• RQ6: What is the compatibility of i-Razor with various deep recommendation models, and can the learned configurations from one model serve as a valuable reference for others on the same dataset?", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Datasets", "text": "Experiments were conducted on the following two public datasets:\n• Criteo 2 : Criteo is a benchmark industry dataset, which contains one month of click logs. In our experiments, we use \"data 6-12\" as the training set while selecting \"day 13\" for evaluation. Due to the huge volume of data and the severe label imbalance (only 3% positive samples), negative down-sampling is applied to keep the positive ratio roughly at 50%. • Avazu 3 : Avazu dataset was provided for the CTR prediction challenge on Kaggle. 80% of randomly shuffled data is allotted for training and validation while the rest 20% for testing.\nTo make a fair comparison between different methods, we process the two datasets following the settings 4 in AutoFIS [36] and PIN [45]. Meanwhile, to demonstrate the capability of feature selection from noisy fields, we augment the number of fields in the two datasets by brute-forcing all cross fields, yielding 39 + C 2 39 = 780 fields in Criteo and 24 + C 2 24 = 300 fields in Avazu. We renamed the new datasets as Criteo-FG and Avazu-FG. Some key statistics of the aforementioned datasets are summarized in Table 1.  L1 and L2 control the weights of the L1-norm and L2-norm loss respectively; TopK represents the field search space, where each element means the retention of the topK fields; τ is the temperature; λ is the parameter that controls the weight of the regularization term L p ; cpt is the threshold in the retraining stage.", "publication_ref": ["b35", "b44"], "figure_ref": [], "table_ref": ["tab_2"]}, {"heading": "Experimental Setup", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Baselines", "text": "To evaluate the effectiveness of i-Razor, we select the following state-of-the-art methods as baselines:\n1) Feature selection methods. Fixed dimension embedding (FDE) specifies a uniform dimension size for all fields via traversal search and is paired with all feature selection methods to test the effectiveness of feature selection alone. FTRL [50] is a widely used feature selection algorithm that incorporates L1 and L2 regularization and has excellent sparsity and convergence properties. AutoField [37] is an AutoML framework that can adaptively evaluate the inclusion/exclusion probability for each feature. Following the experimental setup in the original paper, we evaluated model performance by keeping varying numbers of features and identified the configuration that achieved the best performance. AdaFS [38] employs a control network to score input data samples and adaptively select the most informative features. Mirroring AdaFS-hard [38] in the original study, we performed hard feature selection to retain different proportions of features in order of importance and discarded the remainder. AutoFIS [36] is a state-of-theart method to select important feature interactions in FMbased methods 5 . Notice that we tried different deletion ratios ranging from 0 to 1 with an interval of 0.1, and only presented the best results with the highest AUC metric. The feature selection performance of i-Razor is evaluated by just removing the fields dominated by dimension 0. 2) Dimension search methods. AutoDim [19] and DARTS [17] are two state-of-the-art methods that bear the closest resemblance to i-Razor and can automatically select appropriate dimensions for different fields. Both methods perform dimension search directly on all fields without feature selection to evaluate the validity of naive dimension optimization. Unlike AutoDim [19] and i-Razor, different dimension candidates in DARTS [17] do not share dimension blocks with each other. DARTS needs to allocate total K j=1 D j dimensions to each field in the pretraining model and relies on the argmax operator as Autodim for dimension selection.\n3) Hybrid methods. In addition to our approach, we compare the training mechanism of feature selection followed by dimension search, and the corresponding baselines are designated as 'AutoFIS w/ AutoDim' and 'AutoFIS w/ i-Razor'.", "publication_ref": ["b49", "b36", "b37", "b37", "b35", "b18", "b16", "b18", "b16"], "figure_ref": [], "table_ref": []}, {"heading": "Evaluation Metrics", "text": "We evaluate the performance of our proposed method on the classical CTR prediction task. The evaluation metrics include Area Under the ROC Curve (AUC), the number of selected fields (Fields), the total embedding dimensions used in the retraining stage (Dims), and the parameter quantity of all embeddings (Params) 6 . A higher AUC indicates a better recommendation performance. It is noteworthy that a slightly higher AUC at 0.001-level is regarded as significant for the CTR prediction task [19], [51]. We naturally introduce Dims and Fields as straightforward metrics since all methods aim to reduce model parameters through feature selection or dimension search.", "publication_ref": ["b18", "b50"], "figure_ref": [], "table_ref": []}, {"heading": "Implementation", "text": "We implement all algorithms in Tensorflow [52] and use the Adagrad [53] optimizer for gradient descent. For a fair comparison, for each baseline, we have reproduced it with reference to the original paper. Table 2 summarizes the key parameters used in our experiments. For AutoDim, we adopt the same annealing temperature τ = max(0.01, 1 -0.00005 • t) provided in the original paper [19]. The code is publicly available on https://github.com/YaoYao1995/i-Razor.git.\n6. Dims and Params are roughly calculated by\nN i=1 d f i and N i=1 |f i | × d f i , respectively.", "publication_ref": ["b51", "b52", "b18"], "figure_ref": [], "table_ref": ["tab_4"]}, {"heading": "Overall Performance (RQ1)", "text": "Performance improvement can be an arduous process in real-world recommender systems, so we present the best performance configuration corresponding to each baseline in Table 3 and Table 4. There are several observations:\n• Proper feature selection leads to competitive or even superior performance compared with FDE. This indicates that filtering out less informative and predictive features is beneficial for recommendation models. Additionally, we observe that the discarded fields have a small cardinality (i.e., a small number of features per field) on Avazu, which limits the savings in Params. This emphasizes the importance of further exploring dimension search techniques. • Comparing all dimension search methods with FDE, we observe that dimension search methods generally achieve more significant parameter savings. However, on Criteo, existing dimension search methods assign dimensions to each field, which fails to eliminate the Feature selection eliminates less informative features without compromising model performance, while dimension search effectively reduces parameter quantities. The findings emphasize the importance of integrating these optimization processes, as evidenced by the superior performance of i-Razor compared to other methods.", "publication_ref": [], "figure_ref": [], "table_ref": ["tab_6", "tab_7"]}, {"heading": "Ablation Study (RQ2)", "text": "In i-Razor, the introduced dimension 0 in the search space plays an important role to filter out the useless fields. Meanwhile, the proposed CPT-based pruning algorithm makes it easy and flexible to derive the desired embedding configuration. To further study the role of these two components, we propose and compare the following four variants:\n1) 'i-Razor w/ 0': using the CPT-based pruning algorithm while introducing dimension 0 into the search space; 2) 'i-Razor w/o 0': only using the CPT-based pruning algorithm; 3) 'argmax w/ 0': using the argmax selector while introducing dimension 0 into the search space; 4) 'argmax w/o 0': only using the argmax selector.\nTo be specific, we consider two kinds of candidate dimension sets, i.e., D 1 = {0, 1, 3, 6, 10} and D 2 = {1, 3, 6, 10}.\nThe best results of these variants on Criteo-FG and Avazu-FG are shown in Table 5 and we draw the following conclusions:\n• By comparing variant (1) with ( 2) and comparing variant (3) with ( 4), we observe that the variants with dimension 0 (w/ 0) consistently outperform those without dimension 0 (w/o 0). The reason is that the introduced dimension 0 can increase the distinction between different fields and avoid assigning dimensions to redundant fields. This observation suggests that the introduction of dimension 0 can benefit recommender systems where noisy and redundant fields exist, especially in the face of thousands of fields in large-scale industrial recommender systems. • By comparing variant (1) with (3) and comparing variant\n(2) with ( 4), we observe that the CPT-based pruning algorithm can achieve a performance gain at the expense of preserving more fields and parameters. Recall that the argmax-based pruning algorithm is a special case of the CPT-based pruning algorithm (by setting cpt = 0), we conclude that the CPT-based pruning algorithm is more suitable for real-world recommender systems due to its flexibility to obtain effective coordination between model performance and memory overhead. In summary, both components have their advantages, such as dimension 0 contributes to feature selection and parameter reduction, while the CPT-based pruning algorithm further helps the model to arrive at better input configurations.", "publication_ref": [], "figure_ref": [], "table_ref": ["tab_8"]}, {"heading": "Hyperparameter Study (RQ3)", "text": "There are two main hyperparameters involved in i-Razor: the threshold cpt and the weight coefficient λ of the regularization term L p . To study the impact of cpt, we investigate how i-Razor performs with the change of cpt, while fixing other parameters (τ = 0.05, λ = 0.0001). As shown in Figure 4, larger cpt leads to larger value of Params, which is straightforward as more embedding regions and fields would be retained. It can be seen that when cpt is relatively small (cpt ≤ 0.3), AUC is improved with the increase of Params. However, when cpt ≥ 0.4, the performance of the model will decrease significantly. The potential reason is that with more fields and embedding dimensions preserved, the DNN model may require more data to eliminate the side-effect of redundant parameters. Meanwhile, the experimental results indicate that larger λ usually corresponds to less Params, which reflects the effectiveness of L p in controlling the number of parameters. However, when L p dominates the gradient update of the architecture parameters, model performance tends to drop sharply since some useful embedding regions or fields with large cardinality may be incorrectly filtered out. In short, both cpt and λ are crucial hyperparameters in i-Razor, and we empirically find them to be effective and parameter insensitive when taking smaller values. In practical use, the appropriate values can be found by performing a grid search on recommended intervals: cpt ∈ [0, 0.4] and λ ∈ [0, 0.01].", "publication_ref": [], "figure_ref": ["fig_2"], "table_ref": []}, {"heading": "Candidate Dimension Set Study (RQ4)", "text": "In this subsection, we study how different dimension partitioning schemes for the candidate dimension sets affect model performance. Specifically, we consider three heuristic settings: uniform splits {0, 0 0 1 1 0 0 0 0 2 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 0 0 0 0 2 2 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 0 1 0 2 0 2 2 1 0 3 2 0 1 0 0 2 0 1 1 0 0 0 1 1 1 0 1 1 0 0 1 0 0 2 0 0 0 0 3 0 0 0 2 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 2 0 1 1 2 2 2 0 1 1 2 0 0 2 1 0 0 0 0 0 1 0 1 0 0 0 0 0 1 0 0 1 0 0 0 0 0 0 0 3 0 0 0 0 0 0 0 0 0 0 0 0 0 2 1 0 0 0 1 1 0 0 0 0 1 0 0 0 0 1 1 0 2 0 0 1 2 0 0 1 1 2 2 0 1 2 1 1 0 0 2 0 1 3 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 0.0 0.5  ", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Dimension Analysis (RQ5)", "text": "We visualize the output configuration of the CPT-based pruning algorithm to get a better understanding of i-Razor. The result on Avazu-FG with the search space D = {0, 1, 2, 4, 6} is presented in Figure 5 as an example, and similar results obtained with other settings are omitted due to limited space. We can observe that important single fields such as \"site id\", \"app id\", and \"device ip\", generate many cross fields to be kept with. It makes sense since item features, context features and position features are essential features in recommender systems. For continuous fields, we can infer that \"C17\" and \"C20\" are relatively more important than others as they generate more effective cross fields. Meanwhile, we can directly pick out useful cross fields according to their derived embedding dimension size. For instance, \"site id * C14\", \"site domain * mday\", \"app category * device model\", and \"device model * C20\" are expected to be beneficial cross fields, since they are assigned with the largest dimension size. Furthermore, we can find the configuration matrix is sparse, where only 75 out of the 300 fields are greater than 0. This means that we can directly increase the high-order interaction between different fields to enrich the feature space, and rely on i-Razor to remove the superfluous fields. The visualization result also supports the conclusion that i-Razor allows a fine-grained pruning procedure so that discriminative fields can be assigned the appropriate dimension according to their predictive capacity. Such findings demonstrate i-Razor's capability to automatically assess the quality of fields, which facilitates the screening of new features and can guide feature engineering iterations in industrial recommender systems.", "publication_ref": [], "figure_ref": ["fig_3"], "table_ref": []}, {"heading": "Compatibility and Transferability Study (RQ6)", "text": "In this subsection, we investigate the compatibility and transferability of i-Razor. We examine its applicability beyond multi-layer perceptron (MLP) models [54] and assess the effectiveness of the derived input configurations in different recommendation architectures. Our experiments focus on advanced deep recommendation models such as DeepFM [47], xDeepFM [55], and IPNN [45], [56] using the Avazu dataset.\nTo ensure dimension uniformity for feature interaction operations, we introduce different MLP layers for each field to perform linear transformations on embeddings. We compare three configurations in Table 7: FDE, which evenly allocates 30 dimensions to all fields; MLP, which transfers the input configuration learned from the MLP model; and model-consistent configurations specifically derived from each target model.\nOur experiments yield the following key findings:\n• Directly adopting the input configuration learned from the MLP model to other deep recommendation models results in the removal of irrelevant fields, parameter compression, and improved AUC performance. These findings demonstrate the instructiveness of the MLP input configuration for enhancing the performance of other deep recommender systems on the same dataset. • Model-consistent configurations derived specifically for each target model outperform the other two competitors. This highlights the compatibility of i-Razor with various deep recommendation models and emphasizes the importance of using model-specific configurations to achieve optimal performance. Overall, our experiments confirm the compatibility and transferability of i-Razor, showcasing its ability to generate input configurations that improve model performance and parameter efficiency across various deep models.", "publication_ref": ["b53", "b46", "b54", "b44", "b55"], "figure_ref": [], "table_ref": ["tab_11"]}, {"heading": "CONCLUSION", "text": "In this paper, we address the challenge of feature selection and dimension search in modern DNN-based recommender systems. To this end, we propose a differentiable framework that selects useful fields from a given set while assigning adaptive embedding dimensions. The proposed method acts on the embedding layer and can be integrated into various network architectures to improve the recommendation ", "publication_ref": [], "figure_ref": [], "table_ref": []}], "references": [{"ref_id": "b0", "title": "Content-based recommendation systems", "journal": "Springer", "year": "2007", "authors": "M J Pazzani; D Billsus"}, {"ref_id": "b1", "title": "Clcdr: Contrastive learning for cross-domain recommendation to cold-start users", "journal": "Springer", "year": "2022", "authors": "Y Chen; Y Yao; W K V Chan"}, {"ref_id": "b2", "title": "Cdr-adapter: Learning adapters to dig out more transferring ability for cross-domain recommendation models", "journal": "", "year": "2023", "authors": "Y Chen; Y Yao; W K V Chan; L Xiao; K Zhang; L Zhang; Y Ye"}, {"ref_id": "b3", "title": "Autocross: Automatic feature crossing for tabular data in real-world applications", "journal": "", "year": "2019", "authors": "Y Luo; M Wang; H Zhou; Q Yao; W.-W Tu; Y Chen; W Dai; Q Yang"}, {"ref_id": "b4", "title": "Multilayer feedforward networks are universal approximators", "journal": "Neural networks", "year": "1989", "authors": "K Hornik; M Stinchcombe; H White"}, {"ref_id": "b5", "title": "High performance feature selection algorithms using filter method for cloudbased recommendation system", "journal": "Cluster Computing", "year": "2019", "authors": "D Muthusankar; B Kalaavathi; P Kaladevi"}, {"ref_id": "b6", "title": "Differentiable neural input search for recommender systems", "journal": "", "year": "2020", "authors": "W Cheng; Y Shen; L Huang"}, {"ref_id": "b7", "title": "A survey on feature selection methods", "journal": "Computers and Electrical Engineering", "year": "2014", "authors": "G Chandrashekar; F Sahin"}, {"ref_id": "b8", "title": "Bacterial colony algorithm with adaptive attribute learning strategy for feature selection in classification of customers for personalized recommendation", "journal": "Neurocomputing", "year": "2020", "authors": "H Wang; B Niu; L Tan"}, {"ref_id": "b9", "title": "Automl for deep recommender systems: A survey", "journal": "ACM Transactions on Information Systems", "year": "2023", "authors": "R Zheng; L Qu; B Cui; Y Shi; H Yin"}, {"ref_id": "b10", "title": "Igf-bagging: Information gain based feature selection for bagging", "journal": "International Journal of Innovative Computing, Information and Control", "year": "2011", "authors": "G Wang; J Ma; S Yang"}, {"ref_id": "b11", "title": "Consistency-based search in feature selection", "journal": "Artificial intelligence", "year": "2003", "authors": "M Dash; H Liu"}, {"ref_id": "b12", "title": "A survey on evolutionary computation approaches to feature selection", "journal": "IEEE Transactions on Evolutionary Computation", "year": "2015", "authors": "B Xue; M Zhang; W N Browne; X Yao"}, {"ref_id": "b13", "title": "Pairwise constraint-guided sparse learning for feature selection", "journal": "IEEE transactions on cybernetics", "year": "2015", "authors": "M Liu; D Zhang"}, {"ref_id": "b14", "title": "Greedy function approximation: a gradient boosting machine", "journal": "Annals of statistics", "year": "2001", "authors": "J H Friedman"}, {"ref_id": "b15", "title": "Practical lessons from predicting clicks on ads at facebook", "journal": "", "year": "2014", "authors": "X He; J Pan; O Jin; T Xu; B Liu; T Xu; Y Shi; A Atallah; R Herbrich; S Bowers"}, {"ref_id": "b16", "title": "Darts: Differentiable architecture search", "journal": "", "year": "2018", "authors": "H Liu; K Simonyan; Y Yang"}, {"ref_id": "b17", "title": "Neural input search for large scale recommendation models", "journal": "", "year": "2020", "authors": "M R Joglekar; C Li; M Chen; T Xu; X Wang; J K Adams; P Khaitan; J Liu; Q V Le"}, {"ref_id": "b18", "title": "Autodim: Field-aware embedding dimension searchin recommender systems", "journal": "", "year": "2021", "authors": "X Zhao; H Liu; H Liu; J Tang; W Guo; J Shi; S Wang; H Gao; B Long"}, {"ref_id": "b19", "title": "Autoemb: Automated embedding dimensionality search in streaming recommendations", "journal": "IEEE", "year": "2021", "authors": "X Zhaok; H Liu; W Fan; H Liu; J Tang; C Wang; M Chen; X Zheng; X Liu; X Yang"}, {"ref_id": "b20", "title": "Learnable embedding sizes for recommender systems", "journal": "", "year": "2020", "authors": "S Liu; C Gao; Y Chen; D Jin; Y Li"}, {"ref_id": "b21", "title": "Feature selection in machine learning: A new perspective", "journal": "Neurocomputing", "year": "2018", "authors": "J Cai; J Luo; S Wang; S Yang"}, {"ref_id": "b22", "title": "Dragonfly algorithm: theory, literature review, and application in feature selection", "journal": "Springer", "year": "2020", "authors": "M Mafarja; A A Heidari; H Faris; S Mirjalili; I Aljarah"}, {"ref_id": "b23", "title": "Information gain and divergence-based feature selection for machine learning-based text categorization", "journal": "Information processing and management", "year": "2006", "authors": "C Lee; G G Lee"}, {"ref_id": "b24", "title": "Feature selection based on mutual information criteria of max-dependency, max-relevance, and minredundancy", "journal": "IEEE Transactions on pattern analysis and machine intelligence", "year": "2005", "authors": "H Peng; F Long; C Ding"}, {"ref_id": "b25", "title": "Making sense of spatio-temporal preserving representations for eeg-based human intention recognition", "journal": "IEEE transactions on cybernetics", "year": "2019", "authors": "D Zhang; L Yao; K Chen; S Wang; X Chang; Y Liu"}, {"ref_id": "b26", "title": "A guide to chi-squared testing", "journal": "Biometrics", "year": "1996", "authors": "P E Greenwood; M S Nikulin"}, {"ref_id": "b27", "title": "An analysis of variance test for normality (complete samples)", "journal": "Biometrika", "year": "1965", "authors": "S S Shaphiro; M B Wilk"}, {"ref_id": "b28", "title": "The distance-weighted k-nearest-neighbor rule", "journal": "IEEE Transactions on Systems, Man, and Cybernetics", "year": "1976", "authors": "S A Dudani"}, {"ref_id": "b29", "title": "An empirical study of the naive bayes classifier", "journal": "", "year": "2001", "authors": "I Rish"}, {"ref_id": "b30", "title": "Feature selection in omics prediction problems using cat scores and false nondiscovery rate control", "journal": "The Annals of Applied Statistics", "year": "2010", "authors": "M Ahdesmäki; K Strimmer"}, {"ref_id": "b31", "title": "An adaptive semisupervised feature analysis for video semantic recognition", "journal": "IEEE transactions on cybernetics", "year": "2017", "authors": "M Luo; X Chang; L Nie; Y Yang; A G Hauptmann; Q Zheng"}, {"ref_id": "b32", "title": "A hybrid model of fuzzy min-max and brain storm optimization for feature selection and data classification", "journal": "Neurocomputing", "year": "2019", "authors": "F Pourpanah; C P Lim; X Wang; C J Tan; M Seera; Y Shi"}, {"ref_id": "b33", "title": "A semisupervised recurrent convolutional attention model for human activity recognition", "journal": "IEEE transactions on neural networks and learning systems", "year": "2019", "authors": "K Chen; L Yao; D Zhang; X Wang; X Chang; F Nie"}, {"ref_id": "b34", "title": "Towards automatic discovering of deep hybrid network architecture for sequential recommendation", "journal": "", "year": "2022", "authors": "M Cheng; Z Liu; Q Liu; S Ge; E Chen"}, {"ref_id": "b35", "title": "Autofis: Automatic feature interaction selection in factorization models for click-through rate prediction", "journal": "", "year": "2020", "authors": "B Liu; C Zhu; G Li; W Zhang; J Lai; R Tang; X He; Z Li; Y Yu"}, {"ref_id": "b36", "title": "Autofield: Automating feature selection in deep recommender systems", "journal": "", "year": "2022", "authors": "Y Wang; X Zhao; T Xu; X Wu"}, {"ref_id": "b37", "title": "Adafs: Adaptive feature selection in deep recommender system", "journal": "", "year": "2022", "authors": "W Lin; X Zhao; Y Wang; T Xu; X Wu"}, {"ref_id": "b38", "title": "Mixed dimension embeddings with application to memory-efficient recommendation systems", "journal": "IEEE", "year": "2021", "authors": "A Ginart; M Naumov; D Mudigere; J Yang; J Zou"}, {"ref_id": "b39", "title": "Differentiable product quantization for end-to-end embedding compression", "journal": "PMLR", "year": "2020", "authors": "T Chen; L Li; Y Sun"}, {"ref_id": "b40", "title": "Learning multi-granular quantized embeddings for largevocab categorical features in recommender systems", "journal": "", "year": "2020", "authors": "W.-C Kang; D Z Cheng; T Chen; X Yi; D Lin; L Hong; E H Chi"}, {"ref_id": "b41", "title": "Atomnas: Fine-grained end-to-end neural architecture search", "journal": "", "year": "2020", "authors": "J Mei; Y Li; X Lian; X Jin; L Yang; A Yuille; J Yang"}, {"ref_id": "b42", "title": "Darts+: Improved differentiable architecture search with early stopping", "journal": "", "year": "2019", "authors": "H Liang; S Zhang; J Sun; X He; W Huang; K Zhuang; Z Li"}, {"ref_id": "b43", "title": "Bilevel programming for hyperparameter optimization and meta-learning", "journal": "PMLR", "year": "2018", "authors": "L Franceschi; P Frasconi; S Salzo; R Grazzi; M Pontil"}, {"ref_id": "b44", "title": "Product-based neural networks for user response prediction over multi-field categorical data", "journal": "ACM Transactions on Information Systems (TOIS)", "year": "2018", "authors": "Y Qu; B Fang; W Zhang; R Tang; M Niu; H Guo; Y Yu; X He"}, {"ref_id": "b45", "title": "Batch normalization: Accelerating deep network training by reducing internal covariate shift", "journal": "PMLR", "year": "2015", "authors": "S Ioffe; C Szegedy"}, {"ref_id": "b46", "title": "Deepfm: a factorizationmachine based neural network for ctr prediction", "journal": "", "year": "2017", "authors": "H Guo; R Tang; Y Ye; Z Li; X He"}, {"ref_id": "b47", "title": "Factorization machines", "journal": "IEEE", "year": "2010", "authors": "S Rendle"}, {"ref_id": "b48", "title": "Deep learning over multi-field categorical data", "journal": "Springer", "year": "2016", "authors": "W Zhang; T Du; J Wang"}, {"ref_id": "b49", "title": "Ad click prediction: a view from the trenches", "journal": "", "year": "2013", "authors": "H B Mcmahan; G Holt; D Sculley; M Young; D Ebner; J Grady; L Nie; T Phillips; E Davydov; D Golovin"}, {"ref_id": "b50", "title": "Wide & deep learning for recommender systems", "journal": "", "year": "2016", "authors": "H.-T Cheng; L Koc; J Harmsen; T Shaked; T Chandra; H Aradhye; G Anderson; G Corrado; W Chai; M Ispir"}, {"ref_id": "b51", "title": "Tensorflow: A system for large-scale machine learning", "journal": "", "year": "2016", "authors": "M Abadi; P Barham; J Chen; Z Chen; A Davis; J Dean; M Devin; S Ghemawat; G Irving; M Isard"}, {"ref_id": "b52", "title": "Adaptive subgradient methods for online learning and stochastic optimization", "journal": "Journal of machine learning research", "year": "2011", "authors": "J Duchi; E Hazan; Y Singer"}, {"ref_id": "b53", "title": "Deep neural networks for youtube recommendations", "journal": "", "year": "2016", "authors": "P Covington; J Adams; E Sargin"}, {"ref_id": "b54", "title": "xdeepfm: Combining explicit and implicit feature interactions for recommender systems", "journal": "", "year": "2018", "authors": "J Lian; X Zhou; F Zhang; Z Chen; X Xie; G Sun"}, {"ref_id": "b55", "title": "Product-based neural networks for user response prediction", "journal": "IEEE", "year": "2016", "authors": "Y Qu; H Cai; K Ren; W Zhang; Y Yu; Y Wen; J Wang"}], "figures": [{"figure_label": "1", "figure_type": "figure", "figure_id": "fig_0", "figure_caption": "Fig. 1 :1Fig. 1: Contrasting two strategies for optimizing model inputs. (a) Sequentially conducting feature selection and tuning feature dimensions. (b) Simultaneously optimizing feature selection and dimension allocation.", "figure_data": ""}, {"figure_label": "2", "figure_type": "figure", "figure_id": "fig_1", "figure_caption": "Fig. 2 :2Fig. 2: The overall framework of i-Razor for joint optimization of feature selection and dimension search. (a) In the pretraining stage, we divide the embedding of each field into several parts and learn the relative importance of these regions by training directly under the guidance of the target model. (b) In the retraining stage, we use a pruning algorithm to filter the useless fields and keep only the desired dimensions to reconstruct the model. After retraining it with the training dataset, the ultimate serving model can be obtained.", "figure_data": ""}, {"figure_label": "4", "figure_type": "figure", "figure_id": "fig_2", "figure_caption": "Fig. 4 :4Fig. 4: Hyperparameter study of cpt and λ on Avazu-FG.", "figure_data": ""}, {"figure_label": "5", "figure_type": "figure", "figure_id": "fig_3", "figure_caption": "Fig. 5 :5Fig. 5: Embedding dimensions allocated to single fields and cross fields on Avazu-FG.", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_2", "figure_caption": "Statistics of Evaluation Datasets", "figure_data": "Dataset#instances #features #fields positive ratioCriteo1 × 10 81 × 10 6390.50Criteo-FG1 × 10 81 × 10 87800.50Avazu4 × 10 76 × 10 5240.17Avazu-FG4 × 10 74 × 10 73000.17"}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_4", "figure_caption": "", "figure_data": ": Parameter SettingAvazuAvazu-FGCriteoCriteo-FGMLP=[700 × 5, 1]bias opt = ftrlbias lr = 0.01Commonnet opt = Adagradnet lr = 0.02L2 = 0.001batch size=128batch size=500LN=TrueLN=FalseFDEsp = [5, 10, • • • , 50]sp= [1, 2, • • • , 10]sp= [5, 10, • • • , 50]sp= [1, 2, • • • , 10]FTRLL1=1, L2=1AutoFieldTopK = [8, 10, • • • , 22]-TopK = [15, 18, • • • , 36] -AdaFSTopK = [8, 10, • • • , 22]-TopK = [15, 18, • • • , 36] -AutoFISL1=0.01 L2=0.01-L1=0.01 L2=0.01-AutoDimsp=[1, 2, 4, 8, 16, 30]sp=[1, 2, 4, 6]sp=[1, 2, 4, 8, 16, 25]sp=[1, 3, 6, 10]DARTSsp=[1, 2, 4, 8, 16, 30]sp=[1, 2, 4, 6]sp=[1, 2, 4, 8, 16, 25]sp=[1, 3, 6, 10]sp = [0, 1, 2, 4, 8, 16, 30]sp = [0, 1, 2, 4, 6]sp=[0, 1, 2, 4, 8, 16, 25]sp=[0, 1, 3, 6, 10]i-Razorτ = 0.05 λ = 0.0001τ = 0.05 λ = 0.0001τ = 0.1 λ = 0.0001τ = 0.2 λ = 0.0001cpt = 0.45cpt = 0.3cpt = 0.8cpt = 0.3LN represents layer normalization;sp represents the search space during the pretraining stage;"}, {"figure_label": "3", "figure_type": "table", "figure_id": "tab_6", "figure_caption": "Model performance on Avazu and Avazu-FG. ⋆⋆ and ⋆ represent significance level p-value < 0.01 and p-value < 0.05 of comparing i-Razor with the best baseline (indicated by the underlined number). RelaChan represents the relative change of i-Razor compared to the underlined baseline. ↑: the higher the better; ↓: the lower the better.", "figure_data": "AvazuAvazu-FGMethodAUC ↑Fields ↓ Dims ↓ Params (M) ↓AUC ↑Fields ↓ Dims ↓ Params (M) ↓FDE0.78112472019.360.781430030043.89FTRL w/ FDE0.78122060019.270.784516016033.60AutoField w/ FDE0.78092060019.35----AdaFS w/ FDE0.78121236019.34----AutoFIS w/ FDE----0.783518918916.51i-Razor w/ FDE0.78121648019.350.7870757527.68AutoDim0.78202423916.630.7842300588184.03DARTS0.78152421117.970.7839300596201.12AutoFIS w/ AutoDim----0.783618939347.83AutoFIS w/ i-Razor----0.78488715922.27i-Razor (Ours)0.78231612212.320.78967510840.85RelaChan+0.0003 ⋆-33%-49%-26%+0.0048 ⋆⋆-14%-32%+83%"}, {"figure_label": "4", "figure_type": "table", "figure_id": "tab_7", "figure_caption": "Model performance on Criteo and Criteo-FG. FTRL is not listed as performance degrades when any proportion of fields are deleted. ↑: the higher the better; ↓: the lower the better.", "figure_data": "CriteoCriteo-FG"}, {"figure_label": "5", "figure_type": "table", "figure_id": "tab_8", "figure_caption": "Effectiveness of our model components. ↑: the higher the better; ↓: the lower the better. Fields ↓ Dims ↓ Params (M) ↓ AUC ↑ Fields ↓ Dims ↓ Params (M) ↓", "figure_data": "Avazu-FGCriteo-FGMethod AUC ↑ i-Razor w/ 0 (1) 0.78908020067.320.80195991487208.71i-Razor w/o 0 (2)0.782730045782.640.80157802148314.23argmax w/ 0 (3)0.78837416958.140.801325662584.11argmax w/o 0 (4) 0.782630044981.500.8012780957136.90interference of less predictive fields, leading to perfor-mance degradation. This highlights the necessity offeature selection.• Concerning hybrid methods, on Avazu-FG, we observea noticeable drop in AUC for 'AutoFIS w/ AutoDim'compared to AutoDim, and even larger differences inAUC between 'AutoFIS w/ i-Razor' and i-Razor. OnCriteo-FG, i-Razor consistently outperforms 'AutoFISw/ i-Razor' in all evaluation metrics, demonstrating theadvantage of joint optimization over separate sequentialoptimization.• Dexterously balancing predictive performance andmodel compression, i-Razor surpasses top baselines. OnAvazu-FG, i-Razor jointly optimizes to retain informativefields. With fewer fields and Dims, it tends to concentratemore dimensions on predictive high-cardinality fieldswhile allocating relatively fewer dimensions to otherretained fields, increasing Params yet notably boostingAUC. On the remaining three datasets compared tostrong baselines, i-Razor aggressively slashes Paramswhile maintaining or even improving AUC. Combiningobservations on Avazu-FG and the remaining datasetsdemonstrates i-Razor's adept negotiation of predictiveperformance and compression with flexibility.In summary, our experiments underscore the significanceand advantages of feature selection and dimension search."}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_9", "figure_caption": "According to the complexity analysis in Section 3.4, when constructing the search space by dimension partitioning, the key factors to consider are the number of candidate dimensions K and the maximum dimension d K . Based on practical insights from real-world deployment, we make", "figure_data": "C1banner_possite_idsite_domainsite_categoryapp_idapp_domainapp_categorydevice_iddevice_ipdevice_modeldevice_typedevice_conn_typeC14C15C16C17C18C19C20C21mdayhourwdayC1banner_possite_idsite_domainsite_categoryapp_idapp_domainapp_categorydevice_iddevice_ipdevice_modeldevice_typedevice_conn_typeC14C15C16C17C18C19C20C21mdayhourwday4, 8, 12, 16, 20, 24, 28},linear expansion {0, 1, 3, 6, 10, 15, 21, 28}, and exponentialexpansion {0, 1, 2, 4, 8, 16, 32}. The performance of i-Razoron Avazu under these three schemes is summarized inTable 6, showing no significant differences. This experimentprovides empirical evidence that the model has a relativelylow sensitivity to dimension partitioning configurations. Onecontributing factor is the two-stage training procedure, whichseparates the search for optimal configurations in pretrainingfrom parameter tuning in retraining. The minor performancefluctuations imply the model's capability to reach similarsolutions despite varying partitioning schemes."}, {"figure_label": "6", "figure_type": "table", "figure_id": "tab_10", "figure_caption": "Impact of Candidate Dimension Set on Model Performance on Avazu. Fields ↓ Dims ↓ Params (M) ↓", "figure_data": "Metric"}, {"figure_label": "7", "figure_type": "table", "figure_id": "tab_11", "figure_caption": "Compatibility and Transferability of i-Razor on Avazu. ↑: the higher the better; ↓: the lower the better. ⋆ indicates the statistically significant improvements (i.e., twosided t-test with p-value < 0.05) over the FDE config. Fields ↓ Dims ↓ Params (M) ↓ and reduce the size of parameters. The key idea is to introduce a soft selection layer that estimates the importance of different embedding regions and thus evaluates the field importance. Moreover, we design a CPTbased pruning algorithm to flexibly generate the mixed embedding configuration. While conceptually simple, i-Razor provides us with a concrete framework that is amenable to practicality and can be easily incorporated with various recommendation models. CTR prediction experiments on two real-world datasets verify the efficacy of i-Razor on the joint optimization of feature selection and dimension search. Since i-Razor can serve as an efficient plug-in for recommendation models, future work may include extension to other recommendation tasks.", "figure_data": "Metric"}], "formulas": [{"formula_id": "formula_0", "formula_text": "D = {d 1 , • • • , d K }, where K represents the number of candidate dimensions and d 1 < • • • < d K .", "formula_coordinates": [4.0, 312.0, 391.12, 252.0, 21.19]}, {"formula_id": "formula_1", "formula_text": "min A L (C A , W (A)) ,(1)", "formula_coordinates": [4.0, 395.44, 519.62, 169.51, 14.51]}, {"formula_id": "formula_2", "formula_text": "d j | d j = j×(j-1) 2 , j ∈ [1, K] or d j | d j = 2 j-1 , j ∈ [1, K]", "formula_coordinates": [5.0, 317.54, 183.06, 246.65, 26.7]}, {"formula_id": "formula_3", "formula_text": "𝑒 ! \" 𝑒 # \" e $ \" 𝑒 % \" 𝑒 & \" 𝑒 ' \" 𝑒 ( \" 𝑒 ) \" 𝑒 ! Batch Norm 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 0 1 1 1 1 𝑒 ! ! 𝑂 ! \" 𝑂 # \" 𝑂 $ \" 𝑂 % \" 𝑂 & \" Operators when 𝒟 = [0,1,2,4,8] Output Embedding 𝑒 ! \" = (𝑎 \" ! 𝑂 \" ! + 𝑎 # ! 𝑂 # ! + 𝑎 $ ! 𝑂 $ ! + 𝑎 % ! 𝑂 % ! + 𝑎 & ! 𝑂 & ! ) * 𝑒 ! !", "formula_coordinates": [5.0, 316.3, 350.47, 244.07, 141.08]}, {"formula_id": "formula_4", "formula_text": "α i = α i 1 , • • • , α i K to learn the relative contribution of different embedding regions of field f i . Trainable variables w i = w i 1 , • • • , w i", "formula_coordinates": [5.0, 312.0, 600.77, 252.0, 35.27]}, {"formula_id": "formula_5", "formula_text": "α i j = exp(w i j /τ ) K j=1 exp(w i j /τ ) , for j = 1, 2, . . . , K,(2)", "formula_coordinates": [5.0, 345.58, 654.17, 219.37, 28.57]}, {"formula_id": "formula_6", "formula_text": "i ′ = {e i ′ 1 , • • • , e i ′ d K } is calculated as: e i ′ j = e i j -µ i j (B) [σ i j (B)] 2 + ϵ , for j = 1, 2, . . . , d K ,(3)", "formula_coordinates": [6.0, 48.0, 65.36, 252.95, 59.59]}, {"formula_id": "formula_7", "formula_text": "e i = e i ′ ⊙ K j=1 α i j O i j ,(4)", "formula_coordinates": [6.0, 131.68, 221.57, 169.27, 29.41]}, {"formula_id": "formula_8", "formula_text": "L p = N i=1 |f i | N j=1 |f j | × K m=1 c m α i m ,(5)", "formula_coordinates": [6.0, 90.15, 529.08, 210.8, 29.41]}, {"formula_id": "formula_9", "formula_text": "c m = d 1 , m = 1; d m -d m-1 , otherwise,(6)", "formula_coordinates": [6.0, 89.74, 564.51, 211.21, 23.5]}, {"formula_id": "formula_10", "formula_text": "L(y, ŷ) = -y log ŷ -(1 -y) log(1 -ŷ) + λL p ,(7)", "formula_coordinates": [6.0, 75.76, 696.07, 225.19, 9.65]}, {"formula_id": "formula_11", "formula_text": "D = {d 1 , • • • , d K }.", "formula_coordinates": [6.0, 355.56, 87.2, 79.9, 9.65]}, {"formula_id": "formula_12", "formula_text": "α i = [α i j1 , • • • , α i j K ], satisfying α i j1 ≥ α i j2 ≥ • • • ≥ α i j K ; 2 sum = 0 ;", "formula_coordinates": [6.0, 318.2, 135.16, 169.51, 35.12]}, {"formula_id": "formula_13", "formula_text": "d fi = d fi + c jt ;", "formula_coordinates": [6.0, 340.9, 195.41, 67.36, 9.65]}, {"formula_id": "formula_14", "formula_text": "6 sum = sum + α i jt ; //", "formula_coordinates": [6.0, 318.6, 217.63, 139.95, 12.25]}, {"formula_id": "formula_15", "formula_text": "A = [ α 1 , • • • , α N ]", "formula_coordinates": [6.0, 312.0, 411.01, 75.54, 9.57]}, {"formula_id": "formula_16", "formula_text": "∂ A L (T ; A, W (A)) and ∂ W(A) L (T ; A, W (A)). (8)", "formula_coordinates": [6.0, 325.55, 603.17, 239.41, 9.96]}, {"formula_id": "formula_17", "formula_text": "N i=1 d f i and N i=1 |f i | × d f i , respectively.", "formula_coordinates": [9.0, 56.97, 726.28, 243.03, 21.56]}], "doi": ""}
