{"title": "k-Pareto Optimality-Based Sorting with Maximization of Choice", "authors": "Jean Ruppert; Marharyta Aleksandrova; Thomas Engel", "pub_date": "", "abstract": "Topological sorting 1 is an important technique in numerous practical applications, such as information retrieval, recommender systems, optimization, etc. In this paper, we introduce a problem of generalized topological sorting with maximization of choice, that is, of choosing a subset of items of a predefined size that contains the maximum number of equally preferable options (items) with respect to a dominance relation. We formulate this problem in a very abstract form and prove that sorting by k-Pareto optimality yields a valid solution. Next, we show that the proposed theory can be useful in practice. We apply it during the selection step of genetic optimization and demonstrate that the resulting algorithm outperforms existing state-of-the-art approaches such as NSGA-II and NSGA-III. We also demonstrate that the provided general formulation allows discovering interesting relationships and applying the developed theory to different applications. 1 Topological sorting [E. Knuth, 1997]  here means the process of sorting a set of items with respect to a preference or dominance relation. We use the terms preference and dominance interchangeably. 2 We use the terms item and element interchangeably.", "sections": [{"heading": "Introduction", "text": "In the modern era of information overload, the task of choosing a subset of the most useful items is extremely important. Various tools were developed with the aim to assist a user with this task, for example, text search engines [Croft et al., 2010] and recommender systems [Resnick and Varian, 1997]. In most of the cases, such systems suggest to the user a small set of elements 2 . Thereby, if the number of equally preferable options is large, a heuristic is used to discard a fraction of them. However, in some applications the user might be willing to analyze all equally preferable options with the aim to choose the best one. This can happen, for example, in the case of choosing a habitation.\nA similar problem of choosing a subset of most preferable elements also arises as an important step when solving various practical tasks. A straightforward example would be the selection step in genetic optimization algorithms [Mitchell, 1998]. At this step, a subset of the current population is chosen to advance to the next generation. Having the chosen subset made up of elements with large fitness values guides the evolution process in the desired direction. At the same time, selecting a subset with the largest variety of genes ensures variability of characteristics and allows faster exploration of the search space.\nThese examples bring us to the problem of generalizedfoot_0 topological sorting with choice maximisation which we also refer to as maximum choice problem. This problem aims to choose a subset of a predefined maximum size, consisting of most preferable items and containing the largest number of equally preferred elementsfoot_1 . To the best of our knowledge, this problems has not yet been studied in the literature. In this text, we propose a theoretical solution to the maximum choice problem and demonstrate how both the problem and its solution can be applied in practice.\nThe contributions of this work are the following:\n1. We formulate the maximum choice problem in a broad sense for arbitrary elements, preference relations R, and measures µ indicating the set sizes, see Section 2.\n2. We propose a solution based on the concept of k-Pareto optimality, whose definition relies on the relation R, see Section 3.\n3. We further investigate the proposed solution from a theoretical point of view and discover interesting characteristics, such as the relationship between k-Pareto optimal elements and the arc of hyperbola, see Section 4.\n4. Finally, we demonstrate the applicability of our approach to real-world problems by considering genetic optimization, see Section 5.", "publication_ref": ["b1", "b39"], "figure_ref": [], "table_ref": []}, {"heading": "Sorting with Choice Maximization", "text": "To formally define the problem of maximization of choice, we introduce several definitions in Sections 2.1 and 2.2. The resulting formalization of this problem is abstract and quite general. However, this generality allows discovering novel connections and applying the developed theory to numerous practical problems. We also illustrate the defined concepts with an example in Section 2.3.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Definitions", "text": "We consider a set X with a binary relation R. Intuitively xRy means that x is preferable to y. The case xRy and not yRx means that x is strictly preferable to y. This situation is denoted by xR * y. We also consider a positive and σ-finite measure µ [Halmos, 2013] defined on X. Thus, we have a measure space (X, Σ, µ), where Σ is a set of subsets of X, and µ intuitively indicates the size of these subsets. To ensure measurability, throughout this text the characteristic function 1 R of the relation R is assumed to be sufficiently regular 5 . The µ can be defined in different ways. Important examples are the counting measure and probability measures P . Depending on the definition of µ, it can indicate the following characteristics of the elements in X: how many?, how likely?, how important?, or what volume?\nTo illustrate these definitions, we consider the following example. Let X be a set of possible habitations of which the user has to choose the best according to his preferences encoded by the relation R. In such a situation, the relation R can be multidimensional. Let us assume, for simplicity, that an optimal habitation for the user is close to a given location, for example, his workplace (relation R l ), is situated in a district with a smaller population size (relation R p ), and is close to a river (relation R r ). Thus, the user's preferences can be represented by the preorder relation R = R l &R p &R r . In our example, all available habitations from X can be mapped onto points in a 3dimensional space of Proximity to the location × Population × River. The fact that R is a preorder rela-5 1R is equal to 1 if xRy and is equal to 0 otherwise.\ntion means that some elements of X can be comparable, while others not. For example, the habitation x with coordinates (50, 100, T rue) is strictly preferable to y with coordinates (60, 100, T rue), that is xR * y.\nAt the same time, the habitation z with coordinates (40, 100, F alse) is incomparable with x. Indeed, z is better with respect to R l , it is situated closer to the required location, but x is better with respect to R r , as the latter is situated near a river.\nHaving the task to find a subset of X that is 'best' according to R, a rational solution can be formulated with the following recursive expression: if an element x is selected, then all elements that are strictly preferable to x should be also selected. In our example, this translates into the task of finding a subset of habitations S R that might be suitable for the user. Naturally, if y ∈ S R , then x ∈ S R as the latter corresponds better to the preferences of the user defined by the relation R. We formalize this rationality condition by defining selections as follows.\nDefinition 1. A selection S is a subset of X such that x ∈ S and yR * x implies y ∈ S. The set of all selections in Σ is denoted by Sfoot_2 .", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "The Maximum Choice Problem", "text": "As discussed in Section 1, in practical applications when selecting a subset of X one might want not only to respect the above rationality constraint, but also to maximize the number of incomparable pairs. The latter condition is equivalent to the maximization of the diversity of the selected subset, or the maximization of the provided choice. In our example with habitations, if both x and z are presented to the user, then he can choose an appropriate habitation by himselffoot_3 .\nIn terms of our notations, this will be translated into the condition of selecting as many pairs x, y such that neither x is strictly preferable to y (¬xR * y) nor y is strictly preferable to x (¬yR * x). This means that there is freedom of choice between x and y (xRy = yRx). This motivates the following quantitative definition of choice for measurable subsets of X.\nDefinition 2. Choice offered by a set A is the number\ncho(A) = (µ × µ)({(x, y) ∈ A 2 |xRy = yRx}).\nThe choice offered by a measurable set A essentially measures how many pairs of items offering choice can be extracted from A. Additionally, if one wants to restrict the size of the selected subset, in our example, to present to the user a small set of suitable habitations with µ(S R ) ≤ m, then this leads us to the definition of the maximum choice problem: Maximum Choice Problem. For a given m find all selections T such that cho(T ) = max S∈S,µ(S)≤m cho(S).\nAny such selection T will be said to offer maximum choice for m.\nIn practical applications, it might be more insightful to consider the concept of diversity that is functionally related to the concept of choice. Definition 3. For any measurable set A, the diversity of A is the ratio div(A) = cho(A)/µ(A) 2 .\nThus div(A) is the likelihood that there is choice between the two randomly chosen elements. The main ingredient of our solution to the maximum choice problem is the following concept. Definition 4. The k-Pareto optimality of an element x ∈ X is the measure of the subset of X containing all elements strictly preferable to x:\npo(x) = µ({y|yR * x}).\nIf µ is the probability measure, the k-Pareto optimality of an element x, po(x), is the likelihood an element drawn at random from X is strictly preferable to x.\nFinally, we introduce the sets of at least k-Pareto optimal elements. Such sets consist of all elements in X with po ≤ k. In Section 3 we show that this concept yields a solution for the maximum choice problem. Definition 5. The at least k-Pareto optimal elements T k form the measurable set defined as follows:\nT k = {x ∈ X| po(x) ≤ k} 8 .", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Example", "text": "In this subsection, we discuss an illustrative example to demonstrate the concepts defined in Sections 2.1 and 2.2. Let us consider a finite subset X of R 2 , counting measure µ, and the relation R defined as follows:\n(x 1 , x 2 )R (y 1 , y 2 ) iff x 1 ≤ y 1 and x 2 ≤ y 2 , see Fig. 1.\nIn economics, x is Pareto optimal if there is no y in X such that xR * y. In our language, this means that po(x) = 0. Thus, k-Pareto optimality indicates how much an element is away from being Pareto optimal.\nLet X be comprised of six points presented in Fig. 2. As we are considering the counting measure, µ(X) = 6.  Sorting the set X by k-Pareto optimality of its elements will produce the following result: ({A, B, C}, {E}, {D, F }). This sorting is different from sorting by Pareto fronts. The latter approach is widely used in practice and is the basis of all Pareto dominance-based genetic optimization algorithms [Li et al., 2015]. Sorting by Pareto fronts is done in the following way. First, the first Pareto front, which is the set of non-dominated points, is identified. Next, the points from this front are removed from the consideration and the process is repeated until all points are assigned to a front. Sorting the points from Fig. 2 \nk that µ(T k ) = m.\nWe prove the above stated theorem in several steps. First, we show that for selections the computation of choice can be simplified. It only requires to compute a simple integral instead of a double integral.\nIntegral Formula. If S is a measurable selection and µ(S) < +∞, then\ncho(S) = S (µ(S) -2 po(x))dµ(x).(1)\nProof. The fact that set S is a selection means that ∀y ∈ S : {x ∈ S|xR * y} = {x ∈ X|xR * y}. That is, any element x from X strictly preferable to any element y in S, also belong to S (x ∈ S). Using the definition of choice from Def. 2 and µ(S) < +∞ we obtain\ncho(S) = µ(S) 2 -2(µ × µ)({(x, y) ∈ S 2 |xR * y}) = µ(S) 2 -2(µ × µ)({(x, y) ∈ S × X|yR * x}).\nFubini's theorem [Halmos, 2013] indicates that\n(µ×µ)({(x, y) ∈ S × X|yR * x} = = S X 1 R * d(µ(y)) dµ(x) = S po(x)dµ(x),\nwhere 1 R * is the characteristic function of R *foot_5 .\nFinally, the integral formula results from the fact that µ(S) 2 -2 S po(x)dµ(x) = S (µ(S) -2 po(x))dµ(x).\nLet's now consider the function c defined on Σ for any A of finite measure by\nc(A) = A (µ(A) -2 po(x))dµ(x).\nThe integral formula defined in Eq. ( 1) means that for any selection S, we have c(S) = cho(S). The second step of our proof of Theorem 1 is to show that T k is the largest measurable set that maximizes c for its respective measure. More precisely, we will prove the following lemma. Lemma 1. For any k such as µ(T k ) < +∞ we have\nc(T k ) = max A∈Σ,µ(A)≤µ(T k ) c(A). Moreover, if µ(A) ≤ µ(T k ) and c(A) = c(T k ), then A ⊆ T k almost-everywhere.\nThe context of this lemma is very similar to the knapsack problem [Martello, 1990]. In this problem, one needs to find a subset A of a finite set of items {x 1 , ..., x n } maximizing the total value Σ xi∈A v(x i ) under the constraint that the total weight Σ xi∈A w(x i ) of A does not exceed a predefined maximum weight w * .\nIn Lemma 1, the total value is c(A), the ratio of an element's value to its weight becomes µ(A)-2 po(x), and the weight constraint is expressed as µ(A) ≤ µ(T k ).\nThe solutions given by the lemma correspond to those yielded for the knapsack problem by George Dantzig's greedy approximation algorithm [Dantzig, 1957]. This algorithm consists of ordering elements by decreasing value-to-weight ratio and then taking the N first elements. N is chosen in such a way, that taking one more element would cause excessive weight. The process of proving Lemma 1 is similar to proving that George Dantzig's solutions are optimal for their respective weights.\nProof of Lemma 1. Let's consider T k such that µ(T k ) < +∞. To prove c(T k ) is the maximum, we need to show for any\nA ∈ Σ, that c(A) ≤ c(T k ) if µ(A) ≤ µ(T k ). As A = (A ∩ T k ) ∪ (A \\ T k ) and T k = (A ∩ T k ) ∪ (T k \\ A), requiring c(A) ≤ c(T k ) is equivalent to requiring A\\T k (µ(A)-2 po(x))dµ(x) ≤ T k \\A (µ(T k )-2 po(x))dµ(x).\n(2) By definition of T k , we have that po\n(x) > k for x ∈ A \\ T k , while po(x) ≤ k for x ∈ T k \\ A. Therefore, A\\T k (µ(A) -2 po(x))dµ(x) ≤ µ(A \\ T k )(µ(A) -2k),\n(3) and\nT k \\A (µ(T k ) -2 po(x))dµ(x) ≥ µ(T k \\ A)(µ(T k ) -2k). (4) The constraint µ(A) ≤ µ(T k ) means that µ(A \\ T k ) ≤ µ(T k \\ A). Thus, we have µ(A \\ T k )(µ(A) -2k) ≤ µ(T k \\ A)(µ(T k ) -2k). (5)\nFinally, combining Eq. ( 5) with Eq. (3) and Eq. ( 4) guarantees the inequality in Eq. ( 2) under the constraint µ(A) ≤ µ(T k ).\nLet us now consider A ∈ Σ such that µ(A) ≤ µ(T k ) and c(A) = c(T k ). We now proceed to show that A ⊆ T k almost everywhere. If c(A) = c(T k ), the inequality in Eq. ( 2) must be an equality. Under the assumption µ(A) ≤ µ(T k ), we again have the inequalities in Eq. (3), Eq. ( 4) and Eq. ( 5), which must be equalities if Eq. ( 2) is an equality. However, because po(x) > k for x ∈ A \\ T k , the inequality in Eq. ( 3) can only become an equality if µ(A \\ T k ) = 0. Now everything is in place to prove the theorem.\nProof of Theorem 1. Let us first prove that the at least k-Pareto optimal elements T k offer maximum choice. Lemma 1 says that on Σ the set T k maximises c for its respective measure. We assumed T k is a selection. At the same time, for any selection c = cho. It means that T k offers maximum choice for its respective measure. Moreover, from Lemma 1 and from S ⊆ Σ directly results that if a selection A offers maximum choice for µ(T k ), then A ⊆ T k almost everywhere.\nThe theorem does not guarantee uniqueness. For example, in the case of the relation ≤ on R and the Lebesgue measure, selections are all left-unbounded intervals and the choice of any selection is 0. However, if for any selection\nA ⊂ T k & µ(A) < µ(T k ) =⇒ cho(A) < cho(T k ), (6)\nthen T k is a unique maximum. This is a direct consequence from the fact that T k contains any other selection offering maximum choice for µ(T k ) < +∞. Also, the proof of the theorem indicates that transitivity is not necessary. The set T k is only required to be a selection. This is the case for Lebesgue area measure and the non-transitive relation R defined on the unit square by (\nx 1 , x 2 )R (y 1 , y 2 ) iff y1 2 ≤ x 1 ≤ y 1 and y2 2 ≤ x 2 ≤ y 2 . The sets T k fulfill the requirement of be- ing selections if R * satisfies the weakened transitivity condition xR * y =⇒ po(x) ≤ po(y).\nIt is possible to prove that for the counting measure, finite sets, and partial order relations, all selections offering maximum choice can be obtained when sorting by k-Pareto optimality and taking the first l elements. However, for discrete measures with nonconstant weights the above construction might not yield all selections offering maximum choice. A relative example is given in Fig. 3. The partial order relation represented by its Hasse diagram. [Davey and Priestley, 2002]. The set S is not of the form with A ⊆ T k \\ T * k . Nevertheless, it offers maximum choice for m = 3.\nT * k ∪ A • (1, 1) • (1, 1) • (1, 0) • (4, 0) S", "publication_ref": ["b29", "b5"], "figure_ref": ["fig_1", "fig_1", "fig_2"], "table_ref": []}, {"heading": "Further Theoretical Explorations", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Efficient Computation of Choice", "text": "Computation of choice may be simplified by performing the change of variable y = po(x) in the integral formula (1).\nProposition 1. For any selection of at least k-Pareto optimal elements T k such that µ(T k ) < +∞ cho(T k ) = µ(T k ) 2 -2 [0,k] xd(po * µ)(x),(7)\nwhere po * µ is the image measure defined by\n(po * µ)([a, b]) = µ(po -1 ([a, b])).", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Characteristics of Random Vectors", "text": "Let us study a probability space (Ω, Σ, P ). We consider two random variables X 1 and X 2 , as well as the partial order relation R Ω defined on Ω as follows:\nω x R Ω ω y iff X 1 (ω x ) ≤ X 1 (ω y ) and X 2 (ω x ) ≤ X 2 (ω y ).\nFor convenience, we use the following notations interchangeably: (X 1 (ω x ), X 2 (ω x )), (x 1 , x 2 ) or simply x.\nIn this case, the selections are the sets situated below any decreasing curve, like for example the hyperbola x 1 x 2 = 1/5 and the curve defined by max(x 1 , x 2 ) = 2/5 in Fig. 4. The k-Pareto optimality po((x 1 , x 2 )) is the joint cumulative probability distribution function F (x 1 , x 2 ). Finally, the at least k-Pareto optimal elements are situated below the curve F (x 1 , x 2 ) = k.\nHaving choice between x with coordinates (x 1 , x 2 ) and y with coordinates (y 1 , y 2 ) means the rectangles ((0, 0), (x 1 , 0), x, (0, x 2 )) and ((0, 0), (y 1 , 0), y, (0, y 2 )) are not nested, as depicted in Fig. 4a.", "publication_ref": [], "figure_ref": ["fig_3", "fig_3"], "table_ref": []}, {"heading": "Continuous Independent Variables", "text": "If X 1 and X 2 are continuous, then the function po can be considered to be a linear extension of R Ω . Indeed, if x and y are chosen independently and at random\nx y x 1 x 2 = 1 5 (0, 0) (1, 1) (a)\nx and y offer choice.\nx y from Ω, then P (po(x) = po(y)) = 0. On the other hand, it can be shown that div(Ω) = 1/2. This means that in half of the cases the relation R Ω cannot tell which element is preferable out of two elements extracted independently and at random from Ω.\nT max 2 5 (0, 0) (1, 1) (b) y is preferable to x.\nMoreover if X 1 and X 2 are independent, then the condition for uniqueness from Eq. ( 6) holds. In the special case where X 1 and X 2 are uniformly distributed on the interval [0, 1], the joint cumulative probability distribution function takes form of F (x 1 , x 2 ) = x 1 x 2 and the at least k-Pareto optimal elements are situated below a hyperbola x 1 x 2 = k. Combining this fact with Corollary 1 yields a surprising characterization of hyperbola, see Fig. 4 and the statement below.", "publication_ref": [], "figure_ref": ["fig_3"], "table_ref": []}, {"heading": "Characterization of Hyperbolas.", "text": "Out of all descending functions f from [0, 1] to [0, 1] delimiting an area 1 0 f (x)dx = c, the arc of hyperbola is the one offering the highest likelihood the rectangles ((0, 0), (x 1 , 0), x, (0, x 2 )) and ((0, 0), (y 1 , 0), y, (0, y 2 )) are not nested for two points x and y being drawn independently and at random from the delimited area.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Independence on Marginal Distribution", "text": "Sklar's theorem [Sklar, 1959, Durante et al., 2013] states that the cumulative distribution function F (x 1 , x 2 ) can be represented as C(F 1 (x 1 ), F 2 (x 2 )) for a copula C. Marginas of X 1 and X 2 are fully described by the marginal cumulative probability distributions F 1 and F 2 , whereas the copula describes the dependence structure between X 1 and X 2 . The copula can be considered as a joint cumulative distribution function having two uniform marginal distributions on [0, 1]. Below we show that the introduced concepts do not depend on the marginal distribution of X 1 and X 2 .\nProposition 2. For a continuous random vector (X 1 , X 2 ) and the relation R Ω , k-Pareto optimality, choice, diversity and selections offering maximum choice only depend on the copula C of X 1 , X 2 .\nProof. Let us consider the mapping\nG : Ω → [0, 1] 2 , ω x → (F 1 (x 1 ), F 2 (x 2 )).\nWe consider R Ω and P defined on Ω. At the same time, on [0, 1] 2 we consider R defined by (x 1 , x 2 )R (y 1 , y 2 ) iff x 1 ≤ x 2 and y 1 ≤ y 2 , as well as the image measure G * P defined on [0, 1] 2 by (G * P )(A) = P (G -1 )(A). The map G preserves probabilities in the sense that for any measurable A in Ω we have (G * P )(G(A)) = P (A). Moreover, G preserves the relations in the sense that xR Ω y iff G(x)R G(y). Selections are preserved in the sense that if S is a selection for R Ω , then G(S) is a selection for R . Ignoring negligible subsets, this mapping between selections is one-to-one. Therefore, G also preserves selections, k-Pareto optimality, choice, and diversity.\nThe proposition finally results from the fact that G * P only depends on the copula. This is a consequence of the fact that for any (a 1 , a 2 ) ∈ [0, 1] 2 , we have\n(G * P )([0, a 1 ] × [0, a 2 ]) = C(a 1 , a 2 ).\nThis equality is a result of the following statements: 1) continuity which guarantees that a 1 and a 2 can be written as F 1 (x 1 ) and F 2 (x 2 ) for some appropriate x 1 and x 2 ; 2) the definition of image measure; 3) the fact that G = (F 1 , F 2 ) • (X 1 , X 2 ); and 4) the equality\nF (x 1 , x 2 ) = C(F 1 (x 1 ), F 2 (x 2 )).\nProposition 3. If X 1 and X 2 are two continuous independent random variables, then for the relation\nR Ω P (T k ) = k -k ln(k), cho(T k ) = (k -k ln(k)) 2 -k 2 1 2 -ln k .\nProof. Let us again consider the map G. The image measure G * P induced by G on [0, 1] 2 is the Lesbegue area measure. Independently of P , we have\nG(T k ) = {(x 1 , x 2 ) ∈ [0, 1] 2 |x 1 x 2 ≤ k}.\nSimple integration for Eq. ( 7) yields\nP (po -1 (] -∞, x])) = P (T x ), = (x1,x2)∈[0,1] 2 (G(T x )) = x -x ln(x).\nTherefore, po * P = -ln(x)dx and Eq. ( 7) results in\ncho(T k ) = (k -k ln(k)) 2 -2 k 0 x(-ln(x))dx, = (k -k ln(k)) 2 -k 2 (1/2 -ln k) .\nNow, it is possible to show that lim k→0 div(T k ) = 1.\nThe fact that diversity slowly tends to the maximum 0 0.2 0.4 0.6 0.8 1 0.0 0.2 0.4 0.6 0.8 1.0 \nx 1 x 2 min(x 1 , x 2 ) max(x 1 , x 2 ) (x 1 + x 2 )/2 x 1 x 2 (po)\nmin(x 1 , x 2 ) max(x 1 , x 2 ) (x 1 + x 2 )/2 x 1 x 2 (po)\nFigure 6: Fraction of the best elements and diversity.\npossible value of 1 as k tends to zero becomes even more surprising if one looks at the selections\nT min a = {(x 1 , x 2 ) ∈ [0, 1] 2 | min(x 1 , x 2 ) ≤ a}, T max a = {(x 1 , x 2 ) ∈ [0, 1] 2 | max(x 1 , x 2 ) ≤ a}.\nHere, lim a→0 div(T min a ) = 3 4 , and div(T max a ) = 1 2 . To further illustrate this observation, let us consider selections of a fixed measure m, which represent the best m * 100% of elements, defined with different sorting criteria: minimum min(x 1 , x 2 ), maximum max(x 1 , x 2 ), average x1+x2 2 , and Pareto optimality x 1 x 2foot_6 . As we can see in Fig. 6, min(x 1 , x 2 ) delimits selections containing too many large values, that is, extremes are overvalued. On the other hand, all other sorting criteria except po undervalue extremes and include too many elements situated around the diagonal\nx 1 = x 2 .\nFinally, in Fig. 6 we demonstrate how diversity of the selections defined above depends on the fraction of selected elements mfoot_7 . We can see that diversity is the largest when sorting by k-Pareto optimality. This is a direct consequence of Theorem 1.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Further Practical Explorations", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Computation Complexity", "text": "A common solution for ranking n elements of a set X according to a partial order relation R is to rank the elements according to their average ranking with respect to all linear extensions of R. However, the total number of linear extensions exponentially increases with n, and the resulting algorithms are complex and slow [de Loof, 2010, p. 48]. For example, random sampling of linear extensions has an expected running time of O(n 3 log n) [Huber, 2006]. Below we show that sorting by k-Pareto optimality offers an efficient alternative.\nThe basic algorithm for the k-Pareto optimality based sorting is straightforward. In the case of an arbitrary relation R, po(x) is computed by summing up the measures of the items that are strictly preferable to x. This requires one pass through the whole set X for every element x ∈ X with computation complexity O(n 2 ). The complexity of sorting X by increasing values of po is O(n log n). Therefore, the total computational complexity is O(n 2 ).\nThe case of composite relations defined on the probability space allows constructing even faster sorting procedures. We illustrate this idea for R = R l &R p &R r from our housings example. We define the component relations as follows: for i ∈ {l, r, p}, aR i b iff X i (a) ≤ X i (b), where the real valued random variable X l represents proximity to the location, X p represents population size, and X r (x) is 0 when x is close to a river and 1 otherwise. For independent X i , we have: po(x) = P ({y|yR * x}), = P ({y|yRx}) -P ({y|yRx and xRy}), = i∈{1,...,m}\nP (X i ≤ x i ) - i∈{1,...,m} P (X i = x i ).\nThe cumulative probability distributions F i (x) = P (X i ≤ x) can be approximated by the respective empirical cumulative probability distributions Fi (x). The computation complexity of estimating Fi is O(n log n). This needs to be done for every component relation R i , resulting in the total complexity of O(n log n).", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Application to Genetic Optimization", "text": "In Section 1, we hypothesized that sorting with choice maximization can be beneficial for genetic optimization. Indeed, this strategy results in the maximization of the population diversity and allows exploring the search space more efficiently. Additionally, Pareto dominance-based many-objective 12 genetic optimiza-tion algorithms are known to suffer from the lack of selection pressure [Palakonda et al., 2018]. When the number of objectives increases, the number of incomparable solutions grows exponentially. However, as shown in Section 4.2, sorting random independent vectors by their Pareto optimality can be considered as a liner extension of the defined preference relation. The fact that P (po(x) = po(y)) = 0 means that such sorting rarely produces ties and for any two solutions either x is preferable to y or vice versa. In the rest of this subsection, we demonstrate that the proposed approach indeed improves the performance of genetic algorithms in the case of independent objectives.\nTo evaluate the proposed sorting procedure, we use it in NSGA-II instead of Pareto dominance-based sorting. We experiment with two measures µ: counting and probability measures. This gives us two versions of genetic algorithms referred to as PO-count and PO-prob respectively. These algorithms are compared with implementations of the state-of-the-art algorithms NSGA-II and NSGA-III [Deb and Jain, 2013] from the deap python library 13 . For the experimental evaluation, we use the 0/1 knapsack problem with independent objectives as defined in [Zitzler and Thiele, 1999]. The number of knapsacks (objectives) is varied within the following set n k ∈ {2 -8, 10, 15, 25} and the number of items is set to 250. We adopt random selection with replacement and uniform crossover with mutation probability 0.01. We set the population size to 250 and the number of generations to 500. All results are the average among 30 independent runs.\nBelow we analyze the performance of different algorithms in terms of the classical hypervolume metric [Shang et al., 2020] with the origin of coordinates as a reference point. In our setup, this metric is to be maximized. We choose NSGA-II as the baseline, and present the relative changes in the hypervolume indicator for the rest of the algorithms in Fig. 7 (increase: positive number, decrease: negative number). We notice that despite having been developed for the manyobjective optimization, NSGA-III almost always results in lower values of hypervolume, even for a large number of knapsacks. This confirms a similar observation from [Ishibuchi et al., 2016], and supports our choice of NSGA-II as a baseline for implementation and comparison instead of NSGA-III. Further, we see that the value of relative increase for PO-count is always very close to 0. It means that PO-count yields a population covering the same hypervolume as NSGA-II. Contrarily, PO-prob improves the hypervolume, as compared to NSGA-II. This difference is visible for small n k (+4% for n k = 2) and is especially prominent for large n k (+60% for n k = 25). For n k between 13 https://deap.readthedocs.io/en/master/ 1 2 3 4 5 6 7 8  5 and 7, PO-prob results in lower values of hypervolume than NSGA-II. However, the relative decrease in thes cases does not exceed -1.63%. Also, within this range, PO-count performs slightly better than other algorithms. These results demonstrate that the proposed approach improves the performance of genetic algorithms, especially in the case of many-objective optimization. It also suggests that the choice of the measure µ has a large impact on the performance. The latter relationship will be studied in future work.", "publication_ref": ["b37", "b9", "b45", "b41", "b21"], "figure_ref": ["fig_5"], "table_ref": []}, {"heading": "Conclusion", "text": "In this paper, we formulate the problem of generalized topological sorting with choice maximization, which, to the best of our knowledge, was not considered in the literature before. We also prove that the at least k-Pareto optimal sets provide unique solutions. Further theoretical analysis of this problem leads us to an interesting relationship between the diversity of random points and the arc of hyperbola. Additionally, we propose a computationally efficient algorithm for the calculation of k-Pareto optimality for probability measures. Finally, we demonstrate a successful application of the developed theory. We show that sorting by k-Pareto optimality can drastically improve the performance of many-objective genetic optimization algorithms. In our experiments, the proposed solution based on the probability measure allows increasing the value of hypervolume by up to 60% for 25 objectives. This result can be considered as a potential solution to the problem of searchability deterioration in Paretodominance optimization.\nWe also believe that the proposed general framework can be used in different applications. In future work, we plan to study the applicability of k-Pareto optimality for constrained optimization, scheduling problems, recommender systems, and the development of statistical indicators. Maximization of choice might be also useful when studying causality and fairness.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "A.2 Cone-based Relations", "text": "Let us again consider the unit square, the Lebesgue measure, and a positive constant a. However, this time the preference relation is defined as follows: yR a x iff y 2 ≤ x 2 and x 2 -y 2 ≥ a(y 1 -x 1 ). The above relation R a is an example of a cone-based relation illustrated in Fig. 9. This relation has the intuitive meaning of giving up (x 1 , x 2 ) for getting (y 1 , y 2 ) if the improvement (diminution) in the second characteristic is at least a times the trade-off (increase) in the first characteristic. In this case, selections are sets delimited by descending curves Let us now consider the sets of at least k-Pareto optimal elements of measure 0.25 for the three values of a: a = 1 10 , a = 1 2 , and a = 2, see Fig. 8b. Larger values of a represent higher maximum accepted trade-offs. This is represented by the gradual degeneration of the hyperbola into a straight horizontal line when a increases. As shown in the figure, the three sets demonstrate plausible behavior. In the situation discussed in Appendix A.1, the relation R corresponds to the extreme case of the relation R a with a = 0.\nx 2 = f (x 1 ) such that -1 a ≤ df dx1 ≤ 0.", "publication_ref": [], "figure_ref": ["fig_6"], "table_ref": []}, {"heading": "A.3 Transitive relations", "text": "In general, it is possible to show that if R * is transitive, then for any k, the set T k is a selection. In particular, if R is a partial order relation, µ is strictly positive, and X is countable, we obtain a linear extension [Dantzig, 1957] of R when sorting X by increasing values of po and sorting ties in any order. Selections are represented by downsets. The latter are obtained when topologically sorting X and taking the first n elements, for any n. If µ is the counting measure, then po(x) is simply the number of elements that can be reached by following downwards the edges of the corresponding Hasse diagram. An example of such a relation represented by its Hasse diagram is depicted in Fig. 10.    Figure 13: Sorting 500 uniformly distributed points. Points in black belong to the first 10 equivalence classes (fronts). Note, that the total number of equivalence classes is larger for po-based sorting. The latter approach results in fewer ties.\nresults of sorting for uniformly distributed points, we observe that both sorting methods result in hyperbola-like selections, see Fig. 13. This means that sorting by Pareto fronts is more sensitive to the topological structure of the analyzed space, while sorting by po preserves its characteristics.", "publication_ref": [], "figure_ref": ["fig_7", "fig_2", "fig_2"], "table_ref": []}, {"heading": "B.2 Further Solutions of the Maximum Choice Problem", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Further similar solutions", "text": "It is possible to prove that Theorem 1 also holds for T * k defined with a strict inequality (<) as follows, see Def. 5 for comparison.\nT * k = {x ∈ X| po(x) < k}. In this case, the proof of the fact that T * k is the largest in Lemma 1 requires analysis of inequality (4) instead of inequality (3). However, the proof of the fact that any selection T such that T * k ⊆ T ⊆ T k offers maximum choice for µ(T ) becomes a bit more technical. Moreover, it is possible to prove that T is the largest selection of this kind. Precisely, for any other selection S offering maximum choice for µ(T ), S ⊆ T for some T such that µ(T ) = µ(T ) and\nT * k ⊆ T ⊆ T k .", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Completeness of the Solutions", "text": "In the case condition in Eq. ( 6) holds, and if for any selection S there is a k and there are selections T such that T * k ⊆ T ⊆ T k and µ(T ) = µ(S), then those selections T are the only selections offering maximum choice. Therefore, we have a complete list of selections offering maximum choice. This is the case for the typical example of the relation R defined in Section 2.3 and the Lebesgue area measure defined on the unit square [0, 1] 2 . This also holds for any discrete measure with constant non-zero weights, for example, for the counting measure on a finite set with a partial order relation. In the latter case, topologically sorting by increasing values of po and then taking the first n elements results in a set offering maximum choice.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Existence of Solutions of a Different Nature", "text": "Let us consider again the example in Fig. 3. Here, the set S is not of the form\nT * k ∪ A with A ⊆ T k \\ T * k .\nNevertheless, it offers maximum choice for m = 3.", "publication_ref": [], "figure_ref": ["fig_2"], "table_ref": []}, {"heading": "B.3 Diversity", "text": "As it was discussed in Section 2.2, the concept of maximum choice is functionally related to the concept of diversity, see Def. 3. In Theorem 1 we cannot simply replace choice by diversity. However, by considering only selections of a fixed measure, we obtain the following straightforward corollary of Theorem 1.\nCorollary 1. If R is a transitive relation, then for any set of at least k-Pareto optimal elements T k such that µ(T k ) < +∞, we have\ndiv(T k ) = max S∈S,µ(S)=µ(T k ) div(S).\nMoreover T k is the unique such maximum. Precisely if S is a selection such that µ(S) = µ(T k ), and div(S) = div(T k ), then S = T k almost everywhere.\nC Further Practical Exploration of at least k-Pareto optimal elements", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "C.1 Additional Results for Genetic Optimization", "text": "In Section 5.2, we evaluate the performance of the genetic algorithms using the hypervolume indicator. In this section, we further analyze the behavior of both the state-of-the-art and the proposed algorithms with respect to other metrics. In particular, we study the fraction of solutions dominated by the solution of alternative algorithms and analyze the time complexity of the sorting procedure.\nWe calculate the percentage of dominated solutions as follows. For a given pair of algorithms algorithm1 and algorithm2, we calculate how many solutions of algorithm2 (dominated algorithm) are dominated by solutions of algorithm1 (dominating algorithm). After that, we average the obtained results among all dominating algorithms to get an average fraction of dominated solutions, denoted by θ. Naturally, lower values of θ indicate better performance. We present the corresponding results in Fig. 14. We notice the following tendencies. NSGA-II and PO-count behave very similarly. For n k = 2, the value of θ for these algorithms is around 20%. After that, it starts increasing and reaches its peak of approximately 45% for n k = 7. Finally, it gradually decreases to 24% for n k = 25. NSGA-III starts at a similar level and reaches its peak of approximately 30% for n k = 5. After that, it decreases below 10% for n k = 7 and stays relatively close to 0 for the larger numbers of knapsacks. These results demonstrate the superiority of NSGA-III over NSGA-II in the case of many-objective optimization. PO-prob starts at around 16%. However, for n k = 4 the value of θ it already almost 0 and does not go up for larger numbers of knapsacks. This shows that the solutions produced by this algorithm are rarely dominated. Thereby, PO-prob is an effective approach for many-objective optimization problems. In Fig. 15, we demonstrate the dependence of sorting time on the population size for values of pop size ranging from 50 to 500. The reported values are the averages over 100 independent executions of one iteration of the corresponding genetic algorithm. From the figure, we can see that PO-prob requires much less time than all other algorithm. The results for NSGA-II and PO-count tend to be very close, as in other experiments. This observation also has theoretical explanation. Indeed, choosing the next generation for NSGA-II and NSGA-III has time complexity of O(N 2 M ) and max{O(N 2 M ), O(N 2 log M -2 N )} respectively where M stands for number of objectives and N is the population size, see [Deb et al., 2002,Deb andJain, 2013]. At the same time, sorting in PO-prob comes down to independent sorting procedures with respect to every objective. The time complexity of this procedure is O(N M log(N )). These results are in line with the theoretical analysis presented in Section 5.1 and prove the computational efficiency of the approximate ranking calculation procedure used in PO-prob.\nThe maximum choice theorem (Theorem 1) has an intuitive interpretation in the context of genetic algorithms. Assume that the selection step is required to pick a selection of a given maximum size for breeding offspring, and both parents are chosen independently and at random form this selection. Then selections obtained via k-Pareto optimality-based sorting yield most offspring with parents offering choice. Choice here means that every parent is strictly superior to the other with respect to at least one objective, or both have the same values of all objectives.", "publication_ref": [], "figure_ref": ["fig_11", "fig_12"], "table_ref": []}, {"heading": "C.2 Kendall's τ Rank Correlation Coefficient and Statistical Tests", "text": "Let us again consider the case of 2 continuous random variables introduced in Section 4.2. Let us assume that X 2 = f (X 1 ) for some increasing function f . For almost all (x, y), either xRy or yRx holds. Thus div(Ω) = 0. Moreover, diversity only depends on the copula which encodes the dependency structure between X 1 and X 2 , see Section 4.2.2 and Appendix B.3. Therefore, a value of div(Ω) close to zero indicates X 1 and X 2 are strongly correlated via an increasing function. It leads to the idea that Kendall's τ rank correlation coefficient [Kendall, 1948] and diversity are strongly related concepts.\nLet us consider a sample of n points X = {(x i1 , x i2 ) i∈{1,2,...,n} }. Duplicates almost never occur and the order in which points are drawn has no importance. Therefore, X should be treated like a set. We consider the counting measure # and the relation R define on X. Diversity and choice of X are denoted by div # and cho # .\nKendall's τ correlation coefficient is defined as follows\nτ = # con -# dis n 0 ,\nwhere # con is the number of concordant pairs (pairs that do not offer choice in our terminology), # dis is the number of discordant pairs (pairs that do offer choice), and n 0 is the total number of pairs. As duplicates are discarded and the pairs are not ordered, n 0 = n(n -1)/2.\nFrom the above remarks, we have cho # = 2# dis +n and # con +# dis = n 0 . Combining these equalities, we obtain the following relation\nτ = n 2 + n -2 cho # n 2 -n .\nDividing the numerator and the denominator by n 2 and then neglecting 1 n , we obtains that approximately\nτ ≈ 1 -2 div # .\nThis result means that the theory developed in this paper can be used for constructing non-parametric statistical tests generalizing Kendall's τ rank correlation coefficient and can be used for testing partial correlation. Below, we illustrate this property by building an indicator for distinguishing between wealthy and non-wealthy states.\nA group of states might be considered wealthy if the following two conditions hold.\n1. In the group there is no positive correlation between per capita income and the indicator representing education and health.\n2. If a state belongs to a group of wealthy states, then all states having higher per capita income and better value of education and health indicator, must also belong to that group. Now, we define the set of all wealthy states as the largest group of states that are wealthy. If Kendall's τ is used to compute correlation, and correlation is considered to be positive if div # < 1 2 , then the elements of the above set can be easily identified. Indeed, Corollary 1 says that the set of wealthy states must be a set of at-least k-Pareto optimal states for the relation higher income and better education and health indicator. For the year 2015foot_9 , we took Gross National Income (GNI) per capita at purchasing power parity (PPP) as the income indicator, and the square root of the education and life expectancy as the education and health indicatorfoot_10 . The scatter plot in Fig. 16 shows the resulting division of states into wealthy and non-wealthy. We can observe that the wealthy states are defined as the states with GNI ≥ 20 000$. This seems perfectly plausible. ", "publication_ref": [], "figure_ref": ["fig_13"], "table_ref": []}, {"heading": "C.3 Application to Recommender Systems", "text": "Let us again consider the housing example introduced in Section 2.1. If we aim to provide to the user a full set of possible alternative houses that might fit his preferences, then, according to Theorem 1, sorting available habitations by the increasing value of po is the best strategy. As it was discussed in Section 5.1, in the case of independent components of the underlying composite relations, the computation of po can be simplified by using tools from probability theory. Apart from computational efficience, estimating po in this way has several additional advantages.\n• Such sorting results in fewer ties and a meaningful score. Indeed, sorting items x by increasing values of po(x), is the same as sorting by decreasing values of -log(po(x)). The self-information -log(F i (x)) [Jones, 1979], which is additive, indicates how much a characteristic i is valued. In this case, there is no need to introduce any arbitrary coefficients as it is done when sorting by a weighted mean of the characteristics x i .\n• If the condition of independence holds, then rarer characteristics get valued more. This makes sense from the economic point of view and is intuitively necessary for maximizing choice.\n• If beyond the relation R, there is complete uncertainty about the user's complex needs, tastes and desires, then offering him a selection of maximum choice maximizes the likelihood he finds an appropriate item.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "C.4 Constrained Multi-Objective Genetic Algorithms", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "C.4.1 Problem Definition", "text": "A Multiobjective Constrained Optimization Problem (CMOP) is a mathematical problem that is defined as follows [Kumara et al., 2020]:\nMinimize f 1 (x), f 2 (x), . . . , f M (x) subject to g i (x) ≤ 0, i ∈ {1, 2, ..., ng}, h j = 0, j ∈ {ng + 1, ng + 2, ..., ng + nh}, L k ≤ x k ≤ U k , h ∈ {1, . . . , D},\nwhere\n• f i represents the i-th objective function,\n• M is the total number of conflicting objective functions,\n• x = (x 1 , x 2 , . . . , x D ) is a solution vector of length D,\n• L k and U k are the lower and upper bounds of the search space at the k-th dimension.\nNumerically, we consider a constraint h j to be verified iff h j ∈ [-, ]. A solution is feasible iff all ng + nh constraints g i and h j are verified.", "publication_ref": ["b27"], "figure_ref": [], "table_ref": []}, {"heading": "C.4.2 Problem Re-Definition with Preorder Relations", "text": "In a more general setting, we can represent a constraint g i ≤ 0 by the preorder relation R gi defined as follows:\nxR gi y iff g i (x) ≤ 0 or g i (x) ≤ g i (y). (8\n)\nAnd a constraint h j ∈ [a j , b j ] can be represented by the preorder relation R hj defined as follows:\nxR hj y iff      h j (x) ∈ [a j , b j ] or h j (y) ≤ h j (x) ≤ a j or b j ≤ h j (x) ≤ h j (y).(9)\nThen, the combination of the constraints g i ≤ 0, i ∈ {1, 2, ..., ng} and h j = 0, j ∈ {ng + 1, ng + 2, ..., ng + nh} can be represented by the preorder relation R c defined as follows.\nxR c y iff xR g1 y and . . . and xR gng y and xR hng+1 y and . . . and xR h ng+nh y.\nThe objective consisting in minimizing f i is represented by the preodrer relation R fi :\nxR fi y iff f i (x) ≤ f i (y).\nMinimization of all M objectives f 1 , . . . , f M is represented by the preorder relation R f defined as follows ", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "C.4.3 Solution", "text": "To solve the problem defined above, we can use the standard Adaptive Differential Evolution Algorithm jDE [Noman et al., 2011] with k-Pareto optimality for R cf as a fitness function. For any point x, k-Pareto optimality of x is the likelihood a point drawn at random from the population strictly Pareto dominates x for R cf . Smaller values of po mean better fitness. Under the independence assumption of objectives and constraints, we can easily compute k-Pareto optimality po(x). When saying P ({y|yR = cf x}) = 0, we assume the considered objectives and constraints are not constant on too large sets. Without this simplification, the computation becomes longer, see the derivation below. Any cumulative probability distribution defined above, F i for f i and G i for g i , can be estimated via its empirical cumulative probability distribution. Note, for a population {x 1 , . . . , x k , . . . , x ps } of size ps, and for any real valued function f , the empirical cumulative probability distribution F of f is defined as follows:\nF (z) = #({x k |f (x k ) ≤ z}) ps .\nIn a similar way, P (y|yR hj x) can be estimated by H j * (h j (x)), where H j * (z) is defined as (10)\nH j * (z) =\nThe computation of every Fi can be performed as follows:\n• sort the values f (x k ) in increasing order, and store them in an array;\n• create two new arrays;\n• loop over the sorted values f (x k ); each time a new distinct value f (x k ) is encountered:\nappend the previously encountered f (x k ) to the first array, append to the second array the loop counter, which is equal to the value of the empirical cumulative probability distribution Fi of the previously encountered value f (x k ).\nThus, retrieving Fi (x) can be performed via a binary lookup with run time O(log ps). Computation of H j * can be performed in the same way. In this case, all three cases of the definition in Eq. ( 10 Finally, it is possible to show that the total run time of the k-Pareto optimality based sorting is O((ng + nh + M )ps log ps).", "publication_ref": ["b35"], "figure_ref": [], "table_ref": []}, {"heading": "C.5 Exploratory Database Queries", "text": "Simple database queries q, objectives, and constraints in optimization problems often consist in requiring a continuous attribute to be in a given interval, or a discrete attribute to be equal to a given value. Conceptually, those queries are boolean functions. Complex queries are often conjunctions of the form r = q 1 ∧ q 2 ∧ • • • ∧ q n .\nIn our formalism, these simple queries translate into simple pre-order relations of the form xRy. Requiring an element to be in an interval can be represented by xR q y iff x is in the desired interval, or x is not situated further from the interval than yfoot_11 . Requiring an attribute to be equal to a given value translates into the relation xR q y if for x the attribute takes the required valuefoot_12 . Complex queries then translate into the composite relations of the form R r = R q1 ∧ R q2 ∧ • • • ∧ R qn . The simple sub-relations R q2 are pre-order relations, and, therefore, R r is also a pre-order relation and is transitive. However, these relations are not partial order relations, as reflexivity does not necessarily hold. A \"topological\" sorting according to our partial order relation R r can be viewed as a valid fuzzy relaxation of the strict functional query. There are many possible fuzzy relaxations and the problem is to find one that is suitable for a given application. The k-Pareto optimality is one of such fuzzy extensions of the query. It is 0 if all criteria are satisfied, and higher values of k-Pareto optimality indicate worse results. The maximum choice theorem applies here, and the user is offered the maximum choice. This is of particular interest for exploratory queries, such as job search, especially, if there are no items in the database that satisfy all the criteria. Direct brute-force search for selections offering maximum choice is unfeasible as there are too many selections to consider.\nMoreover, in the above formalism, one can treat classical optimization objectives in the same way. Maximizing an attribute x can be represented by the relation xRy iff x ≥ y, and the minimization can be represented by the relation ≤. In the above framework, negation can be represented via the relation R -1 defined by xR -1 y iff yRx.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "C.6 Scheduling Algorithms", "text": "In the case of scheduling algorithms, xRy can be given the meaning 'x depends on y'. Then, selections represent sets of tasks that remain to be processed. Having a large choice means having much freedom to parallelize tasks or having flexibility in case the rescheduling is required.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Supplementary Materials A Further Examples for Simple Relations and Measures", "text": "In the first two supplementary examples, we consider a situation typical in economics or multi-objective optimization. Later, we show how the proposed concepts apply to arbitrary transitive relations.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "A.1 Continuous Measures", "text": "Let us again consider R as defined in Section 2.3. The relation R models preference for small values of x 1 and x 2 . However, instead of assuming X to be a finite subset of R 2 , we now study the unit square [0, 1] × [0, 1] with three continuous measures: the Lebesgue area measure dx 1 dx 2 , as well as 2x 2 dx 1 dx 2 and 4x 1 x 2 dx 1 dx 2 . In each case, the total measure of the unit square equals to one. The Lebesgue area measure represents elements with two uniformly distributed characteristics x 1 and x 2 ; 2x 2 dx 1 dx 2 represents rarefaction of items having small values of x 2 , whereas 4x 1 x 2 dx 1 dx 2 represents rarefaction of items having small values of both x 1 and x 2 .\nFor each of the cases defined above, in Fig. 8a we show the set of at least k-Pareto optimal elements of measure 0.1, which corresponds to selecting the 10 best percent. All three sets demonstrate the qualitative behaviours expected from sets delimited by indifference curves when the corresponding rarefaction occurs. Indeed, the curve corresponding to the uniform distribution and the Lebesgue area measure dx 1 dx 2 is symmetric. Also, in this case, po(x 1 , x 1 ) = x 1 x 2 , and the sets of at least k-Pareto optimal elements are the sets situated below arcs of hyperbola defined by the equation x 1 x 2 = k, see Sections 4.2 and 4.2.1 for more details. Applying rarefaction with respect to x 2 prioritises smaller values of this characteristic. This is represented by shifting upwards the right part of the hyperbola arc, see the curve for 2x 2 dx 1 dx 2 . Indeed, in this case, the small values of x 2 are observed less often. This results in selecting additional elements with large values of x 1 but relatively small values of x 2 to compensate for this rarefaction. Finally, rarefaction with respect to both x 1 and x 2 results in the fact that the small values of both characteristics are observed less often. Thus, elements with larger values of x 1 and x 2 should be selected to generate a selection of the required measure. It results in the shift of the hyperbola upwards following the direction of the main diagonal, see the curve for 4x 1 x 2 dx 1 dx 2 .  ", "publication_ref": [], "figure_ref": [], "table_ref": []}], "references": [{"ref_id": "b0", "title": "", "journal": "", "year": "2010", "authors": " Croft"}, {"ref_id": "b1", "title": "Search engines: Information retrieval in practice", "journal": "Addison-Wesley Reading", "year": "2010", "authors": "W B Croft; D Metzler; T Strohman"}, {"ref_id": "b2", "title": "", "journal": "", "year": "1957", "authors": " Dantzig"}, {"ref_id": "b3", "title": "Discretevariable extremum problems", "journal": "Operations research", "year": "1957", "authors": "G B Dantzig"}, {"ref_id": "b4", "title": "", "journal": "", "year": "2002", "authors": "Priestley Davey"}, {"ref_id": "b5", "title": "Introduction to lattices and order", "journal": "Cambridge university press", "year": "2002", "authors": "B A Davey; H A Priestley"}, {"ref_id": "b6", "title": "", "journal": "", "year": "2010", "authors": " De Loof"}, {"ref_id": "b7", "title": "Efficient computation of rank probabilities in posets", "journal": "", "year": "2010", "authors": "K De Loof"}, {"ref_id": "b8", "title": "", "journal": "", "year": "2013", "authors": "Deb ; Jain "}, {"ref_id": "b9", "title": "An evolutionary many-objective optimization algorithm using reference-point-based nondominated sorting approach, part i: solving problems with box constraints", "journal": "IEEE transactions on evolutionary computation", "year": "2013", "authors": "K Deb; H Jain"}, {"ref_id": "b10", "title": "", "journal": "", "year": "2002", "authors": "Deb "}, {"ref_id": "b11", "title": "A fast and elitist multiobjective genetic algorithm: Nsga-ii", "journal": "IEEE transactions on evolutionary computation", "year": "2002", "authors": "K Deb; A Pratap; S Agarwal; T Meyarivan"}, {"ref_id": "b12", "title": "", "journal": "", "year": "2013", "authors": "Durante "}, {"ref_id": "b13", "title": "A topological proof of sklar's theorem", "journal": "Applied Mathematics Letters", "year": "2013", "authors": "F Durante; J Fernandez-Sanchez; C Sempi"}, {"ref_id": "b14", "title": "", "journal": "", "year": "1997", "authors": "E Knuth"}, {"ref_id": "b15", "title": "The Art of Computer Programming", "journal": "Addison-Wesley", "year": "1997", "authors": "E Knuth; D "}, {"ref_id": "b16", "title": "", "journal": "", "year": "2013", "authors": " Halmos"}, {"ref_id": "b17", "title": "Measure theory", "journal": "Springer", "year": "2013", "authors": "P R Halmos"}, {"ref_id": "b18", "title": "", "journal": "", "year": "2006", "authors": " Huber"}, {"ref_id": "b19", "title": "Fast perfect sampling from linear extensions", "journal": "Discrete Mathematics", "year": "2006", "authors": "M Huber"}, {"ref_id": "b20", "title": "", "journal": "", "year": "2016", "authors": " Ishibuchi"}, {"ref_id": "b21", "title": "Performance comparison of nsga-ii and nsga-iii on various manyobjective test problems", "journal": "IEEE", "year": "2016", "authors": "H Ishibuchi; R Imada; Y Setoguchi; Y Nojima"}, {"ref_id": "b22", "title": "", "journal": "", "year": "1979", "authors": " Jones"}, {"ref_id": "b23", "title": "Elementary information theory", "journal": "Clarendon Press", "year": "1979", "authors": "D S Jones"}, {"ref_id": "b24", "title": "", "journal": "", "year": "1948", "authors": " Kendall"}, {"ref_id": "b25", "title": "Rank correlation methods", "journal": "", "year": "1948", "authors": "M G Kendall"}, {"ref_id": "b26", "title": "", "journal": "", "year": "2020", "authors": " Kumara"}, {"ref_id": "b27", "title": "Guidelines for real-world multi-objective constrained optimisation competition", "journal": "", "year": "2020", "authors": "A Kumara; G Wub; M Alic; Q Luob; R Mallipeddid; P N Suganthane; Swagatam Das; S "}, {"ref_id": "b28", "title": "", "journal": "", "year": "2015", "authors": " Li"}, {"ref_id": "b29", "title": "Many-objective evolutionary algorithms: A survey", "journal": "ACM Computing Surveys (CSUR)", "year": "2015", "authors": "B Li; J Li; K Tang; X Yao"}, {"ref_id": "b30", "title": "", "journal": "", "year": "1990", "authors": " Martello"}, {"ref_id": "b31", "title": "Knapsack problems: algorithms and computer implementations", "journal": "", "year": "1990", "authors": "S Martello"}, {"ref_id": "b32", "title": "", "journal": "", "year": "1998", "authors": " Mitchell"}, {"ref_id": "b33", "title": "An introduction to genetic algorithms", "journal": "MIT press", "year": "1998", "authors": "M Mitchell"}, {"ref_id": "b34", "title": "", "journal": "", "year": "2011", "authors": " Noman"}, {"ref_id": "b35", "title": "An adaptive differential evolution algorithm", "journal": "IEEE", "year": "2011", "authors": "N Noman; D Bollegala; H Iba"}, {"ref_id": "b36", "title": "", "journal": "", "year": "2018", "authors": " Palakonda"}, {"ref_id": "b37", "title": "Pareto dominance-based moea with multiple ranking methods for many-objective optimization", "journal": "IEEE", "year": "2018", "authors": "V Palakonda; S Ghorbanpour; R Mallipeddi"}, {"ref_id": "b38", "title": "", "journal": "", "year": "1997", "authors": "Varian Resnick"}, {"ref_id": "b39", "title": "Recommender systems", "journal": "Communications of the ACM", "year": "1997", "authors": "P Resnick; H R Varian"}, {"ref_id": "b40", "title": "", "journal": "", "year": "2020", "authors": " Shang"}, {"ref_id": "b41", "title": "A survey on the hypervolume indicator in evolutionary multiobjective optimization", "journal": "IEEE Transactions on Evolutionary Computation", "year": "2020", "authors": "K Shang; H Ishibuchi; L He; L M Pang"}, {"ref_id": "b42", "title": "", "journal": "", "year": "1959", "authors": " Sklar"}, {"ref_id": "b43", "title": "Fonctions de repartition an dimensions et leurs marges", "journal": "Publ. inst. statist. univ", "year": "1959", "authors": "M Sklar"}, {"ref_id": "b44", "title": "", "journal": "", "year": "1999", "authors": "Thiele Zitzler"}, {"ref_id": "b45", "title": "Multiobjective evolutionary algorithms: a comparative case study and the strength pareto approach", "journal": "IEEE transactions on Evolutionary Computation", "year": "1999", "authors": "E Zitzler; L Thiele"}], "figures": [{"figure_label": "", "figure_type": "figure", "figure_id": "fig_0", "figure_caption": "Points A, B, and C are not dominated by any other point. This means that po(A) = µ({y|yR * A}) = 0 and po(B) = po(C) = po(A) = 0. Point E is dominated by a single point C, that is po(E) = µ({C}) = 1. Finally, points F and D are dominated by two other points each, resulting in po(F ) = µ({C, E}) = 2 and po(D) = µ({A, B}) = 2.8 If R * is transitive, then for any k, T k is a selection.", "figure_data": ""}, {"figure_label": "2", "figure_type": "figure", "figure_id": "fig_1", "figure_caption": "Figure 2 :2Figure 1: Illustration of the relation R .", "figure_data": ""}, {"figure_label": "3", "figure_type": "figure", "figure_id": "fig_2", "figure_caption": "Figure 3 :3Figure 3: S is a selection that offers maximum choice but cannot be constructed from T k . Point are encoded with their measure and k-Pareto optimality: (µ, po).", "figure_data": ""}, {"figure_label": "4", "figure_type": "figure", "figure_id": "fig_3", "figure_caption": "Figure 4 :4Figure 4: Characterization of hyperbola.", "figure_data": ""}, {"figure_label": "5", "figure_type": "figure", "figure_id": "fig_4", "figure_caption": "Figure 5 :5Figure 5: Selections of the best 40% according to different sorting criteria.", "figure_data": ""}, {"figure_label": "7", "figure_type": "figure", "figure_id": "fig_5", "figure_caption": "Figure 7 :7Figure 7: Increase in hypervolume compared to NSGA-II.", "figure_data": ""}, {"figure_label": "9", "figure_type": "figure", "figure_id": "fig_6", "figure_caption": "Figure 9 :9Figure 9: An illustration of a cone-based relation R a .", "figure_data": ""}, {"figure_label": "10", "figure_type": "figure", "figure_id": "fig_7", "figure_caption": "Figure 10 :10Figure 10: An illustration of simple partial order relation. The values of po are shown by numbers, and the set of at least 2-Pareto optimal elements T 2 is delimited by a curve.", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "fig_8", "figure_caption": "(a) Sorting by Pareto fronts. (b) Sorting by po.", "figure_data": ""}, {"figure_label": "11", "figure_type": "figure", "figure_id": "fig_9", "figure_caption": "Figure 11 :11Figure 11: Sorting points of a grid. The equivalence classes (fronts) are represented by numbers.", "figure_data": ""}, {"figure_label": "12", "figure_type": "figure", "figure_id": "fig_10", "figure_caption": "Figure 12 :12Figure 12: Selections of µ = 0.2 for the set X composed of points in the shaded area.", "figure_data": ""}, {"figure_label": "14", "figure_type": "figure", "figure_id": "fig_11", "figure_caption": "Figure 14 :14Figure 14: Average percentage of solutions dominated by other algorithms, θ.", "figure_data": ""}, {"figure_label": "15", "figure_type": "figure", "figure_id": "fig_12", "figure_caption": "Figure 15 :15Figure 15: Sorting duration as a function of population size for 10 knapsacks, n k = 10.", "figure_data": ""}, {"figure_label": "16", "figure_type": "figure", "figure_id": "fig_13", "figure_caption": "Figure 16 :16Figure 16: Separation between wealthy and non-wealthy states based on div # .", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "fig_14", "figure_caption": "xR f y iff xR f1 y and . . . and xR f M y. Thus, the above CMOP can be represented by the lexicographic preorder relation xR cf y iff xR * c y or (xR = c y and xR f y), where xR * c y means \"xR c y and not yR c x\", and xR = c y means \"xR c y and yR c x\". For the given R cf , constrained Pareto optimal solutions [Kumara et al., 2020] are solutions that are not Pareto dominated by any other solution.", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "fig_15", "figure_caption": "Ppo(x) = P ({y|yR * cf x}), = P ({y|yR cf x} -P ({y|yR = cf x}), = P ({y|yR cf x} -0, = P ({y|yR * c x} ∪ {y|yR = c x and yR f x}), = P ({y|yR * c x}) + P ({y|yR = c x and yR f x}).Thus, if x satisfies all constraints, which means xR = c (0, . . . , 0, a ng+1 , . . . , a ng+nh ), then po(x) = P ({y|yR = c x and yR f x}), = P ({y|yR = c (0, . . . , 0, a ng+1 , . . . , a ng+nh )})P ({y|yR f x}).Now, let F i (z) = P ({y|f i (y) ≤ z}) be the cumulative probability distribution of f i . Then,P ({y|yR f x}) (y|f i (y) ≤ f i (x)). = i∈{1,...,M } F i (f i (x)).Otherwise, if at least one constraint is not satisfied by x, then P ({y|yR = c x}) = 0 and po(x) = P ({y|yR * c x}) = P ({y|yR c x}) = i∈{1,...,ng} G i (g(x)) j∈{ng+1,...,ng+nh} P (y|yR hj x).", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "fig_16", "figure_caption": "k |z≤hj (x k )≤bj } ps if z < a j , #({x k |aj ≤hj (x k )≤bj ]} ps if a j ≤ z ≤ b j , #({x k |aj ≤hj (x k )≤z} ps if z > b j .", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "fig_17", "figure_caption": ") are treated separately. Moreover, we have the estimation P ({y|yR = c (0, . . . , 0, a ng+1 , . . . , a ng+nh )", "figure_data": ""}], "formulas": [{"formula_id": "formula_0", "formula_text": "cho(A) = (µ × µ)({(x, y) ∈ A 2 |xRy = yRx}).", "formula_coordinates": [2.0, 315.0, 608.76, 196.31, 10.31]}, {"formula_id": "formula_1", "formula_text": "po(x) = µ({y|yR * x}).", "formula_coordinates": [3.0, 63.0, 309.07, 233.99, 20.69]}, {"formula_id": "formula_2", "formula_text": "T k = {x ∈ X| po(x) ≤ k} 8 .", "formula_coordinates": [3.0, 63.0, 456.21, 115.85, 11.22]}, {"formula_id": "formula_3", "formula_text": "(x 1 , x 2 )R (y 1 , y 2 ) iff x 1 ≤ y 1 and x 2 ≤ y 2 , see Fig. 1.", "formula_coordinates": [3.0, 63.0, 552.04, 233.99, 9.65]}, {"formula_id": "formula_4", "formula_text": "k that µ(T k ) = m.", "formula_coordinates": [4.0, 85.47, 251.83, 79.68, 9.65]}, {"formula_id": "formula_5", "formula_text": "cho(S) = S (µ(S) -2 po(x))dµ(x).(1)", "formula_coordinates": [4.0, 103.84, 358.23, 193.16, 17.23]}, {"formula_id": "formula_6", "formula_text": "cho(S) = µ(S) 2 -2(µ × µ)({(x, y) ∈ S 2 |xR * y}) = µ(S) 2 -2(µ × µ)({(x, y) ∈ S × X|yR * x}).", "formula_coordinates": [4.0, 67.02, 454.02, 225.96, 26.99]}, {"formula_id": "formula_7", "formula_text": "(µ×µ)({(x, y) ∈ S × X|yR * x} = = S X 1 R * d(µ(y)) dµ(x) = S po(x)dµ(x),", "formula_coordinates": [4.0, 67.45, 510.64, 225.1, 41.32]}, {"formula_id": "formula_8", "formula_text": "c(A) = A (µ(A) -2 po(x))dµ(x).", "formula_coordinates": [4.0, 107.87, 664.96, 144.26, 17.23]}, {"formula_id": "formula_9", "formula_text": "c(T k ) = max A∈Σ,µ(A)≤µ(T k ) c(A). Moreover, if µ(A) ≤ µ(T k ) and c(A) = c(T k ), then A ⊆ T k almost-everywhere.", "formula_coordinates": [4.0, 315.0, 143.48, 234.0, 45.81]}, {"formula_id": "formula_10", "formula_text": "A ∈ Σ, that c(A) ≤ c(T k ) if µ(A) ≤ µ(T k ). As A = (A ∩ T k ) ∪ (A \\ T k ) and T k = (A ∩ T k ) ∪ (T k \\ A), requiring c(A) ≤ c(T k ) is equivalent to requiring A\\T k (µ(A)-2 po(x))dµ(x) ≤ T k \\A (µ(T k )-2 po(x))dµ(x).", "formula_coordinates": [4.0, 314.45, 463.64, 244.24, 82.76]}, {"formula_id": "formula_11", "formula_text": "(x) > k for x ∈ A \\ T k , while po(x) ≤ k for x ∈ T k \\ A. Therefore, A\\T k (µ(A) -2 po(x))dµ(x) ≤ µ(A \\ T k )(µ(A) -2k),", "formula_coordinates": [4.0, 315.0, 560.73, 234.0, 59.4]}, {"formula_id": "formula_12", "formula_text": "T k \\A (µ(T k ) -2 po(x))dµ(x) ≥ µ(T k \\ A)(µ(T k ) -2k). (4) The constraint µ(A) ≤ µ(T k ) means that µ(A \\ T k ) ≤ µ(T k \\ A). Thus, we have µ(A \\ T k )(µ(A) -2k) ≤ µ(T k \\ A)(µ(T k ) -2k). (5)", "formula_coordinates": [4.0, 314.12, 655.45, 234.88, 85.4]}, {"formula_id": "formula_13", "formula_text": "A ⊂ T k & µ(A) < µ(T k ) =⇒ cho(A) < cho(T k ), (6)", "formula_coordinates": [5.0, 68.11, 457.75, 228.89, 9.65]}, {"formula_id": "formula_14", "formula_text": "x 1 , x 2 )R (y 1 , y 2 ) iff y1 2 ≤ x 1 ≤ y 1 and y2 2 ≤ x 2 ≤ y 2 . The sets T k fulfill the requirement of be- ing selections if R * satisfies the weakened transitivity condition xR * y =⇒ po(x) ≤ po(y).", "formula_coordinates": [5.0, 63.0, 567.4, 234.0, 47.01]}, {"formula_id": "formula_15", "formula_text": "T * k ∪ A • (1, 1) • (1, 1) • (1, 0) • (4, 0) S", "formula_coordinates": [5.0, 266.22, 81.78, 261.47, 660.39]}, {"formula_id": "formula_16", "formula_text": "Proposition 1. For any selection of at least k-Pareto optimal elements T k such that µ(T k ) < +∞ cho(T k ) = µ(T k ) 2 -2 [0,k] xd(po * µ)(x),(7)", "formula_coordinates": [5.0, 315.0, 320.19, 234.0, 55.95]}, {"formula_id": "formula_17", "formula_text": "(po * µ)([a, b]) = µ(po -1 ([a, b])).", "formula_coordinates": [5.0, 315.0, 397.71, 137.27, 10.31]}, {"formula_id": "formula_18", "formula_text": "ω x R Ω ω y iff X 1 (ω x ) ≤ X 1 (ω y ) and X 2 (ω x ) ≤ X 2 (ω y ).", "formula_coordinates": [5.0, 315.21, 491.81, 233.59, 9.65]}, {"formula_id": "formula_19", "formula_text": "x y x 1 x 2 = 1 5 (0, 0) (1, 1) (a)", "formula_coordinates": [6.0, 69.88, 75.99, 102.08, 124.24]}, {"formula_id": "formula_20", "formula_text": "T max 2 5 (0, 0) (1, 1) (b) y is preferable to x.", "formula_coordinates": [6.0, 184.98, 75.99, 102.08, 124.24]}, {"formula_id": "formula_21", "formula_text": "G : Ω → [0, 1] 2 , ω x → (F 1 (x 1 ), F 2 (x 2 )).", "formula_coordinates": [6.0, 359.93, 94.47, 144.15, 23.18]}, {"formula_id": "formula_22", "formula_text": "(G * P )([0, a 1 ] × [0, a 2 ]) = C(a 1 , a 2 ).", "formula_coordinates": [6.0, 315.0, 326.35, 166.37, 9.65]}, {"formula_id": "formula_23", "formula_text": "F (x 1 , x 2 ) = C(F 1 (x 1 ), F 2 (x 2 )).", "formula_coordinates": [6.0, 315.0, 398.08, 133.93, 9.65]}, {"formula_id": "formula_24", "formula_text": "R Ω P (T k ) = k -k ln(k), cho(T k ) = (k -k ln(k)) 2 -k 2 1 2 -ln k .", "formula_coordinates": [6.0, 340.53, 428.93, 203.89, 59.13]}, {"formula_id": "formula_25", "formula_text": "G(T k ) = {(x 1 , x 2 ) ∈ [0, 1] 2 |x 1 x 2 ≤ k}.", "formula_coordinates": [6.0, 315.0, 526.69, 234.0, 21.61]}, {"formula_id": "formula_26", "formula_text": "P (po -1 (] -∞, x])) = P (T x ), = (x1,x2)∈[0,1] 2 (G(T x )) = x -x ln(x).", "formula_coordinates": [6.0, 332.44, 570.07, 199.13, 40.44]}, {"formula_id": "formula_27", "formula_text": "cho(T k ) = (k -k ln(k)) 2 -2 k 0 x(-ln(x))dx, = (k -k ln(k)) 2 -k 2 (1/2 -ln k) .", "formula_coordinates": [6.0, 333.1, 642.1, 197.8, 39.46]}, {"formula_id": "formula_28", "formula_text": "x 1 x 2 min(x 1 , x 2 ) max(x 1 , x 2 ) (x 1 + x 2 )/2 x 1 x 2 (po)", "formula_coordinates": [7.0, 69.04, 93.37, 210.91, 96.05]}, {"formula_id": "formula_29", "formula_text": "min(x 1 , x 2 ) max(x 1 , x 2 ) (x 1 + x 2 )/2 x 1 x 2 (po)", "formula_coordinates": [7.0, 237.83, 245.24, 52.21, 48.5]}, {"formula_id": "formula_30", "formula_text": "T min a = {(x 1 , x 2 ) ∈ [0, 1] 2 | min(x 1 , x 2 ) ≤ a}, T max a = {(x 1 , x 2 ) ∈ [0, 1] 2 | max(x 1 , x 2 ) ≤ a}.", "formula_coordinates": [7.0, 82.09, 456.01, 195.81, 27.9]}, {"formula_id": "formula_31", "formula_text": "x 1 = x 2 .", "formula_coordinates": [7.0, 259.9, 619.94, 36.38, 9.65]}, {"formula_id": "formula_32", "formula_text": "P (X i ≤ x i ) - i∈{1,...,m} P (X i = x i ).", "formula_coordinates": [7.0, 381.78, 518.23, 154.61, 20.53]}, {"formula_id": "formula_33", "formula_text": "x 2 = f (x 1 ) such that -1 a ≤ df dx1 ≤ 0.", "formula_coordinates": [11.0, 63.0, 154.25, 158.41, 14.0]}, {"formula_id": "formula_34", "formula_text": "T * k ⊆ T ⊆ T k .", "formula_coordinates": [13.0, 143.69, 554.54, 61.84, 12.55]}, {"formula_id": "formula_35", "formula_text": "T * k ∪ A with A ⊆ T k \\ T * k .", "formula_coordinates": [13.0, 428.99, 717.67, 120.01, 12.55]}, {"formula_id": "formula_36", "formula_text": "div(T k ) = max S∈S,µ(S)=µ(T k ) div(S).", "formula_coordinates": [14.0, 236.49, 162.95, 139.01, 15.72]}, {"formula_id": "formula_37", "formula_text": "τ = # con -# dis n 0 ,", "formula_coordinates": [15.0, 265.78, 511.86, 80.44, 23.22]}, {"formula_id": "formula_38", "formula_text": "τ = n 2 + n -2 cho # n 2 -n .", "formula_coordinates": [15.0, 259.47, 608.5, 93.06, 23.89]}, {"formula_id": "formula_39", "formula_text": "τ ≈ 1 -2 div # .", "formula_coordinates": [15.0, 272.13, 661.58, 67.74, 9.65]}, {"formula_id": "formula_40", "formula_text": "Minimize f 1 (x), f 2 (x), . . . , f M (x) subject to g i (x) ≤ 0, i ∈ {1, 2, ..., ng}, h j = 0, j ∈ {ng + 1, ng + 2, ..., ng + nh}, L k ≤ x k ≤ U k , h ∈ {1, . . . , D},", "formula_coordinates": [17.0, 63.0, 146.49, 330.64, 87.08]}, {"formula_id": "formula_41", "formula_text": "• f i represents the i-th objective function,", "formula_coordinates": [17.0, 72.96, 266.27, 185.86, 10.32]}, {"formula_id": "formula_42", "formula_text": "xR gi y iff g i (x) ≤ 0 or g i (x) ≤ g i (y). (8", "formula_coordinates": [17.0, 250.62, 424.22, 294.14, 24.59]}, {"formula_id": "formula_43", "formula_text": ")", "formula_coordinates": [17.0, 544.76, 431.8, 4.24, 8.74]}, {"formula_id": "formula_44", "formula_text": "xR hj y iff      h j (x) ∈ [a j , b j ] or h j (y) ≤ h j (x) ≤ a j or b j ≤ h j (x) ≤ h j (y).(9)", "formula_coordinates": [17.0, 229.91, 484.15, 319.09, 41.5]}, {"formula_id": "formula_45", "formula_text": "xR fi y iff f i (x) ≤ f i (y).", "formula_coordinates": [17.0, 255.93, 617.01, 100.13, 9.65]}, {"formula_id": "formula_46", "formula_text": "F (z) = #({x k |f (x k ) ≤ z}) ps .", "formula_coordinates": [18.0, 247.7, 604.29, 118.84, 22.31]}, {"formula_id": "formula_47", "formula_text": "H j * (z) =", "formula_coordinates": [18.0, 201.22, 676.57, 40.4, 15.14]}], "doi": ""}
