{"title": "uvby-β photometry of solar twins ⋆ The solar colors, model atmospheres, and the T eff and metallicity scales", "authors": "J Meléndez; W J Schuster; J S Silva; I Ramírez; L Casagrande; P Coelho", "pub_date": "2018-11-16", "abstract": "Aims. Solar colors have been determined on the uvby-β photometric system to test absolute solar fluxes, to examine colors predicted by model atmospheres as a function of stellar parameters (T eff , log g, [Fe/H]), and to probe zero-points of T eff and metallicity scales. Methods. New uvby-β photometry is presented for 73 solar-twin candidates. Most stars of our sample have also been observed spectroscopically to obtain accurate stellar parameters. Using the stars that most closely resemble the Sun, and complementing our data with photometry available in the literature, the solar colors on the uvby-β system have been inferred. Our solar colors are compared with synthetic solar colors computed from absolute solar spectra and from the latest Kurucz (ATLAS9) and MARCS model atmospheres. The zero-points of different T eff and metallicity scales are verified and corrections are proposed. Results. Our solar colors are (by) ⊙ = 0.4105±0.0015, m 1,⊙ = 0.2122±0.0018, c 1,⊙ = 0.3319±0.0054, and β ⊙ = 2.5915±0.0024. The (b-y) ⊙ and m 1,⊙ colors obtained from absolute spectrophotometry of the Sun agree within 3-σ with the solar colors derived here when the photometric zero-points are determined from either the STIS HST observations of Vega or an ATLAS9 Vega model, but the c 1,⊙ and β ⊙ synthetic colors inferred from absolute solar spectra agree with our solar colors only when the zero-points based on the ATLAS9 model are adopted. The Kurucz solar model provides a better fit to our observations than the MARCS model. For photometric values computed from the Kurucz models, (by) ⊙ and m 1,⊙ are in excellent agreement with our solar colors independently of the adopted zero-points, but for c 1,⊙ and β ⊙ agreement is found only when adopting the ATLAS9 zero-points. The c 1,⊙ color computed from both the Kurucz and MARCS models is the most discrepant, probably revealing problems either with the models or observations in the u band. The T eff calibration of Alonso and collaborators has the poorest performance (∼140 K off), while the relation of Casagrande and collaborators is the most accurate (within 10 K). We confirm that the Ramírez & Meléndez uvby metallicity calibration, recommended by Árnadóttir and collaborators to obtain [Fe/H] in F, G, and K dwarfs, needs a small (∼10%) zero-point correction to place the stars and the Sun on the same metallicity scale. Finally, we confirm that the c 1 index in solar analogs has a strong metallicity sensitivity.", "sections": [{"heading": "Introduction", "text": "Photometry in the uvby-β system (Strömgren, 1963;Crawford, 1966) is well suited to the determination of basic stellar atmospheric parameters for F-, G-, and K-type stars through the color indices (b-y), m 1 = (v-b) -(b-y) and c 1 = (uv) -(v-b). Several empirical calibrations exist in the literature to transform (b-y) or β to T eff (e.g. Alonso et al., 1996Alonso et al., , 1999;;Clem et al., 2004;Ramírez & Meléndez, 2005b, hereafter RM05b;Holmberg et al., 2007;Casagrande et al., 2010), while the m 1 index can be used to determine [Fe/H] in dwarfs (e.g. Strömgren, 1964;Gustafsson & Nissen, 1972;Olsen, 1984;Schuster & Nissen, 1989;Malyuto, 1994;Haywood, 2002;Martell & Laughlin, 2002;Martell & Smith, 2004;Ramírez & Meléndez, 2005a, hereafter RM05a;Twarog et al., 2007;Holmberg et al., 2007) and giants (e.g. Bond, 1980;Arellano Ferro & Mantegazza, 1996;Hilker, 2000; ⋆ Based on observations collected at the H.L. Johnson 1.5 m telescope at the Observatorio Astronómico Nacional at San Pedro Mártir, Baja California, México. Ramírez & Meléndez, 2004;Calamida et al., 2007Calamida et al., , 2009)), as reviewed by Árnadóttir et al. (2010). The evolutionary stage of stars can be determined using the c 1 index together with other uvby color indices (e.g. Crawford, 1975;Olsen, 1984;Nissen & Schuster, 1991;Schuster et al., 2004;Twarog et al., 2007).\nSince there are many difficulties in observing the Sun with the same instrumentation as we observe other stars (e.g. Stebbins & Kron, 1957;Gallouëtte, 1964;Clements & Neff, 1979;Tueg, 1982;Lockwood et al., 1992), the Sun cannot be used to set the zero-points of transformations between color indices and fundamental stellar parameters. Accurate transformations are important in many areas of astrophysics. For example, in the study of the primordial lithium abundance, an accurate T eff scale is needed to compare the Li abundance of metalpoor stars with that obtained from Big Bang Nucleosynthesis (e.g. Meléndez et al., 2010a;Sbordone et al., 2010). The terrestrial planet signatures found in the chemical composition of the Sun (Meléndez et al., 2009, hereafter M09;Ramírez et al., 2009, hereafter R09;Ramírez et al., 2010) shows that for accu-rate comparisons between the Sun and stars an accurate temperature scale must be used in the determination of chemical abundances. Although there is inconclusive evidence about whether the Sun is too metal-rich with respect to stars of similar age and Galactic orbit (Haywood, 2008;Holmberg et al., 2009) implying that the Sun could have been born in the inner part of the Galaxy (Wielen et al., 1996), this apparent offset between the Sun and stars could be partly due to zero-point errors in the photometric metallicity scale (see e.g. Table 3 of Árnadóttir et al. 2010 for systematic differences between spectroscopic and photometric metallicities). Furthermore, we note that zero-point errors in the T eff scale, as well as errors in the metallicity scale, would introduce systematic errors in the ages of stars determined from isochrones.\nAccording to their similarity to the Sun, stars can be classified as \"solar-type stars\" (late F to early K stars), \"solar analogs\" (G0-G5 dwarfs with solar metallicity within ∼ a factor of 2-3), and \"solar twins\" (stars almost identical to the Sun) (e.g. Secchi, 1868;Cayrel de Strobel, 1996;Soderblom & King, 1998;M09). Many works have used either solar-type stars or solar analogs to infer solar colors to improve or check the effective temperature scale, the performance of model atmospheres, and the absolute flux calibration of the Sun (e.g. Pettit & Nicholson, 1928;Kuiper, 1938;Stebbins & Whitford, 1945;Stebbins & Kron, 1957;Johnson, 1962;Kron, 1963;van den Bergh, 1965;Croft et al., 1972;Olsen, 1976;Schuster, 1976;Barry et al., 1978;Hardorp, 1978Hardorp, , 1980a,b;,b;Clements & Neff, 1979;Cayrel de Strobel et al., 1981;Neckel & Labs, 1981;Chmielewski, 1981;Tueg & Schmidt-Kaler, 1982;Magain, 1983;Taylor, 1984;Mitchell & Schuster, 1985;Neckel, 1986;Vandenberg & Poll, 1989;Gray, 1992Gray, , 1995;;Straizys & Valiauga, 1994;Taylor, 1994;Cayrel de Strobel, 1996;Colina et al., 1996, hereafter C96;Hauck & Kunzli, 1996;Bessell et al., 1998;Mironov et al., 1998;Sekiguchi & Fukugita, 2000;Meléndez & Ramírez, 2003;RM05b;Holmberg et al., 2006;Pasquini et al., 2008;Rieke et al., 2008;Casagrande et al., 2010).\nSolar twins have spectra almost identical to the Sun (Cayrel de Strobel, 1996), hence are better suited to setting the zero-points of fundamental calibrations, especially since they are found without assuming a priori a temperature scale, but their identification is based purely on a model-independent analysis of their spectra with respect to a solar spectrum obtained with the same instrumentation. However, until only a few years ago one solar twin was known (18 Sco; Porto de Mello & da Silva, 1997; Soubiran & Triaud, 2004). The situation has changed dramatically with the identification of many stars similar to the Sun (Meléndez et al., 2006, hereafter M06;Meléndez & Ramírez, 2007, hereafter MR07;Takeda et al., 2007, hereafter T07;Takeda & Tajitsu, 2009, hereafter T09;M09;R09;Baumann et al. 2010, hereafter B10). It is now feasible to use solar twins with accurately determined stellar parameters to test the predictions of model atmospheres and the accuracy of empirical photometric calibrations. In the present work, we perform this study for the widely used uvby-β system.", "publication_ref": ["b144", "b34", "b1", "b2", "b28", "b66", "b17", "b145", "b53", "b109", "b127", "b86", "b62", "b87", "b88", "b155", "b66", "b13", "b4", "b64", "b115", "b14", "b15", "b37", "b109", "b105", "b132", "b155", "b142", "b44", "b29", "b152", "b83", "b124", "b119", "b63", "b67", "b161", "b134", "b24", "b138", "b113", "b75", "b141", "b142", "b69", "b74", "b157", "b39", "b107", "b125", "b5", "b59", "b29", "b23", "b102", "b27", "b153", "b85", "b149", "b98", "b99", "b159", "b47", "b48", "b143", "b150", "b24", "b57", "b7", "b97", "b135", "b65", "b112", "b121", "b17", "b24", "b139"], "figure_ref": [], "table_ref": ["tab_4"]}, {"heading": "Photometric observations", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Selection of the sample", "text": "Before starting our systematic survey of stars similar to the Sun in the Hipparcos catalogue, we performed pilot observations of solar-twin candidates to test our selection criteria. Our pilot study (M06) found zero-point offsets in our T eff scale (RM05b).\nWe therefore applied small corrections to the solar colors predicted by RM05b to increase our chances of finding stars resembling the Sun. In particular, we searched for solar twins around the Tycho color (B -V) T = 0.7225 instead of (B -V) T =0.689 predicted by our earlier color-T eff relations (RM05b). Our improved T eff scale (Casagrande et al. 2010) indeed corrected the zero-point problem, and now predicts a solar (B -V) T =0.730, in good agreement with our tentative correction.\nThe main parameters used to select solar-twin candidates from the Hipparcos catalogue were parallaxes and (B -V) T colors. Additional criteria used (when available) were other opticalinfrared colors (e.g. V T -K, b -y), photometric variability, information on multiplicity, previous literature values for [Fe/H] (obtained from an updated version of the Cayrel de Strobel et al., 2001, catalogue), rotation, and chromospheric activity. We found initially about one hundred stars satisfying our selection criteria within 75 pcs. We later expanded our search to cover the whole Hipparcos catalogue, increasing our sample by about 1/3.", "publication_ref": ["b17"], "figure_ref": [], "table_ref": []}, {"heading": "Observations and data reduction", "text": "The uvby-β data presented here in Table 1 for the solar twins were taken using the H. L. Johnson 1.5 m telescope at the San Pedro Mártir Observatory, Baja California, México (hereafter SPM), and the same six-channel uvby-β photoelectric photometer as for the northern observations of Schuster & Nissen (1988, hereafter SN), for all the uvby-β observations of Schuster et al. (1993, hereafter SPC), the northern data of very-metal-poor stars by Schuster et al. (1996), the uvby-β data for very-metal-poor stars in Table 1 of Schuster et al. (2004), and the uvby-β data for high-velocity and metal-poor stars in Table 1 of Schuster et al. (2006). The new uvby-β values for solar twins included here in Table 1 were taken during three observing runs in November 2007 (8 nights), April 2008 (7 nights), and September 2008 (4 nights).\nThe uvby-β solar-twin data were taken and reduced using techniques very nearly the same as for SN and SPC (see these previous papers for more details). The four-channel uvby section of the SPM photometer is really a spectrograph-photometer that employs exit slots and optical interference filters to define the bandpasses. The grating angle of this spectrographphotometer was calibrated using a cadmium lamp at the beginning of each observing run to position the spectra on the exit slots to within about ±1Å. Whenever possible, extinction-star observations were made nightly over an air-mass range of at least 0.8 (see Schuster & Parrao 2001;also Schuster et al. 2002), and spaced throughout each night several \"drift\" stars were observed symmetrically with respect to the local meridian (two hours east and then two hours west). Using these observations, the atmospheric extinction coefficients and time dependences of the night corrections could be obtained for each of the nights of observation (see Grønbech et al. 1976). Finding charts were employed at SPM to confirm identifications of the program stars and to select regions for the \"sky\" measurements. As for previous studies, such as SN and SPC, the program stars were observed at SPM to at least 50 000 counts in all four channels of uvby and to at least 30 000 counts for the two channels centered at Hβ. For all program stars, the sky background was measured until its contributing error was equal to or smaller than the error in the stellar count. At SPM, an attempt was made to obtain three or more independent uvby observations for each of the program stars, i.e. photometric observations during at least three independent nights; this aim was achieved, or exceeded, for all solar twins except HIP75923 and HIP77883 for which we obtained two observations each.\nAs for the SN and SPC catalogues, all data reduction was carried out following the precepts of Grønbech et al. (1976) using computer programs kindly loaned by T. Andersen (see Parrao et al. 1988). At SPM, the uvby-β standard stars observed were taken from the same lists as for the previous catalogues, and are mostly secondary standards from the catalogues of Olsen (1983Olsen ( , 1984)). The reduction programs create a single instrumental photometric system for each observing run, including nightly atmospheric extinctions and night corrections with linear time dependences. Then transformation equations from the instrumental to the standard systems of V, (b-y), m 1 , c 1 , and β are obtained using all standard stars observed during that observing period. The equations for the transformation to the standard uvby-β system are the linear ones of Crawford & Barnes (1970) and Crawford & Mander (1966). Small linear terms in (b-y) are included in the standard transformation equations for m 1 and c 1 to correct for bandwidth effects in the v filter. Our y measurements were transformed onto the V system of Johnson et al. (1966).\nThirty-six uvby-β standard stars were employed during the observing run of November 2007 providing instrumental photometric errors ranging from 0.002 mag. in (b-y) to 0.009 mag. in c 1 , and errors in the transformations to the standard photometric system from 0.004 to 0.011 magnitudes, respectively. For April 2008, these values were for 33 standard stars, 0.002-0.010 mag., and 0.005-0.013 mag., respectively, and for September 2008, for 35 standard stars, 0.002-0.008 mag., and 0.006-0.009 mag., respectively. Instrumental and transformation errors in the magnitude V and in the indices m 1 and β were always intermediate in value between those given above.", "publication_ref": ["b129", "b132", "b133", "b130", "b50", "b50", "b111", "b108", "b109", "b35", "b36", "b70"], "figure_ref": [], "table_ref": ["tab_3", "tab_3", "tab_3", "tab_3"]}, {"heading": "The catalogue", "text": "Table 1 presents the uvby-β catalogue for the 73 solar-twin candidates observed at SPM. Column 1 lists the Hipparcos number; Col. 2 gives the HD (or BD) number, Col. 3 the V magnitude on the standard Johnson U BV system; and Cols. 4-6 and 9, the indices (b-y), m 1 , c 1 and β on the standard systems of Olsen (1983Olsen ( , 1984)), which are essentially the systems of Crawford & Barnes (1970) and Crawford & Mander (1966) with north-south systematic differences corrected. Columns 7, 8, and 10 give N V , N uvby , and N β , the total numbers of independent V, uvby, and β observations.\nA very small subset of our photometric observations was made through light cirrus clouds in the absence of moonlight. It has been well documented (e.g. SN; Olsen, 1983) that observations in the indices b-y, m 1 , c 1 , and β made with simultaneous multichannel photometers are not affected in any significant way by light (or even moderate) cirrus, while the V magnitude, obtained from only the y band, is affected. For this reason, a few of the solar twins, such as HIP60314, HIP74389, and HIP118159, have fewer independent observations of the V magnitude than the indices.", "publication_ref": ["b108", "b109", "b35", "b36", "b108"], "figure_ref": [], "table_ref": ["tab_3"]}, {"heading": "Comparisons with other photometric data", "text": "We searched for uvby-β photometry in the General Catalogue of Photometric Data (Mermilliod et al., 1997;Hauck & Mermilliod, 1998) and found data for 23 solar-twin candidates and 12 solar analogs (observed by ourselves spectro-scopically for other projects). The photometry of these 35 stars is given in Table 2.\nThe accuracy of uvby-β photometry obtained at SPM has been extensively tested (e.g. SN;Arellano Ferro et al., 1990;Schuster et al., 1993Schuster et al., , 1996)), and we illustrate below that our solar-twin photometry is also in excellent agreement with the literature, in all cases with mean differences well below 0.01 magnitudes. There are 12 stars in common between our sample and previous work. The average difference (ours -literature) in (b-y) is only -0.001 (σ = 0.004). Our V Johnson photometry is also in good agreement, with a mean difference (ours -literature) of only +0.001 (σ = 0.006). The colors m 1 and c 1 also compare well, with a difference (ours -literature) of only +0.002 (σ = 0.006) and +0.006 (σ = 0.015).\nConsidering the excellent agreement between the photometry available in the literature and in our own data sets, and considering the previously shown accuracy and precision of the SPM uvby-β photometry, we conclude that both data sets, of Tables 1 and2, provide solar-color indices very close to the standard uvby-β system.", "publication_ref": ["b96", "b58", "b3", "b128", "b129"], "figure_ref": [], "table_ref": ["tab_3"]}, {"heading": "The solar-color indices", "text": "Our observations comprise the largest photometric data set yet taken of stars very similar to the Sun in the uvby-β system. Adding other photometry available in the literature and using our own accurate stellar parameters (M09; R09; Meléndez et al., 2010b, hereafter M10b), and taking into account the variations in colors with T eff , log g and [Fe/H], we can infer the \"solar\" colors by interpolating them to the stellar parameters of the Sun: T eff = 5777 K, log g = 4.44, and [Fe/H] = 0.00 (e.g. Cox, 2000;Gray, 2005;RM05b).\nThe quality of our stellar parameters (M06; MR07; M09; R09; M10b) is very high because both the Sun (reflected light of asteroids) and the solar twins were observed with the same instrumentation during the same observing runs, and all data reduction and analysis were performed in an identical way. Our spectra have typically a resolution of 60,000 and S/N∼200 for stars observed with the 2.7m telescope at McDonald and S/N∼450 for stars observed with 6.5m Magellan Clay telescope at Las Campanas. Errors as low as ∼25 K in T eff , 0.04 dex in log g, and 0.025 dex in [Fe/H] can be obtained in the best cases, and abundance ratios with errors as low as 0.01-0.02 dex have been obtained with the above data, showing that the Sun is a star with a peculiar chemical composition (M09; R09). Additional spectra available in the literature for solar-twin candidates were analyzed by B10 using similar techniques. The spectra are from HARPS observations available at the ESO archive and from the S 4 N database (Allende Prieto et al., 2004) foot_0 . In both cases, a solar spectrum taken with the same instrumentation was employed in the differential analysis.\nThe stellar parameters were determined homogeneously by our own group (M06, MR07, M09, R09, M10b, B10) using Kurucz model atmospheres and a line-by-line differential analysis with respect to the Sun. The T eff , log g, [Fe/H], and microturbulence were determined iteratively until both the differential excitation equilibrium of FeI lines and the differential ionization balance of FeI and FeII, were achieved. The microturbulence was also determined simultaneously, by requiring no dependence of the iron abundance (from FeI lines) on the reduced equivalent width.\nSince our solar-twin sample spans a relatively narrow range in atmospheric parameters relative to the Sun, in principle simple linear fits of color versus (vs.) each parameter (T eff , log g, and [Fe/H]) would provide sufficiently good estimates of the solar colors. As suggested by the referee, a global fit (e.g. Mitchell & Schuster, 1985) to all stellar parameters (color = f (T eff , log g, [Fe/H])) would be preferable due to the mutual interdependence of the stellar parameters. Fortunately our sample includes also solar analogs covering a broader range in colors and stellar parameters than the solar twins, so that the dependence on the different stellar parameters can be well determined by a global fit. The following formula was employed:\ncolor = A + B (T eff -5777) + C (logg -4.44) + D [Fe/H]. (1)\nThe advantage of this equation is that A will give us directly the solar color, while its uncertainty could be determined from the error in A or from the scatter of the fit.\nFrom our sample of stars, we selected a group of solar twins with T eff , log g, and [Fe/H] within 100 K, 0.1 dex, and 0.1 dex of the solar parametersfoot_1 given above. To perform a more robust global fit, we extended our solar twin sample with solar analogs covering a range in T eff , log g, and [Fe/H]. Thus, to explore the metallicity dependence of the colors, we selected a sample of solar analogs with the same constraints in T eff and log g, but covering a broader range in metallicity (-0.4\n< [Fe/H] < -0.1 dex, +0.1 < [Fe/H] < +0.4 dex).\nIn a similar way, to improve the fit to T eff , we selected a group of solar analogs with the same constraints on log g and [Fe/H] as the solar twins, but with T eff in the range (5617 < T eff < 5677 K, 5877 < T eff < 5937 K). Finally, to fit the trend with log g, we used a sample of solar analogs with the same constraints on T eff and [Fe/H] as the solar twins, but covering a broader range in log g (4.29 ≤ log g < 4.34 dex, 4.54 ≤ log g < 4.59 dex).\nThe stellar parameters were taken from our work on solar twins (M06; MR07; M09; R09; M10b; B10) and complemented in some cases with other accurate values available in the literature (Valenti & Fischer, 2005, hereafter VF05;Luck & Heiter, 2006, hereafter LH06;T07;Sousa et al., 2008, hereafter S08;T09). The adopted stellar parameters for the solar twins and solar analogs are given in Table 3.\nThe global fits to (b-y) had only three outliers, HIP 7245, HIP 81512, and HIP 88427, which seem too red in (b-y) for their T eff and [Fe/H]. Using the Karatas ¸& Schuster (2010) intrinsiccolor calibration, we find that these three stars may be slightly reddened (E(b-y) ∼ 0.015 -0.023), although we have to bear in mind that the accuracy of the reddening calibration is of the same order.foot_2 These stars were removed from the global fits. The results from the fits are presented in Table 4 and in Figs. 1234, where filled circles represent the solar twins and open circles the solar analogs across a broader range of stellar parameters.", "publication_ref": ["b33", "b49", "b0", "b98"], "figure_ref": ["fig_0", "fig_1", "fig_2"], "table_ref": ["tab_4", "tab_0"]}, {"heading": "The (b-y) solar color", "text": "The global fit of (b-y) (Fig. 1 and Table 4) shows strong dependences on T eff (at the 14-σ level) and [Fe/H] (10-σ). There is no dependence (within the errors) on log g, therefore this parameter was excluded from the global fit. The star-to-star scatter from the fit is only 0.005 magnitudes, which is what is expected from the observational uncertainties (0.004-0.006 magnitudes).\nThe standard error (s.e.) in the solar color was obtained from the observed star-to-star scatter and the number of data-points (s.e. = σ/ sample size). The error in (b-y) ⊙ (and the other solar colors) was conservatively adopted as three times the standard error. Thus, we propose (by) ⊙ = 0.4105 (±0.0015).\n(2)\nA plot of (b-y) vs. V magnitude can help us to reveal whether fainter (i.e., more distant) stars bias the above derived solar color, due to possible interstellar reddening. This plot is shown in the lower left panel of Fig. 1. As can be seen, there is no trend with V magnitude. A linear fit of (b-y) vs. V, indeed shows a zero slope within the errors (slope = 0.0003 ± 0.0008). We note that most stars of the sample used in the global fit are brighter than V = 9, i.e. closer than ∼ 68 pc. Even the faintest stars (V ∼ 9.3) extend only to ∼78 pc. According to NaI interstelar absorption maps, very little NaI absorption is detected for distances up to ∼ 80pc from the Sun (Lallement et al., 2003;Welsh et al., 2010). Thus, most of our sample is not expected to be significantly affected by interstellar absorption. As already mentioned above, the few stars that show some small sign of interstellar reddening were not included in the global fits. ", "publication_ref": ["b81", "b160"], "figure_ref": ["fig_0", "fig_0"], "table_ref": ["tab_0"]}, {"heading": "The β solar color", "text": "The global fit of β shows a dependence on T eff , log g, and [Fe/H] (Table 4). Interestingly, the strongest dependence is with [Fe/H] (slope significant at the 5-σ level), while the dependence with both T eff (2.9 σ) and log g (2.7 σ) is only at the 3-σ level. In Fig. 2, we show the dependence of the β color index with respect to T eff and [Fe/H]. The scatter from the fit is 0.006 mags, which is compatible with the observational errors in β.\nThe adopted β solar color is\nβ ⊙ = 2.5915 (±0.0024). (3\n)\nAlthough there is a clear trend of β vs. V magnitude (Fig. 2), it is not related to reddening because the β index is not affected by interstellar absorption. The bright stars (V < 6) that are causing the trend are within ∼17 pc, hence they are not reddened. The bright (V < 6) solar twins and analogs falling systematically above the derived β ⊙ , are stars hotter than the Sun, or more metal-rich than the Sun (or both), and therefore with a β color systematically higher than solar because β increases with both increasing metallicity and T eff . We note that the trend seen in nearby stars for β is not present in (b-y) because this color has opposite trends with T eff and [Fe/H]. Thus, by performing a deeper solar-twin survey than previous works, we avoided systematic biases (such as selecting mainly hotter and more metalrich stars) that might have been present if only brighter stars were studied.", "publication_ref": [], "figure_ref": ["fig_1", "fig_1"], "table_ref": ["tab_0"]}, {"heading": "The m 1 solar color", "text": "It is well known that the m 1 color correlates very well with metallicity (see references in the introduction), and this is clearly shown in Table 4, where according to the global fit the dependence on [Fe/H] is significant at the 21-σ level. The second most important parameter is T eff (10 σ), but log g also produces an important dependence (slope significant at the 5-σ level).\nThe tight correlation between m 1 and [Fe/H] is shown in Fig. 3. The star-to-star scatter from the global fit is only 0.006 magnitudes, which is compatible with the observational uncertainties. The m 1 solar color recommended for the Sun is m 1,⊙ = 0.2122 (±0.0018).\n(4)", "publication_ref": [], "figure_ref": ["fig_2"], "table_ref": ["tab_0"]}, {"heading": "The c 1 solar color", "text": "In Fig. 4, we show the relation between c 1 and log g, which is significant at the 4-σ level. As already noticed in the literature (e.g. Twarog et al., 2002;Önehag et al., 2009, hereafter O09), the c 1 index in late G dwarfs has a sensitivity to metallicity. Our global fit (Table 4) confirms the dependence on [Fe/H], which is actually more significant (8-σ) than the dependence on log g (Fig. 4).\nThe predicted c 1 solar color from the global fit is c 1,⊙ = 0.3319 (±0.0054).\n(5)\nThe star-to-star scatter in the global fit is 0.0165, which is considerably larger than the observational errors (0.009 -0.013) for the c 1 index. Following the suggestions of the referee, we explored whether this index is particularly sensitive to either anomalies in the chemical composition or the microturbulence velocities.\nPrevious works show the effects of C and N upon the Strömgren 4-color uvby filter-measurements, via the NH and CN bands. For example, it seems that the NH band at 3360A affects the u measurements while CN affects the v measurements. Thus, the c 1 color that depends on both u and v should be affected by abundance anomalies (Bond & Neff, 1969;Bond, 1974;Zacs et al., 1998;Grundahl et al., 2000Grundahl et al., , 2002;;Schuster et al., 2004;Yong et al., 2008). In this context, it would be important to assess whether the small abundance anomalies in the solar chemical composition (M09; R09), in particular the difference between the highly volatile elements (C, N, O) and Fe, may affect the uvby colors. As discussed by Stromgren et al. (1982), variations in the He abundance may also affect the c 1 index. Although the Hyades c 1 anomaly for stars with (by) close to solar was found initially to be ∆c 1 ∼0.03-0.04 (Hyadesfield stars, or Hyades -Coma), it seems that the anomaly may only amount to ∆c 1 =0.024-0.025 after instrumental effects are corrected (Joner & Taylor, 1995). Another important parameter affecting the colors may be microturbulence (Conti & Deutsch, 1966;Nissen, 1981).\nTo test the above effects, synthetic spectra were computed for solar twins with variations in ∆[C,N,O/Fe]=-0.05 dex (M09), ∆v micro = +0.1 km s -1 (most solar twins and close solar analogs have v micro within ±0.1 km s -1 of the solar value), and an increase of 10% in the He abundance (by number). Fluxes were computed with the code SYNTHE (Kurucz & Avrett, 1981;Sbordone et al., 2004;Kurucz, 2005) using ATLAS12 model atmospheres (Kurucz, 1996(Kurucz, , 2005;;Castelli, 2005) computed for the different aforementioned assumptions. The atomic line list adopted in the spectral computations is based on the compilations by Coelho et al. (2005) and Castelli & Hubrig (2004), and the molecules C 2 , CH, CN, CO, H 2 , MgH, NH, OH, SiH, and SiO from Kurucz (1993) were included. The change in He does not significantly affect the c 1 index (<0.001 magnitudes), but the change in microturbulence increases c 1 by +0.0035 mag., while the change in C,N,O increases c 1 by +0.003 mag. 4 Thus, small changes in chemical composition and microturbulence may help to explain the extra scatter seen in the global fit. Casagrande et al. (in preparation) demonstrate that the Strömgren system is not only sensitive to [Fe/H], but that it is possible to obtain information about the [α/Fe] ratio using uvby photometry. The ∆c 1 anomaly in the Hyades could be due to the effect of metallicity on c 1 . According to Friel & Boesgaard (1992), Hyades has an iron abundance 0.18 dex higher than Coma, which according to Table 4 corresponds to ∆c 1 = +0.022 mag., which is very close to the Hyades anomaly relative to Coma (0.024-0.025 mag.) (Joner & Taylor, 1995).", "publication_ref": ["b154", "b11", "b12", "b164", "b51", "b52", "b132", "b163", "b146", "b71", "b32", "b104", "b76", "b123", "b80", "b79", "b80", "b21", "b30", "b20", "b78", "b43", "b71"], "figure_ref": [], "table_ref": ["tab_0", "tab_0"]}, {"heading": "Comparison with previous empirical determinations", "text": "As can be seen in Table 5 (lower part), our inferred (b-y), m 1 , c 1 , and β solar colors agree well (within 1-σ) with most earlier empirical results. However, previous determinations of solar colors have much lower control and homogeneity in T eff , log g, and [Fe/H], thus in some cases the agreement (within the error bars) could be due to fortuitous compensations of T eff , log g, and [Fe/H] effects on colors, or due to large errors in other studies. Several previous works (Saxner & Hammarback, 1985;Gray, 1992;Edvardsson et al., 1993;Casagrande et al., 2010) give (b-y) ⊙ values that agree with ours within 0.005 magnitudes, but other determinations are either too blue (Cayrel de Strobel, 1996;Clem et al., 2004;RM05b;Holmberg et al., 2006) or too red (Gehren, 1981). A previous empirical result for β ⊙ Fig. 4. c 1 vs. log g (upper left panel), [Fe/H] (upper right panel) and V magnitude (lower left panel). The results of the global fit vs. the observed c 1 color is presented in the lower right panel. Symbols are as in Fig. 1. (Saxner & Hammarback, 1985, β ⊙ = 2.591 ± 0.005) is in excellent agreement with our value (2.5915±0.0024). Previous determinations of m 1,⊙ and c 1,⊙ (Clem et al., 2004;Holmberg et al., 2006) also agree with ours within the errors, but note that the errors given by Holmberg et al. (2006) are very large (0.03 and 0.07 for m 1 and c 1 , respectively), so their solar colors cannot be used to perform stringent tests of model atmospheres and the temperature and metallicity scales.\nAlthough our inferred solar colors agree with previous determinations based on solar-type stars, our values based on solar twins should be preferred because of their more accurate and precise stellar parameters, resulting in correspondingly accurate and precise inferred solar colors. We use our \"solar\" colors below to test absolutely calibrated solar spectra, model atmospheres and the T eff and metallicity uvby-β scales.", "publication_ref": ["b122", "b47", "b42", "b17", "b24", "b28", "b65", "b45", "b122", "b28", "b65", "b65"], "figure_ref": ["fig_0"], "table_ref": ["tab_5"]}, {"heading": "Comparison with measurements on reflected", "text": "(asteroid) solar spectra Olsen (1976) measured the β ⊙ color of reflected solar light from asteroids, which seems justifiable because the β index should be largely independent of the wavelength dependence of the albedo. His measurement (β ⊙ = 2.5955 ± 0.0024) is in good agreement (within 1-σ) with our inferred value (β ⊙ = 2.5915 ± 0.0024). Olsen (1976) did not measure the solar (b-y), but indirectly estimated (by) ⊙ from a color transformation using β ⊙ . His (by) ⊙ = 0.390 ± 0.004 disagrees with ours (0.4105±0.0015), but this is probably due to the errors introduced by his adopted transformation from β to (b-y). Using the (by) 0 -β intrinsic color calibration of Karatas ¸& Schuster (2010), the β ⊙ = 2.5955 from Olsen (1976) indeed implies that (b-y) ⊙ = 0.4062, in good agreement with our (b-y) ⊙ . Using the same transformation, our β ⊙ = 2.5915 gives (b-y) ⊙ = 0.4089.\nUnfortunately, direct measurements of the (b-y), m 1 and c 1 color indices for reflected solar spectra are not very useful because of the color of the asteroid albedos 5 . A comparison with solar colors inferred from absolute spectrophotometry of the Sun is presented below.", "publication_ref": ["b107", "b107", "b73", "b107"], "figure_ref": [], "table_ref": []}, {"heading": "Comparison with synthetic colors", "text": "Our accurate and precise colors inferred for the Sun can be used to test the performance of theoretical solar flux models and the quality of absolute solar flux measurements. However, additional ingredients enter the computation of synthetic colors, namely the adopted set of filters and the flux/magnitude zero-points adopted. We discuss them in the following.\nSince intermediate-band Strömgren filters are centered on specific spectral features, a correct characterization of the total throughout becomes crucial for generating synthetic colors (e.g. Lester et al., 1986;O09). To test the influence of the filter transmission curves on our results, we computed uvby indices using two different sets of pass-bands, the original ones of Crawford & Barnes (1970) and a set that should be more representative of the SPM observations (Bessell, 2005).\nThe β index is defined as the ratio of the flux measured through narrow (half-width of about 30 Å) and wide (about 150 Å) profiles both centered on the Hβ line. In this case, the (212,214) filter transmission curves (Crawford & Mander, 1966), the photomultiplier sensitivity, the atmospheric transmission, and the reflectivity of aluminum given in Castelli & Kurucz (2006) were used to generate the total T β throughout, according to the prescriptions of the beta.forcd program at the Kurucz website 6 . Indices calculated using T β define the natural system β ′ , which should be transformed using a set of equations to agree to the standard system β defined by the observations of Crawford & Mander (1966). For the filter set (212,214), the transformation equation is β = 0.248 + 1.368 β ′ (Crawford & Mander, 1966).\nIn principle, to mimic the uvby-β observations presented here, synthetic photometry should reproduce the SPM instrumental system, and the same transformation equations should then be applied to generate the standard system. In practice, this can hardly be done, since the SPM instrument is a sixchannel spectrophotometer, and we follow the approach normally adopted in the literature, i.e. of reproducing the standard system directly, by fixing the zeropoints using Vega. In Sect. 2.4, we have shown the excellent agreement between our observations and other photometric measurements, meaning that the transformation from the instrumental to the standard system is indeed accurate; we therefore expect our approach to return meaningful synthetic colors.\nThe spectral energy distribution adopted for Vega and its observed indices also affect the outcome of synthetic photometry in the process of establishing the zeropoints of a photometric system (e.g. Casagrande et al., 2006). We used a spectrum obtained with the STIS spectrograph onboard the HST (Bohlin, 2007) of resolution R = 500, which enables the highest accuracy (∼ 1%) measurements achievable to date, and adopted the following averaged values for Vega: (b-y) = 0.003, m 1 = 0.157, c 1 = 1.088 and β = 2.904 from Hauck & Mermilliod (1998). 5 Although the colors of the Sun measured using asteroids may be affected, our spectroscopic analysis based on high-resolution spectra should not because we measure the flux relative to the adjacent continuum for narrow spectral lines 6 http://kurucz.harvard.edu/programs/COLORS If we had adopted the colors of Vega given in Crawford et al. (1972), the differences would have amounted to 0.001 magnitude at most. Despite the complications posed by the pole-on and rapidly rotating nature of Vega, the effects on the blue part of the spectrum are expected to be small or negligible (e.g. Casagrande et al., 2006;Bohlin, 2007, and references therein). It is more relevant that we use the observed HST spectrophotometry of Vega; additional comments on this issue are made in the following subsections.", "publication_ref": ["b82", "b35", "b8", "b36", "b22", "b36", "b36", "b16", "b10", "b58", "b38", "b16"], "figure_ref": [], "table_ref": []}, {"heading": "Colors from Kurucz and MARCS models", "text": "Although synthetic uvby-β colors computed using earlier MARCS and Kurucz models are found in the literature (see Table 5), we feel it appropriate to make our comparisons using the most recent releases available (Castelli & Kurucz, 2004;Gustafsson et al., 2008). In addition, as we have already mentioned, different ingredients enter the computation of synthetic colors, and we differ from most of the previous works in that we use an observed spectrum of Vega to define the zeropoints. In principle, this should be the best approach for replicating observations and for a correct comparison of solar flux models and absolute measurements with the colors determined from our solar twins. This choice mimics the observational approach, and the successes or failures of synthetic colors depend mostly on the quality of the solar input spectra. In practice, the situation is less clear, as we discuss further below and in Sect. 6.2.\nWhen computing synthetic colors from theoretical models, the use of a model atmosphere to describe also Vega may have the advantage of (partly) compensating for model inaccuracies by including these in the zero-points.\nWe performed this exercise by taking from the Kurucz website the latest ATLAS9 model fluxes for Vega and the Sun; because of the internal consistency of this approach, it should also determine which set of filters should be used. For the colors of the Sun we obtain (b-y) = 0.413, m 1 = 0.236 and c 1 = 0.297 using the filters of Crawford & Barnes (1970), and (by) = 0.406, m 1 = 0.214, c 1 = 0.303 for the Bessell (2005) filters. While (by) ⊙ is reproduced with the two set of filters, the latter set of filters provides results that are more comparable to our measured m 1,⊙ and c 1,⊙ , and therefore in the following we consider only the Bessell (2005) passbands. The effect of instead using those of Crawford & Barnes (1970) can be easily estimated from the above differences.\nThe resolution of the spectra used to generate synthetic colors may also in principle affect the results. We tested ATLAS9 model fluxes for Vega and the Sun at various resolutions ranging from R = 500000 to 200 and verified that for various combinations of these, differences in (b-y), m 1 and c 1 always lie below 0.001 magnitude. 7However, for R 2000 the synthetic β index scales differently for Vega and the Sun, i.e. even if synthetic spectra of the same resolution are used for the two stars, the value obtained for β depends on R to an extent that may vary from a few millimagnitudes up to several hundredths of a magnitude. For example, using high resolution ATLAS9 spectra for both Vega and the Sun, we obtain β = 2.587, which is in good agreement with our solar value. Using instead synthetic spectra of Vega and the Sun at R = 500 sampled at the same wavelength points, we obtain β = 2.601 from which we estimate a (model-dependent) correction of 0.014 magnitude when working at this low R.\nBecause of this limitation on the STIS resolution of the Balmer line, the β indices computed for Table 5 have been obtained as follows: the solar spectra were downgraded to R = 500, sampled at the same wavelength points as the STIS spectrum, and the aforementioned correction was then applied. Using instead a high resolution ATLAS9 spectrum of Vega to define the zero-points does not require a downgrade to the resolution of the solar spectra, and the β indices are changed by -0.030 magnitude (i.e. are bluer). We verified that for the other Strömgren indices the STIS resolution is high enough. The effect of using an ATLAS9 model flux of Vega to set the zero-points amounts to -0.004, 0.006, and 0.027 magnitudes for the (b-y), m 1 , and c 1 indices, respectively. In Figure 5, synthetic colors obtained with these two choices for Vega, i.e. STIS vs. ATLAS9, are compared.\nIf the STIS spectrum of Vega is used, the Kurucz solar flux returns a value of (b-y) in excellent agreement with our observed value, whereas a considerably bluer color is obtained with MARCS. The greater accuracy of the Kurucz with respect to the MARCS solar flux in b and y bands can be noticed also from the spectrophotometric comparison presented in Edvardsson (2008). For m 1 , the Kurucz model is still in better agreement than the MARCS, one being slightly bluer and the other redder with respect to our m 1,⊙ . The same bluer and redder performance is also obtained for c 1 , although both models provide a rather poor match. The β index is similar for both models and considerably redder than our β ⊙ .\nIn general, the ATLAS9 solar flux model performs better than the MARCS model, but they both have problems in reproducing c 1,⊙ (in opposite directions) and β ⊙ (both systematically redder). Changing to the ATLAS9 flux of Vega to set the zeropoints has a negligible impact on (b-y) and m 1 , but brings the theoretical β index in almost perfect agreement in both cases. For the c 1 index, only the ATLAS9 result is helped by this choice, and this could partly stem from compensating errors in the ATLAS9 models of Vega and the Sun.\nIn Table 5, we also show the color indices computed by O09 using MARCS models (also for the flux of Vega) and the passbands of Crawford & Barnes (1970). Their (b-y) agrees with our synthetic one, but their m 1 and c 1 colors are somewhat redder and bluer, respectively, in a way that is consistent with the different passbands they adopted. The c 1 solar color computed by O09 is in excellent agreement (within 1-σ) with our c 1,⊙ .", "publication_ref": ["b55", "b35", "b8", "b8", "b35", "b41", "b35"], "figure_ref": [], "table_ref": ["tab_5", "tab_5", "tab_5"]}, {"heading": "Colors from solar spectra", "text": "We computed (b-y), m 1 , c 1 , and β indices using the absolute measurements of solar spectra by C96, Neckel (1999, hereafter N99), and Thuillier et al. (2004). The spectrum of Rieke et al. (2008) was not employed because of its very low resolution (R ∼ 100). The STIS Vega observations and the ATLAS9 Vega model were again used to define the zero points.\nThe C96 composite spectrum represents both satellite (Woods et al., 1996) and ground (Neckel & Labs, 1984) observations below and above 4100 Å. While its (b-y) is redder, m 1 is considerably bluer, and c 1 is in good agreement with our solar values. Not unexpectedly, the same conclusions about (by) and m 1 hold for the N99 atlas, which is an update of the Neckel & Labs (1984) measurements included in C96. However, Neckel (2003, hereafter N03) noticed a possible systematic error in those absolute measurements and provides a simple ana-lytical formula for correction, after which (b-y) and m 1 are in closer agreement with our solar values. Thuillier et al. (2004) published two composite solar reference spectra assembled using space measurements during distinct solar activity levels; differences concern only the m 1 and c 1 indices in a negligible manner (a few millimagnitudes only), and therefore in Table 5 the averaged values of the two are given. Thuillier et al. (2004) provide closer agreement than previous spectra in (b-y) and m 1 , but their c 1 is considerably bluer.\nThus, while on average (b-y) and m 1 are in agreement with our solar values, there is the tendency for c 1 to be considerably bluer. The β indices were computed following the same prescriptions as in the previous section and are systematically redder. Switching to the model flux of Vega solves most of the discrepancies for these two indices, with the synthetic values being now distributed at the red and blue sides of our solar colors (see the right panel of Fig. 5). It is not obvious why a model flux for Vega also brings absolute solar flux measurements into closer agreement with our empirical solar colors. While the measured spectra of Vega should be superior to any model of it, we can speculate about possible reasons for this not being true over the full wavelength range. The difference STIS vs. ATLAS9 amounts to few millimagnitudes in (b-y) and m 1 , but is considerable in c 1 and β, and those differences could reflect measurement problems in the u band and the issue already mentioned about the spectral resolution around the Balmer line.\nIn the wavelength range of interest to us, the accuracy of the solar absolute fluxes is on the order of 5 -3% from data acquired in space (C96; Thuillier et al., 2004) and probably lower for ground-based data measurements. The culprit could thus be inaccuracy in solar flux measurements rather than in Vega! For the sake of computing indices, we are not interested in the absolute flux scale, but rather in the relative accuracy of measuring the shape of the solar spectral energy distribution. This accuracy is rather difficult to assess, but the above differences provide an idea of the complexity associated with this kind of measurement, and the corresponding rather large uncertainties. In addition, the choice for Vega and the set of filters used also affect the analysis, introducing systematic errors.\nIn this section, we have presented various issues concerning synthetic solar colors, which are often taken for granted when comparing observed vs. synthetic colors. While the comparison with a specific solar-flux measurement has limited significance, with appropriate choices for Vega, it is comforting that there are no large systematic trends between our solar colors and these observations taken together. Thus, our solar colors can help considerably in establishing the necessary reliability of synthetic colors.", "publication_ref": ["b151", "b121", "b162", "b103", "b103", "b151", "b151", "b151"], "figure_ref": [], "table_ref": ["tab_5"]}, {"heading": "Testing the effects of changes in T eff , log g, and [Fe/H] on synthetic MARCS colors", "text": "As discussed in the previous sections, our uvby-β solar colors are useful for testing absolute solar spectra and the performance of model atmospheres, as well as checking the subtleties in the transformation from fluxes to synthetic colors. Since our solar twins and analogs span a range in T eff , log g, and [Fe/H], we can also use them to test how well model atmospheres predict the relative change of colors due to variations in atmospheric parameters.\nFor this test, we used relative fluxes predicted by the MARCS models, normalizing the results to our \"observed\" solar colors. As shown in Figs. 1234, where the relative variation in the MARCS (b-y), β, m 1 , and c 1 colors are shown by solid Fig. 5. Comparison between solar and synthetic colors obtained from different spectra. Left panel: using Vega STIS observations to set the zero-points. Right panel: using ATLAS9 Vega model for the same purpose. ∆mag = our derived solar colors minus the synthetic ones. lines, there is a satisfactory overall relative agreement between MARCS models and both the solar twins and solar analogs. The only clear discrepancy is in the predicted metallicity variation in β (Fig. 2), which is much shallower than observed. We also checked whether the MARCS β colors computed by O09 solve this problem (Fig. 2), but although they do help to slightly alleviate the discrepancy (the Önehag et al. β colors are slightly steeper than ours), they also do not match the low β indices observed below [Fe/H] ∼ -0.2. It would be important to observe more metal-poor solar analogs to confirm whether we have detected a potential problem in the line formation of Hβ.\nThe strong variation in c 1 with metallicity for G-type stars (Twarog et al., 2002, Fig. 4; see also O09) is reproduced well by the MARCS models (as already demonstrated by O09 for somewhat cooler dwarfs), so it can potentially be used to estimate [Fe/H] in solar metallicity and metal-rich solar analogs.\nOur tests provide confidence in the relative variation in stellar fluxes with atmospheric parameters as predicted by the MARCS models, at least in the atmospheric parameter space studied here.", "publication_ref": [], "figure_ref": ["fig_0", "fig_1", "fig_2", "fig_1", "fig_1"], "table_ref": []}, {"heading": "The zero-point of the T eff scale", "text": "Our solar (b-y) color can also be used to estimate how well different T eff scales reproduce the solar value of T eff (5777 K). Different color-T eff relations in the literature have been employed to obtain the T eff for our (by) ⊙ , and these values have then been subtracted from the solar effective temperature. These differences, shown in Table 6, are the zero-point corrections needed to place different T eff calibrations on the same T eff scale as the Sun. As can be seen, the T eff scale by Casagrande et al. (2010) seems the most accurate, with a negligible offset of only 10(±10) K with respect to the Sun, which is much smaller than the offset (109 K) of our earlier T eff calibration (RM05b).\nThe widely used T eff (b-y) scale of Alonso et al. (1996) is too cool by 137 K. Thus, the elemental chemical abundances determined using this scale (e.g. Israelian et al., 1998;Chen et al., 2000;Reddy et al., 2003;Allende Prieto et al., 2004;Jonsell et al., 2005) may be systematically incorrect by as much as 0.14 dex (e.g. for V from VI lines and for N from NH lines), albeit the impact on abundance ratios [X/Fe] should be smaller (and in a few cases mostly cancel) for lines of low to moderate excitation potential because of the compensating impact of the iron abundance obtained from FeI lines; however, for abundances obtained from lines of high excitation potential (e.g. CI, NI, OI, PI, SI) the impact could be as high as 0.2 dex. Thus, inaccurate temperature scales may be one of the reasons why the small peculiarities in the solar chemical composition (M09; R09) have not been discovered in the past (Ramírez et al., 2010).\nZero-point errors in T eff also affect stellar ages inferred from isochrones. For example, for an offset of 130 K and using Y 2 isochrones (Demarque et al., 2004), a systematic offset as high as 1.5-2 Gyr may result for a solar analog. Árnadóttir et al. (2010) made a critical evaluation of different metallicity calibrations for dwarf stars in the uvby system, finding zero-point offsets in many of these metallicity scales, ranging from -0.17 dex (Nordström et al., 2004) to +0.33 (O09), although the latter is a purely theoretical calibration intended to test model atmospheres and not for application to real stars. After extensive testing for potential problems in different metallicity calibrations, such as trends in the ∆[Fe/H] residuals (spectroscopic-photometric) with [Fe/H], (by), c 0 , and m 0 , Árnadóttir et al. (2010) find that the calibrations by RM05a has the best overall performance, albeit with a small (0.04 dex) zeropoint offset.", "publication_ref": ["b17", "b1", "b68", "b26", "b119", "b0", "b72", "b119", "b40", "b106"], "figure_ref": [], "table_ref": ["tab_1"]}, {"heading": "The zero-point of the metallicity scale", "text": "The zero-point offset cannot be overstated, especially when comparing the Sun to the stars (Gustafsson, 2008), because offsets in the zero-point of the metallicity scale could make the Sun appear abnormal (see Haywood, 2008;Gustafsson et al., 2010; and references therein for a discussion about apparent anomalies in the solar metallicity).\nOur solar colors can be used to check the zero-point of different metallicity calibrations, by computing [Fe/H] for our inferred solar colors and subtracting these metallicities from the solar metallicity ([Fe/H] = 0). Those differences, which are the zero-point corrections needed to place different metallicity calibrations on the same metallicity scale as the Sun, are shown in Table 7, along with the offsets found by Árnadóttir et al. (2010) for a broad range of colors and metallicities.\nMost metallicity calibrations do require a correction to place them on the same metallicity scale as the Sun. In particular, the RM05a metallicity calibration recommended by Árnadóttir et al. (2010) to derive [Fe/H] from Strömgren photometry, needs a zero-point correction of +0.04 dex. This offset is identical to the offset found by Árnadóttir et al. (2010) using a sample spanning a much broader range in T eff . We are currently revising the metallicity calibration employed in the GCS survey (Nordström et al., 2004;Holmberg et al., 2007) and plan to assess the apparent anomalously high metallicity of the Sun with a new accurate metallicity scale (Casagrande et al., in preparation).", "publication_ref": ["b54", "b63", "b56", "b106", "b66"], "figure_ref": [], "table_ref": ["tab_2"]}, {"heading": "Conclusions", "text": "New uvby-β photometry has been presented for solar-twin candidates observed at the SPM observatory. Comparisons with existing Strömgren photometry shows that our data are in excellent agreement (to better than 0.01 mag) with previous observations. Using accurate spectroscopically derived stellar parameters, the uvby-β photometry for the solar twins, and also for solar analogs covering a wider range in metallicities, the solar colors (by) ⊙ = 0.4105±0.0015, m 1,⊙ = 0.2122±0.0018, c 1,⊙ = 0.3319±0.0054, and β ⊙ = 2.5915±0.0024 have been inferred.\nAs discussed in the manuscript, our solar-twin data have provided stringent constraints on absolute fluxes, the performance of model atmospheres, and the zero-points of temperature and metallicity scales. In particular, we show that the widely used Alonso et al. (1996) (b-y) calibration is too cool by ∼140 K, while our new T eff calibration (Casagrande et al., 2010) has a negligible zero-point offset (10±10 K). Regarding model atmospheres, the Kurucz ATLAS9 solar model provides a closer fit of our solar colors than the MARCS 2008 solar model. The relative variation in colors with stellar parameters seem to be reproduced well by MARCS models, except for the metallicity variation in the β index, which is flatter than observed in solar twins and solar analogs, thus suggesting that there are existing limitations on the modeling of Balmer lines.\nWe are pursuing photometric observations of our solar-twin sample in other photometric systems, to perform similar evaluations of absolute fluxes, model atmospheres, and fundamental calibrations in astrophysics.   ", "publication_ref": ["b1", "b17"], "figure_ref": [], "table_ref": []}], "references": [{"ref_id": "b0", "title": "", "journal": "A&A", "year": "2004", "authors": "Allende Prieto; C Barklem; P S Lambert; D L Cunha; K "}, {"ref_id": "b1", "title": "", "journal": "A&A", "year": "1996", "authors": "A Alonso; S Arribas; C Martinez-Roger"}, {"ref_id": "b2", "title": "", "journal": "A&AS", "year": "1999", "authors": "A Alonso; S Arribas; C Martínez-Roger"}, {"ref_id": "b3", "title": "", "journal": "A&AS", "year": "1990", "authors": "A Arellano Ferro; L Parrao; W Schuster"}, {"ref_id": "b4", "title": "", "journal": "A&A", "year": "1996", "authors": "A Arellano Ferro; L Mantegazza"}, {"ref_id": "b5", "title": "", "journal": "ApJ", "year": "1978", "authors": "A S Árnadóttir; S Feltzing; I ; Lundström; A&a Barry; D C Cromwell; R H Schoolman; S A "}, {"ref_id": "b6", "title": "", "journal": "A&A", "year": "2010", "authors": "P Baumann; I Ramírez; J Meléndez; M Asplund"}, {"ref_id": "b7", "title": "", "journal": "A&A", "year": "1998", "authors": "M S Bessell; F Castelli; B Plez"}, {"ref_id": "b8", "title": "", "journal": "ARA&A", "year": "2005", "authors": "M S Bessell"}, {"ref_id": "b9", "title": "", "journal": "A&AS", "year": "1998", "authors": "D E Blackwell; A E Lynas-Gray"}, {"ref_id": "b10", "title": "The Future of Photometric, Spectrophotometric and Polarimetric Standardization", "journal": "Astronomical Society of the Pacific", "year": "2007", "authors": "R C Bohlin"}, {"ref_id": "b11", "title": "", "journal": "ApJ", "year": "1969", "authors": "H E Bond; J S Neff"}, {"ref_id": "b12", "title": "", "journal": "ApJ", "year": "1974", "authors": "H E Bond"}, {"ref_id": "b13", "title": "", "journal": "ApJS", "year": "1980", "authors": "H E Bond"}, {"ref_id": "b14", "title": "", "journal": "ApJ", "year": "2007", "authors": "A Calamida; G Bono; P B Stetson"}, {"ref_id": "b15", "title": "", "journal": "ApJ", "year": "2009", "authors": "A Calamida; G Bono; P B Stetson"}, {"ref_id": "b16", "title": "", "journal": "MNRAS", "year": "2006", "authors": "L Casagrande; L Portinari; C Flynn"}, {"ref_id": "b17", "title": "", "journal": "A&A", "year": "2010", "authors": "L Casagrande; I Ramírez; J Meléndez; M Bessell; M Asplund"}, {"ref_id": "b18", "title": "", "journal": "A&A", "year": "1997", "authors": "F Castelli; R G Gratton; R L Kurucz"}, {"ref_id": "b19", "title": "", "journal": "", "year": "2004", "authors": "F Castelli; R L Kurucz"}, {"ref_id": "b20", "title": "", "journal": "A&A", "year": "2004", "authors": "F Castelli; S Hubrig"}, {"ref_id": "b21", "title": "", "journal": "Memorie della Societa Astronomica Italiana Supplement", "year": "2005", "authors": "F Castelli"}, {"ref_id": "b22", "title": "", "journal": "A&A", "year": "2006", "authors": "F Castelli; R L Kurucz"}, {"ref_id": "b23", "title": "", "journal": "A&A", "year": "1981", "authors": "G Cayrel De Strobel; N Knowles; G Hernandez; C Bentolila"}, {"ref_id": "b24", "title": "", "journal": "A&A Rev", "year": "1996", "authors": "G Cayrel De Strobel"}, {"ref_id": "b25", "title": "", "journal": "A&A", "year": "2001", "authors": "G Cayrel De Strobel; C Soubiran; N Ralite"}, {"ref_id": "b26", "title": "", "journal": "A&AS", "year": "2000", "authors": "Y Q Chen; P E Nissen; G Zhao; H W Zhang; T Benoni"}, {"ref_id": "b27", "title": "", "journal": "A&A", "year": "1981", "authors": "Y Chmielewski"}, {"ref_id": "b28", "title": "", "journal": "AJ", "year": "2004", "authors": "J L Clem; D A Vandenberg; F Grundahl; R A Bell"}, {"ref_id": "b29", "title": "", "journal": "A&A", "year": "1979", "authors": "G L Clements; J S Neff"}, {"ref_id": "b30", "title": "", "journal": "A&A", "year": "2005", "authors": "P Coelho; B Barbuy; J Meléndez; R P Schiavon; B V Castilho"}, {"ref_id": "b31", "title": "", "journal": "AJ", "year": "1996", "authors": "L Colina; R C Bohlin; F Castelli"}, {"ref_id": "b32", "title": "", "journal": "ApJ", "year": "1966", "authors": "P S Conti; A J Deutsch"}, {"ref_id": "b33", "title": "Allen's Astrophysical Quantities", "journal": "AIP Press / Springer", "year": "2000", "authors": "A N Cox"}, {"ref_id": "b34", "title": "", "journal": "Spectral Classification and Multicolour Photometry", "year": "1966", "authors": "D L Crawford"}, {"ref_id": "b35", "title": "", "journal": "AJ", "year": "1970", "authors": "D L Crawford; J V Barnes"}, {"ref_id": "b36", "title": "", "journal": "AJ", "year": "1966", "authors": "D L Crawford; J Mander"}, {"ref_id": "b37", "title": "", "journal": "AJ", "year": "1975", "authors": "D L Crawford"}, {"ref_id": "b38", "title": "", "journal": "A&AS", "year": "1972", "authors": "D L Crawford; J V Barnes; J Gibson"}, {"ref_id": "b39", "title": "", "journal": "PASP", "year": "1972", "authors": "S K Croft; D H Mcnamara; K A Feltz;  Jr"}, {"ref_id": "b40", "title": "", "journal": "ApJS", "year": "2004", "authors": "P Demarque; J.-H Woo; Y.-C Kim; S K Yi"}, {"ref_id": "b41", "title": "", "journal": "Physica Scripta", "year": "2008", "authors": "B Edvardsson"}, {"ref_id": "b42", "title": "", "journal": "A&A", "year": "1993", "authors": "B Edvardsson; J Andersen; B Gustafsson"}, {"ref_id": "b43", "title": "", "journal": "ApJ", "year": "1992", "authors": "E D Friel; A M Boesgaard"}, {"ref_id": "b44", "title": "", "journal": "Annales d'Astrophysique", "year": "1964", "authors": "L Gallouëtte"}, {"ref_id": "b45", "title": "", "journal": "A&A", "year": "1981", "authors": "T Gehren"}, {"ref_id": "b46", "title": "", "journal": "A&A", "year": "1996", "authors": "R G Gratton; E Carretta; F Castelli"}, {"ref_id": "b47", "title": "", "journal": "PASP", "year": "1992", "authors": "D F Gray"}, {"ref_id": "b48", "title": "", "journal": "PASP", "year": "1995", "authors": "D F Gray"}, {"ref_id": "b49", "title": "The Observation and Analysis of Stellar Photospheres, 3rd Edition", "journal": "Cambridge University Press", "year": "2005", "authors": "D F Gray"}, {"ref_id": "b50", "title": "", "journal": "A&AS", "year": "1976", "authors": "B Grønbech; E H Olsen; B Strömgren"}, {"ref_id": "b51", "title": "", "journal": "Liege International Astrophysical Colloquia", "year": "2000", "authors": "F Grundahl; D A Vandenberg; P B Stetson; M I Andersen; M Briley"}, {"ref_id": "b52", "title": "", "journal": "A&A", "year": "2002", "authors": "F Grundahl; M Briley; P E Nissen; S Feltzing"}, {"ref_id": "b53", "title": "", "journal": "A&A", "year": "1972", "authors": "B Gustafsson; P E Nissen"}, {"ref_id": "b54", "title": "", "journal": "Physica Scripta", "year": "2008", "authors": "B Gustafsson"}, {"ref_id": "b55", "title": "", "journal": "A&A", "year": "2008", "authors": "B Gustafsson; B Edvardsson; K Eriksson"}, {"ref_id": "b56", "title": "", "journal": "ApSS", "year": "2010", "authors": "B Gustafsson; J Meléndez; M Asplund; D Yong"}, {"ref_id": "b57", "title": "", "journal": "Baltic Astronomy", "year": "1996", "authors": "B Hauck; M Kunzli"}, {"ref_id": "b58", "title": "", "journal": "A&AS", "year": "1998", "authors": "B Hauck; M Mermilliod"}, {"ref_id": "b59", "title": "", "journal": "A&A", "year": "1978", "authors": "J Hardorp"}, {"ref_id": "b60", "title": "", "journal": "A&A", "year": "1980", "authors": "J Hardorp"}, {"ref_id": "b61", "title": "", "journal": "A&A", "year": "1980", "authors": "J Hardorp"}, {"ref_id": "b62", "title": "", "journal": "MNRAS", "year": "2002", "authors": "M Haywood"}, {"ref_id": "b63", "title": "", "journal": "MNRAS", "year": "2008", "authors": "M Haywood"}, {"ref_id": "b64", "title": "", "journal": "A&A", "year": "2000", "authors": "M Hilker"}, {"ref_id": "b65", "title": "", "journal": "MNRAS", "year": "2006", "authors": "J Holmberg; C Flynn; L Portinari"}, {"ref_id": "b66", "title": "", "journal": "A&A", "year": "2007", "authors": "J Holmberg; B Nordström; J Andersen"}, {"ref_id": "b67", "title": "", "journal": "A&A", "year": "2009", "authors": "J Holmberg; B Nordström; J Andersen"}, {"ref_id": "b68", "title": "", "journal": "ApJ", "year": "1998", "authors": "G Israelian; R J García López; R Rebolo"}, {"ref_id": "b69", "title": "", "journal": "ApJ", "year": "1962", "authors": "H L Johnson"}, {"ref_id": "b70", "title": "", "journal": "Comm. Lunar and Planetary Lab", "year": "1966", "authors": "H L Johnson; B Iriarte; R I Mitchell; W Z Wisniewski"}, {"ref_id": "b71", "title": "", "journal": "PASP", "year": "1995", "authors": "M D Joner; B J Taylor"}, {"ref_id": "b72", "title": "", "journal": "A&A", "year": "2005", "authors": "K Jonsell; B Edvardsson; B Gustafsson"}, {"ref_id": "b73", "title": "", "journal": "New Astronomy", "year": "2010", "authors": "¸ Karatas; Y Schuster; W J "}, {"ref_id": "b74", "title": "", "journal": "PASP", "year": "1963", "authors": "G E Kron"}, {"ref_id": "b75", "title": "", "journal": "ApJ", "year": "1938", "authors": "G P Kuiper"}, {"ref_id": "b76", "title": "", "journal": "SAO Special Report", "year": "1981", "authors": "R L Kurucz; E H Avrett"}, {"ref_id": "b77", "title": "Precision Photometry: Astrophysics of the Galaxy", "journal": "Davis Press", "year": "1991", "authors": "R L Kurucz"}, {"ref_id": "b78", "title": "Diatomic Molecular Data for Opacity Calculations", "journal": "Smithsonian Astrophysical Observatory", "year": "1993", "authors": "R Kurucz"}, {"ref_id": "b79", "title": "", "journal": "IAU Symposium", "year": "1996", "authors": "R L Kurucz"}, {"ref_id": "b80", "title": "", "journal": "Memorie della Societa Astronomica Italiana Supplement", "year": "2005", "authors": "R L Kurucz"}, {"ref_id": "b81", "title": "", "journal": "A&A", "year": "2003", "authors": "R Lallement; B Y Welsh; J L Vergely; F Crifo; D Sfeir"}, {"ref_id": "b82", "title": "", "journal": "ApJS", "year": "1986", "authors": "J B Lester; R O Gray; R L Kurucz"}, {"ref_id": "b83", "title": "", "journal": "ApJ", "year": "1992", "authors": "G W Lockwood; H Tueg; N M White"}, {"ref_id": "b84", "title": "", "journal": "AJ", "year": "2006", "authors": "R E Luck; U Heiter"}, {"ref_id": "b85", "title": "", "journal": "A&A", "year": "1983", "authors": "P Magain"}, {"ref_id": "b86", "title": "", "journal": "A&AS", "year": "1994", "authors": "V Malyuto"}, {"ref_id": "b87", "title": "", "journal": "ApJ", "year": "2002", "authors": "S Martell; G Laughlin"}, {"ref_id": "b88", "title": "", "journal": "PASP", "year": "2004", "authors": "S L Martell; G H Smith"}, {"ref_id": "b89", "title": "", "journal": "A&A", "year": "2003", "authors": "J Meléndez; I Ramírez"}, {"ref_id": "b90", "title": "", "journal": "ApJ", "year": "2006", "authors": "J Meléndez; K Dodds-Eden; J A Robles"}, {"ref_id": "b91", "title": "", "journal": "ApJ", "year": "2007", "authors": "J Meléndez; I Ramírez"}, {"ref_id": "b92", "title": "", "journal": "ApJ", "year": "2009", "authors": "J Meléndez; M Asplund; B Gustafsson; D Yong"}, {"ref_id": "b93", "title": "", "journal": "", "year": null, "authors": "M "}, {"ref_id": "b94", "title": "", "journal": "A&A", "year": "2010", "authors": "J Meléndez; L Casagrande; I Ramírez; M Asplund; W J Schuster"}, {"ref_id": "b95", "title": "", "journal": "ApSS", "year": "2010", "authors": "J Meléndez; I Ramírez; L Casagrande"}, {"ref_id": "b96", "title": "", "journal": "A&AS", "year": "1997", "authors": "J.-C Mermilliod; M Mermilliod; B Hauck"}, {"ref_id": "b97", "title": "", "journal": "Astronomy Reports", "year": "1998", "authors": "A V Mironov; V G Moshkalev; A V Kharitonov"}, {"ref_id": "b98", "title": "", "journal": "AJ", "year": "1985", "authors": "R I Mitchell; W J Schuster"}, {"ref_id": "b99", "title": "", "journal": "A&A", "year": "1986", "authors": "H Neckel"}, {"ref_id": "b100", "title": "", "journal": "Sol. Phys", "year": "1999", "authors": "H Neckel"}, {"ref_id": "b101", "title": "", "journal": "Sol. Phys", "year": "2003", "authors": "H Neckel"}, {"ref_id": "b102", "title": "", "journal": "Sol. Phys", "year": "1981", "authors": "H Neckel; D Labs"}, {"ref_id": "b103", "title": "", "journal": "Sol. Phys", "year": "1984", "authors": "H Neckel; D Labs"}, {"ref_id": "b104", "title": "", "journal": "A&A", "year": "1981", "authors": "P E Nissen"}, {"ref_id": "b105", "title": "", "journal": "A&A", "year": "1991", "authors": "P E Nissen; W J Schuster"}, {"ref_id": "b106", "title": "", "journal": "A&A", "year": "2004", "authors": "B Nordström; M Mayor; J Andersen"}, {"ref_id": "b107", "title": "", "journal": "A&A", "year": "1976", "authors": "E H Olsen"}, {"ref_id": "b108", "title": "", "journal": "A&AS", "year": "1983", "authors": "E H Olsen"}, {"ref_id": "b109", "title": "", "journal": "A&AS", "year": "1984", "authors": "E H Olsen"}, {"ref_id": "b110", "title": "", "journal": "A&A", "year": "2009", "authors": "A Önehag; B Gustafsson; K Eriksson; B Edvardsson"}, {"ref_id": "b111", "title": "", "journal": "", "year": "1988", "authors": "L Parrao; W J Schuster; A Arellano Ferro"}, {"ref_id": "b112", "title": "", "journal": "A&A", "year": "2008", "authors": "L Pasquini; K Biazzo; P Bonifacio; S Randich; L R Bedin"}, {"ref_id": "b113", "title": "", "journal": "ApJ", "year": "1928", "authors": "E Pettit; S B Nicholson"}, {"ref_id": "b114", "title": "", "journal": "ApJ", "year": "1997", "authors": "G F Porto De Mello; L Da Silva"}, {"ref_id": "b115", "title": "", "journal": "A&A", "year": "2004", "authors": "I Ramírez; J Meléndez"}, {"ref_id": "b116", "title": "", "journal": "ApJ", "year": "2005", "authors": "I Ramírez; J Meléndez"}, {"ref_id": "b117", "title": "", "journal": "ApJ", "year": "2005", "authors": "I Ramírez; J Meléndez"}, {"ref_id": "b118", "title": "", "journal": "A&A", "year": "2009", "authors": "I Ramírez; J Meléndez; M Asplund"}, {"ref_id": "b119", "title": "", "journal": "MNRAS", "year": "2003", "authors": "I Ramírez; M Asplund; P Baumann; J Meléndez; T ; Bensby; A&a Reddy; B E Tomkin; J Lambert; D L Prieto; C "}, {"ref_id": "b120", "title": "", "journal": "ApJS", "year": "1978", "authors": "L J Relyea; R L Kurucz"}, {"ref_id": "b121", "title": "", "journal": "AJ", "year": "2008", "authors": "G H Rieke; M Blaylock; L Decin"}, {"ref_id": "b122", "title": "", "journal": "A&A", "year": "1985", "authors": "M Saxner; G Hammarback"}, {"ref_id": "b123", "title": "", "journal": "Memorie della Societa Astronomica Italiana Supplement", "year": "2004", "authors": "L Sbordone; P Bonifacio; F Castelli; R L Kurucz"}, {"ref_id": "b124", "title": "", "journal": "A&A", "year": "2010", "authors": "L Sbordone"}, {"ref_id": "b125", "title": "", "journal": "Rev. Mex. Astron. Astrofis", "year": "1976", "authors": "W J Schuster"}, {"ref_id": "b126", "title": "", "journal": "A&AS", "year": "1988", "authors": "W J Schuster; P E Nissen"}, {"ref_id": "b127", "title": "", "journal": "A&A", "year": "1989", "authors": "W J Schuster; P E Nissen"}, {"ref_id": "b128", "title": "", "journal": "A&AS", "year": "1993", "authors": "W J Schuster; L Parrao; M E Contreras Martínez"}, {"ref_id": "b129", "title": "", "journal": "A&AS", "year": "1996", "authors": "W J Schuster; P E Nissen; L Parrao; T C Beers; L P Overgaard"}, {"ref_id": "b130", "title": "", "journal": "Rev. Mex. Astr. Astrofis", "year": "2001", "authors": "W J Schuster; L Parrao"}, {"ref_id": "b131", "title": "", "journal": "The Journal of Astronomical Data", "year": "2002", "authors": "W J Schuster; L Parrao; J Guichard"}, {"ref_id": "b132", "title": "", "journal": "A&A", "year": "2004", "authors": "W J Schuster; T C Beers; R Michel; P E Nissen; G García"}, {"ref_id": "b133", "title": "", "journal": "A&A", "year": "2006", "authors": "W J Schuster; A Moitinho; A Márquez; L Parrao; E Covarrubias"}, {"ref_id": "b134", "title": "Roma : Tip", "journal": "Belle Arti", "year": "1868", "authors": "A Secchi"}, {"ref_id": "b135", "title": "", "journal": "AJ", "year": "2000", "authors": "M Iii Sekiguchi; M Fukugita"}, {"ref_id": "b136", "title": "", "journal": "A&A", "year": "1995", "authors": "B Smalley; M M Dworetsky"}, {"ref_id": "b137", "title": "", "journal": "A&A", "year": "1997", "authors": "B Smalley; F Kupka"}, {"ref_id": "b138", "title": "Solar Analogs: Characteristics and Optimum Candidates", "journal": "Lowell Observatory", "year": "1998", "authors": "D R Soderblom; J R King"}, {"ref_id": "b139", "title": "", "journal": "A&A", "year": "2004", "authors": "C Soubiran; A Triaud"}, {"ref_id": "b140", "title": "", "journal": "A&A", "year": "2008", "authors": "S G Sousa; N C Santos; M Mayor"}, {"ref_id": "b141", "title": "", "journal": "ApJ", "year": "1945", "authors": "J Stebbins; A E Whitford"}, {"ref_id": "b142", "title": "", "journal": "ApJ", "year": "1957", "authors": "J Stebbins; G E Kron"}, {"ref_id": "b143", "title": "", "journal": "Baltic Astronomy", "year": "1994", "authors": "V Straizys; G Valiauga"}, {"ref_id": "b144", "title": "", "journal": "QJRAS", "year": "1963", "authors": "B Strömgren"}, {"ref_id": "b145", "title": "", "journal": "Astrophysica Norvegica", "year": "1964", "authors": "B Strömgren"}, {"ref_id": "b146", "title": "", "journal": "PASP", "year": "1982", "authors": "B Stromgren; B Gustafsson; E H Olsen"}, {"ref_id": "b147", "title": "", "journal": "A&A", "year": "2007", "authors": "Y Takeda; S Kawanomoto; S Honda; H Ando; T Sakurai"}, {"ref_id": "b148", "title": "", "journal": "PASJ", "year": "2009", "authors": "Y Takeda; A Tajitsu"}, {"ref_id": "b149", "title": "", "journal": "ApJS", "year": "1984", "authors": "B J Taylor"}, {"ref_id": "b150", "title": "", "journal": "PASP", "year": "1994", "authors": "B J Taylor"}, {"ref_id": "b151", "title": "", "journal": "Adv. Space Res", "year": "2004", "authors": "G Thuillier; L Floyd; T N Woods"}, {"ref_id": "b152", "title": "", "journal": "A&A", "year": "1982", "authors": "H Tueg"}, {"ref_id": "b153", "title": "", "journal": "A&A", "year": "1982", "authors": "H Tueg; T Schmidt-Kaler"}, {"ref_id": "b154", "title": "", "journal": "AJ", "year": "2002", "authors": "B A Twarog; B J Anthony-Twarog; D Tanner"}, {"ref_id": "b155", "title": "", "journal": "AJ", "year": "2007", "authors": "B A Twarog; L C Vargas; B J Anthony-Twarog"}, {"ref_id": "b156", "title": "", "journal": "ApJS", "year": "2005", "authors": "J A Valenti; D A Fischer"}, {"ref_id": "b157", "title": "", "journal": "JRASC", "year": "1965", "authors": "S Van Den Bergh"}, {"ref_id": "b158", "title": "", "journal": "ApJS", "year": "1985", "authors": "D A Vandenberg; R A Bell"}, {"ref_id": "b159", "title": "", "journal": "AJ", "year": "1989", "authors": "D A Vandenberg; H E Poll"}, {"ref_id": "b160", "title": "", "journal": "A&A", "year": "2010", "authors": "B Y Welsh; R Lallement; J.-L Vergely; S Raimond"}, {"ref_id": "b161", "title": "", "journal": "A&A", "year": "1996", "authors": "R Wielen; B Fuchs; C Dettbarn"}, {"ref_id": "b162", "title": "", "journal": "J. Geophys. Res", "year": "1996", "authors": "T N Woods; D K Prinz; G J Rottman"}, {"ref_id": "b163", "title": "", "journal": "ApJ", "year": "2008", "authors": "D Yong; F Grundahl; J A Johnson; M Asplund"}, {"ref_id": "b164", "title": "", "journal": "A&A", "year": "1998", "authors": "L Zacs; P E Nissen; W J Schuster"}], "figures": [{"figure_label": "1", "figure_type": "figure", "figure_id": "fig_0", "figure_caption": "Fig. 1 .1Fig. 1. (b-y) vs. T eff (upper left panel), [Fe/H] (upper right panel), and V magnitude (lower left panel, with a dot-dashed line at (by) ⊙ ). The results of the global fit vs. the observed (by) color is presented in the lower right panel, with the dotted line indicating equality. Solar twins and solar analogs are represented by filled and open circles, respectively. The dependences of the fit on T eff and [Fe/H] are shown by dashed lines, while the relative predictions of MARCS models (normalized to our inferred solar colors) are shown by solid lines.", "figure_data": ""}, {"figure_label": "2", "figure_type": "figure", "figure_id": "fig_1", "figure_caption": "Fig. 2 .2Fig. 2. β vs. T eff (upper left panel), [Fe/H] (upper right panel), and V magnitude (lower left panel). The results of the global fit vs. the observed β color is presented in the lower right panel. Symbols are as in Fig. 1, except that two curves are presented for MARCS models: the shallower curve is the one computed by us while the other one is from O09. Neither curve is able to explain the low β colors observed for [Fe/H] < -0.2.", "figure_data": ""}, {"figure_label": "3", "figure_type": "figure", "figure_id": "fig_2", "figure_caption": "Fig. 3 .3Fig. 3. m 1 vs. T eff (upper left panel), [Fe/H] (upper right panel), and V magnitude (lower left panel). The results of the global fit vs. the observed m 1 color is presented in the lower right panel. Symbols are as in Fig. 1.", "figure_data": ""}, {"figure_label": "4", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Global fits for color = A + B (T eff -5777) + C (log g -4.44) + D [Fe/H]", "figure_data": "colorAerrorBerrorCerrorDerrorσ (fit)solar colorsb -y 0.4105 0.0005 -1.2737e-4 9.2777e-60.049813 0.004753 0.0046 0.4105±0.0015m 10.2122 0.0006 -1.1405e-4 1.1657e-50.05051 0.00936 0.125539 0.005877 0.0056 0.2122±0.0018c 10.3319 0.0018-0.11223 0.02658 0.124344 0.016006 0.0165 0.3319±0.0054β2.5915 0.00084.5183e-5 1.5840e-5 -0.03241 0.01192 0.034604 0.007492 0.0061 2.5915±0.0024"}, {"figure_label": "6", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "∆ T eff needed to correct the zeropoint of the most recent T eff scales", "figure_data": "∆ T eff reference(K)(b-y)+137 Alonso et al. (1996)+85 Gratton et al. (1996)+118 Blackwell & Lynas-Gray (1998)+68 Clem et al. (2004)+109 RM05b+48 Holmberg et al. (2007)+10 Casagrande et al. (2010)β+130 Alonso et al. (1996)"}, {"figure_label": "7", "figure_type": "table", "figure_id": "tab_2", "figure_caption": "∆ [Fe/H] needed to correct the zero-point of different uvby metallicity scales", "figure_data": "∆ [Fe/H]∆ [Fe/H]referenceThis workÁrnadóttir et al. 2010+0.06,+0.05 +0.11±0.34Olsen (1984)+0.05+0.06±0.16Schuster & Nissen (1989)-0.04+0.00±0.18Haywood (2002)+0.07+0.05±0.13Martell & Laughlin (2002)+0.07+0.06±0.21Martell & Smith (2004)+0.04+0.04±0.14RM05a+0.09+0.08±0.16Holmberg et al. (2007)+0.37+0.33±0.30O09"}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_3", "figure_caption": "Photometry (V Johnson and uvby-β) of 73 solar-twin candidates from San Pedro Mártir Observatory", "figure_data": "HIP number HD/BD numberV (b-y)m 1c 1 N V N uvbyβ N β348225194 8.600 0.407 0.188 0.30744 2.5844996804 8.184 0.403 0.190 0.34044 2.598414111327 9.088 0.441 0.211 0.34244 2.57942894+48 0182 8.653 0.415 0.208 0.29144 2.587449096204 8.508 0.403 0.206 0.31944 2.597451346470 8.965 0.402 0.187 0.28144 2.581464078291 8.612 0.411 0.205 0.29644 2.584472459446 8.377 0.423 0.218 0.32844 2.5964850711195 8.890 0.413 0.207 0.31744 2.59548841-13 0347 9.232 0.423 0.209 0.30144 2.5934934912264 7.975 0.407 0.210 0.32444 2.594410710+18 0289 8.924 0.400 0.191 0.30255 2.59451172815632 8.041 0.414 0.219 0.33355 2.59051191516008 8.608 0.406 0.211 0.31444 2.59441461419518 7.858 0.400 0.198 0.30355 2.59151826124552 7.976 0.390 0.195 0.32555 2.60452567036152 8.285 0.413 0.219 0.38066 2.59962833640620 8.982 0.411 0.209 0.29466 2.57863526556124 6.936 0.395 0.207 0.34977 2.59473651259711 7.732 0.403 0.210 0.31655 2.58853807263487 9.206 0.406 0.215 0.35166 2.60164131771334 7.808 0.409 0.218 0.34155 2.58854183271779 8.125 0.399 0.199 0.32277 2.58074287274645 9.276 0.402 0.198 0.36344 2.59444432477006 7.942 0.390 0.190 0.32266 2.58764493578534 8.722 0.413 0.212 0.34455 2.59054499778660 8.346 0.412 0.221 0.32255 2.58854799084705 8.704 0.406 0.218 0.32755 2.591549572+30 1962 9.288 0.406 0.203 0.34655 2.59154975688072 7.549 0.403 0.220 0.32655 2.593550826+17 2213 9.129 0.403 0.189 0.28355 2.58155133790733 8.905 0.399 0.203 0.35455 2.59555204091909 9.194 0.406 0.207 0.28855 2.57355213792074 8.638 0.415 0.218 0.31755 2.58455540998649 8.010 0.407 0.217 0.35655 2.58555545998618 7.658 0.406 0.206 0.34155 2.607558303103828 8.443 0.411 0.210 0.31455 2.642559357105779 8.665 0.389 0.189 0.31855 2.581560314107633 8.783 0.409 0.213 0.36245 2.592560653108204 8.737 0.401 0.181 0.35255 2.579563048112257 7.808 0.423 0.220 0.35155 2.582564150114174 6.795 0.412 0.234 0.33555 2.584564497114826 8.943 0.411 0.215 0.35155 2.598564713115169 9.268 0.398 0.211 0.355"}, {"figure_label": "3", "figure_type": "table", "figure_id": "tab_4", "figure_caption": "Stellar parameters", "figure_data": "HIP numberT eff log g [Fe/H] reference348 57774.41-0.13 R09996 58604.380.00 R091499 57564.370.19 R09+VF05+LH06+T07+S082894 58204.54-0.03 R094909 58364.440.02 R095134 57794.49-0.19 R096407 57874.47-0.09 R098507 57204.44-0.08 R098841 56764.50-0.12 R099349 58254.490.01 R0910710 58174.39-0.13 R0911728 57384.370.05 R09+T0711915 57934.45-0.05 R0914614 58034.47-0.10 R09+T07+B1015457 57714.560.08 B10+VF0518261 58914.440.00 R09+T0722263 58264.540.00 B10+VF0525670 57554.380.07 R09+T0728336 57134.53-0.17 R0929525 57154.410.00 B1030502 57454.47-0.01 M0936512 57404.50-0.09 M09+T07+S0838072 58394.530.06 R0938228 56934.520.01 R09+VF0541317 57244.46-0.04 M09+VF05+S0842438 58644.46-0.05 R0943190 57754.370.12 M0944324 59344.51-0.02 R09+T0744713 57844.360.10 B10+VF05+S0844935 58004.410.07 M0944997 57734.530.03 M09+T0749572 58314.330.01 R0949756 58044.450.04 R09+VF05+T0750826 57254.47-0.28 M0952040 57854.51-0.09 R0952137 58424.560.07 R0953721 59164.480.03 B10+VF0555409 57604.52-0.01 M0955459 58384.420.04 R09+VF05+M06+MR07+T0756948 57954.450.02 R09+MR07+T09+M1059357 58104.45-0.24 M0959610 58994.34-0.03 B10+VF0560081 58114.380.32 M09+VF05+S0860314 58744.520.11 R0960653 57254.38-0.29 M0962175 58494.430.14 R09+T0764150 57554.390.06 R09+VF05+T0764713 58154.52-0.01 M0964794 57434.33-0.10 R0964993 58754.560.09 M0966885 56854.48-0.38 M0973815 58034.340.02 MR07+R0974341 58534.510.09 R0974389 58594.480.11 M09+S0875923 57754.56-0.02 M0977052 56974.540.04 B10+VF0577883 56954.390.04 M0979578 58604.530.07 M09+VF0579672 58224.450.05 M09+VF05+M06+MR07+T07+T09+M0980337 58814.530.03 B10+VF05+S0885042 56924.390.04 B10+VF05+S0885285 57304.43-0.39 M0988194 57354.40-0.07 R09+VF05+T0788427 58104.42-0.16 R0996402 57134.33-0.03 B10+T0796895 58084.330.10 R09+VF05+LH0696901 57374.340.06 R09+VF05+LH06+T07100963 58024.450.01 R09+T07+T09102152 57374.35-0.01 R09+M10b104504 58364.50-0.16 R09108708 58754.510.15 R09108996 58384.500.06 R09109110 58174.460.06 B10+VF05+T07109931 57394.290.04 R09113357 58034.380.22 R09+VF05+LH06"}, {"figure_label": "5", "figure_type": "table", "figure_id": "tab_5", "figure_caption": "Solar colors and predictions from models atmospheres. Our synthetic colors (This work) were computed using theBessell (2005) filters, with zero points based on both the STIS observed and ATLAS9 synthetic spectrum of Vega", "figure_data": "(b-y)m 1c 1βreferenceSolar colors (this work)0.4105 (±0.0015)0.2122 (±0.0018) 0.3319 (±0.0054) 2.5915 (±0.0024)Solar spectra0.406,0.390(±0.004), (b-y) from β2.5955(±0.0024)Olsen (1976), using asteroids0.4250.1720.3232.625This work, C96 [STIS]0.4210.1780.3502.595This work, C96 [ATLAS9]0.4240.1880.3062.632This work, N99 [STIS]0.4200.1940.3332.602This work, N99 [ATLAS9]0.4000.1950.3052.631This work, N99+N03 [STIS]0.3960.2010.3322.601This work, N99+N03 [ATLAS9]0.4020.2250.2872.625This work, Thuillier (2004) [STIS]0.3980.2310.3142.595This work, Thuillier (2004) [ATLAS9]Kurucz models0.3710.2140.243Relyea & Kurucz (1978)0.414Kurucz (1991)0.355, 0.3880.2350.3592.618, 2.660Lester et al. (1986)2.581Smalley & Dworetsky (1995)0.393(CM), 0.400(noOV), 0.414(OV) 0.278 (CM)0.339 (CM)Smalley & Kupka (1997)0.397(noOVER), 0.410 (OVER)Castelli et al. (1997)2.590Castelli & Kurucz (2006)0.4100.2080.2762.617This work, ATLAS9 [STIS]0.4060.2140.3032.587This work, ATLAS9 [ATLAS9]MARCS models0.3810.1590.262Vandenberg & Bell (1985)0.3830.2580.3252.589O090.3830.2200.3672.621This work, MARCS 2008 [STIS]0.3790.2260.3942.591This work, MARCS 2008 [ATLAS9]From empirical calibrations or average of solar analogs0.425(±0.015)Gehren (1981)0.407(±0.010)2.591(±0.005)Saxner & Hammarback (1985)0.414(±0.003)Gray (1992)0.406(±0.004)Edvardsson et al. (1993)0.404(±0.005)Cayrel de Strobel (1996)0.39990.20900.323Clem et al. (2004)0.394RM05b0.403(±0.013)0.200(±0.026)0.370(±0.068)Holmberg et al. (2006)0.4089(±0.0100)Casagrande et al. (2010)"}], "formulas": [{"formula_id": "formula_0", "formula_text": "color = A + B (T eff -5777) + C (logg -4.44) + D [Fe/H]. (1)", "formula_coordinates": [4.0, 42.12, 196.86, 254.96, 9.84]}, {"formula_id": "formula_1", "formula_text": "< [Fe/H] < -0.1 dex, +0.1 < [Fe/H] < +0.4 dex).", "formula_coordinates": [4.0, 42.12, 323.45, 254.94, 20.09]}, {"formula_id": "formula_2", "formula_text": "β ⊙ = 2.5915 (±0.0024). (3", "formula_coordinates": [5.0, 42.12, 524.18, 251.05, 9.33]}, {"formula_id": "formula_3", "formula_text": ")", "formula_coordinates": [5.0, 293.17, 524.18, 3.91, 8.97]}], "doi": ""}
