{"title": "xGASS: The scatter of the Hi-halo mass relation of central galaxies", "authors": "Manasvee Saraf; Luca Cortese; O Ivy Wong; Barbara Catinella; Steven Janowiecki; Jennifer A Hardwick", "pub_date": "2024-04-03", "abstract": "Empirical studies of the relationship between baryonic matter in galaxies and the gravitational potential of their host halos are important to constrain our theoretical framework for galaxy formation and evolution. One such relation, between the atomic hydrogen (Hi) mass of central galaxies (𝑀 HI,c ) and the total mass of their host halos (𝑀 halo ), has attracted significant interest in the last few years. In this work, we use the extended GALEX Arecibo SDSS Survey to examine the scatter of the Hi-halo mass relation for a representative sample of central galaxies. Our findings reveal a flat median relation at log 10 (𝑀 HI,c /M ⊙ ) ≈ 9.40, across 11.1 < log 10 (𝑀 halo /M ⊙ ) < 14.1. This flat relation stems from the statistical dominance of star-forming, disc galaxies at low 𝑀 halo in combination with the increasing prevalence of passive, high stellar-concentration systems at higher 𝑀 halo . The scatter of this relation and the stellar specific angular momentum of centrals have a strong link (Spearman's rank correlation coefficient ≥ 0.5). Comparisons with simulations suggest that the kinematic state of host halos may be primarily driving this scatter. Our findings highlight that the Hi-halo mass parameter space is too complex to be completely represented by simple median or average relations and we show that tensions with previous works are most likely due to selection biases. We recommend that future observational studies, and their comparisons with theoretical models, bin central galaxies also by their secondary properties to enable a statistically robust understanding of the processes regulating the cold gas content within central galaxies of dark-matter halos.", "sections": [{"heading": "INTRODUCTION", "text": "Studies that link the baryonic content of galaxies to the gravitational field in and around them, are important to further the understanding of the nature of dark matter and the processes that govern galaxy formation and evolution. Cold gas plays a critical role in the process of star formation and, thus, is a probe for processes regulating galaxy evolution. However, the relationship between cold gas and the gravitational potential of its host halo has not been completely understood. In the last few years, the atomic hydrogen (Hi) to halo mass relation has received increasing attention, in particular from the theoretical community, as it can help constrain simulations of galaxy formation (e.g. Kim et al. 2017;Padmanabhan & Kulkarni 2017;Villaescusa-Navarro et al. 2018;Baugh et al. 2019;Spinelli et al. 2020;Chauhan et al. 2020). Currently, different simulations predict different values of Hi mass (𝑀 HI ) for a given host halo mass (𝑀 halo ), particularly in the 11.5 < log 10 (𝑀 halo /M ⊙ ) < 13.5 range. These disagreements arise due to different input physical models such as that of gas dynamics, stellar feedback, ram-pressure effects, photo-ionisation and interstellar medium properties.\n★ E-mail: manasvee.saraf@icrar.org Simulations also predict a large scatter of the Hi-halo mass relation (Villaescusa-Navarro et al. 2018;Baugh et al. 2019;Spinelli et al. 2020;Chauhan et al. 2020). These simulation-based studies have tested several physical drivers of this scatter such as that related to halo assembly history (e.g. spin, substructure, concentration, formation age) and the efficiency of suppressing gas cooling and enhancing gas outflow by the active galactic nucleus (AGN; e.g. black hole-tostellar mass ratio of the central galaxy). However, like the shape of this relation, the scatter too is found to be model dependent. Testing these predictions with observations is challenging due to limitations of current observational data. It is still very difficult to detect cold gas in galaxies below the star-forming main-sequence (SFMS), given the current sensitivity of radio telescopes (Saintonge & Catinella 2022). To combat this bias and enhance the number statistics, several observational studies improve the signal-to-noise of the Hi 21 cm profile by co-adding spectra of optically selected galaxies or groups (e.g. Guo et al. 2020;Rhee et al. 2023;Dev et al. 2023). These 'spectral stacking' techniques provide direct measurements, extracted from fixed spatial apertures and line widths, of the average Hi content in galaxies or groups within selected 𝑀 halo bins. However, while insightful in studying the underlying average trend between 𝑀 HI and 𝑀 halo , these techniques do not provide any information regarding the scatter.\nIn simulation-based studies, the scatter of the Hi-halo mass relation is especially large when considering only the Hi mass within centrals (𝑀 HI,c ) as opposed to that within the entire halo (for example, see Fig. 7 and 10 of Chauhan et al. 2020). Characterising this large scatter of centrals with observations could provide important constraints for the physical models input into various galaxy formation simulations. In the past year, a few studies (Dutta et al. 2022;Korsaga et al. 2023;Hutchens et al. 2023) have surfaced that show the observed 𝑀 HI -𝑀 halo relation to have a very small scatter, at odds with what is found using simulations. This disagreement brings into question whether observation-based results are still biased due to selection effects, or simulation-based studies are using physical models that do not encapsulate the full complexity of baryon physics. To answer these questions, we investigate the scatter of the Hi-halo mass relation of centrals from the extended GALEX Arecibo SDSS survey (xGASS, Catinella et al. 2018). For the first time, we extend previous works into the gas-poor regime, using a sample that provides a fair representation of the range of 𝑀 HI,c that is observed in local central galaxies residing in halos of a wide mass range, 11.1 < log 10 (𝑀 halo /M ⊙ ) < 14.1.\nThis paper is structured as follows. Section 2 describes the xGASS 𝑀 HI catalogue, two group catalogues using different 𝑀 halo estimation techniques and the studies measuring secondary galaxy properties. The analysis on the shape and scatter of the Hi-halo mass relation of xGASS centrals is presented in section 3, where we also investigate the physical drivers of a central's position in this parameter space. In section 4, we compare our results to those found using previous observation-and simulation-based studies before summarising our study and its key outcomes in section 5. Throughout this study, we assume a Λ cold dark matter cosmology with Ω M = 0.3, Ω Λ = 0.7 and the dimensionless Hubble parameter, ℎ = 0.7 related to the Hubble constant, 𝐻 0 = 70 km s -1 Mpc -1 .", "publication_ref": ["b33", "b53", "b70", "b1", "b63", "b6", "b70", "b1", "b63", "b6", "b56", "b18", "b55", "b11", "b6", "b14", "b36", "b24"], "figure_ref": [], "table_ref": []}, {"heading": "DATA AND METHODOLOGY", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "xGASS", "text": "In this work, we use 𝑀 HI measurements, either detections or upper limits, from xGASS. This survey of 1179 galaxies is selected from the overlap between the Sloan Digital Sky Survey Data Release 7 (SDSS DR7, Abazajian et al. 2009) spectroscopic catalogue and the GALaxy Evolution eXplorer (GALEX, Martin et al. 2005) sky footprint. The selection of these xGASS galaxies is only based on stellar mass, 9 < log 10 (𝑀 * /M ⊙ ) < 11.5, and redshift, 0.01 < 𝑧 < 0.05. Moreover, the stellar mass (𝑀 * ) distribution of the observed galaxies is intentionally flat to improve statistics at the high 𝑀 * end (see Fig. 3 of Catinella et al. 2018). The galaxies were observed with Arecibo, a 305m single-dish radio telescope, until Hi was detected or an Hi gasfraction limit of ∼ 2% for galaxies with log 10 (𝑀 * /M ⊙ ) > 9.7 or a limit of log 10 (𝑀 HI /M ⊙ ) = 8 for galaxies with log 10 (𝑀 * /M ⊙ ) ≤ 9.7 was achieved. Thus, xGASS is largely gas-fraction limited and representative of not only Hi-rich but also Hi-poor galaxies. We use this survey as it is the most sensitive and representative Hi survey of the local Universe and, therefore, is ideal to study the positions of individual galaxies on the Hi-halo mass parameter space. The HIsrc flag in the xGASS catalogue is used to distinguish whether a galaxy has an 𝑀 HI detection or an upper limit. For Hi-undetected galaxies, the 𝑀 HI upper limits are estimated by assuming a flat flux of 5 times the spectral noise across a velocity width of 200 km s -1 or 300 km s -1 depending on 𝑀 * (for details see Catinella et al. 2018).", "publication_ref": ["b0", "b44", "b4", "b4"], "figure_ref": ["fig_3"], "table_ref": []}, {"heading": "Group catalogues", "text": "For 1155 of the catalogued galaxies, the xGASS team provides environment metrics from the Yang et al. (2007, hereafter Y07) group 'B' catalogue (for details see Janowiecki et al. 2017). Y07 produced the group catalogue using a halo-based group finder on spectroscopic redshifts, mainly acquired from SDSS DR7. From this Y07 group catalogue, Janowiecki et al. (2017) removed smaller counterparts of a shredded galaxy on the basis of the galaxies' separation from each other. After matching to this shredding-corrected group catalogue, an environment code (env_code_B), the total number of galaxy members in the host group (𝑁 gal ) and, where available, 𝑀 halo values are provided for each xGASS galaxy. 24 xGASS galaxies do not have matches with the Y07 group catalogue due to their close proximity to either bright stars or survey edges. In Y07, 𝑀 halo values are derived using an abundance-matching technique based on 𝑀 * and only provided for massive halos with log 10 (𝑀 halo /M ⊙ ) ≥ 11.5. For 343 xGASS centrals in less massive halos, we estimate 𝑀 halo by using a conditional stellar mass function (CSMF; see model 6 in the Table 3 of Yang et al. 2012), which gives the stellar mass of a central (𝑀 * ,c ) as a function of its host's 𝑀 halo . We correct this CSMF to the Hubble parameter used by xGASS, ℎ = 0.7, and translate it to fit the 197 group centrals with catalogued 𝑀 * and abundance-matching 𝑀 halo values. We run this CSMF, given by equation 1, as an estimator to find the value of 𝑀 halo that returns the 𝑀 * ,c of a given central. \nThere are various uncertainties involved in the estimation of 𝑀 halo based on the method used by Y07. Thus, to confirm the results of our study we also use dynamical 𝑀 halo estimates from the Saulder et al. (2016, hereafter S16) SDSS Data Release 12 (DR12) group catalogue. S16 produced the group catalogue using a friends-of-friends based group finder that is optimised to account for observational biases in SDSS using mock catalogues from the Millennium simulation (Springel et al. 2005). The dynamical 𝑀 halo is derived for each group depending on 𝑁 gal . For galaxies in groups with 𝑁 gal ≥ 5, 𝑀 halo is derived from a function of the group's total luminosity (𝐿 tot ), luminosity distance (𝐷 L ), velocity dispersion (𝜎 group ), radius (𝑅 group ) and member galaxies detected in SDSS DR12 (𝑁 fof ). For smaller groups with 2 ≤ 𝑁 gal ≤ 4, 𝑀 halo is derived from a function of 𝐿 tot , 𝐷 L , 𝜎 group and 𝑅 group . For isolated galaxies, 𝑀 halo is derived from a function of 𝐿 tot and 𝐷 L alone (see section 3.4.7 of S16, for detailed equations and descriptions). We assign an environment code (rank_Mstar) to all galaxies in the S16 group catalogue by ranking those with the same group ID according to their 𝑀 * value. We define a central as the galaxy with the highest 𝑀 * within a group. Next, we perform a positional cross-match between the xGASS catalogue and the galaxy list of the group catalogue (Table A.7. of S16). Since both xGASS and the S16 group catalogue use right ascension and declination values from SDSS, we set a small 3 arcsec match radius. We acquire 1160 matched galaxies and find that the 19 unmatched galaxies are in close proximity to bright stars or survey edges. To recover the 𝑀 halo and 𝑁 gal group properties, we match the group IDs between the group list and the galaxy list of the group catalogue (Table A.2. and A.7. of S16,respectively). Isolated galaxies are defined as the ones in groups with 𝑁 gal = 1.", "publication_ref": ["b26", "b26", "b76", "b64"], "figure_ref": [], "table_ref": []}, {"heading": "Galaxy properties", "text": "We use the following galaxy properties to study the drivers of the scatter of the Hi-halo mass relation.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Stellar mass:", "text": "The xGASS catalogue provides 𝑀 * estimates for every galaxy. These 𝑀 * values are obtained from the value-added SDSS DR7 catalogue of the Max Planck Institute for Astrophysics/Johns Hopkins University, assuming the initial mass function from Chabrier (2003).\nStar-formation rate: Star-formation rate (SFR) estimates are provided for 1171 galaxies in the xGASS catalogue. SFR is calculated by combining near-ultraviolet (NUV) magnitudes from GALEX and 22 𝜇m and/or 12 𝜇m mid-infrared (MIR) magnitudes measured from the Wide-field Infrared Survey Explorer (WISE, Wright et al. 2010) images. Where NUV or MIR fluxes are not available, SFR is estimated using spectral energy distribution fits from Wang et al. (2011) (for details see Janowiecki et al. 2017). We calculate ΔMS (deviations from the SFMS) to acquire a quantification of the star-formation activity that is independent of 𝑀 * . For the subset of xGASS galaxies with catalogued SFR values, ΔMS is estimated by calculating specific SFR and using the xGASS SFMS fit (equation 2 of Catinella et al. 2018). We use a threshold of ΔMS = -0.5 to separate star-forming galaxies (ΔMS > -0.5) from galaxies below the SFMS (ΔMS ≤ -0.5, or passive).", "publication_ref": ["b5", "b73", "b72", "b26", "b4"], "figure_ref": [], "table_ref": []}, {"heading": "Stellar-concentration index:", "text": "The xGASS catalogue provides stellar-concentration indices (𝐶 𝑖 ) for every galaxy. 𝐶 𝑖 is calculated by dividing the radius containing 90% of the flux, 𝑅 90 , by the radius containing 50% of the flux, 𝑅 50 . 𝑅 90 and 𝑅 50 are measured in arcsec, provided in the SDSS DR7 database and based on Petrosian fluxes in the 𝑟 band. We define the galaxies with 𝐶 𝑖 < 2.6 as 'disc-dominated systems' and those with 𝐶 𝑖 ≥ 2.6 as 'high stellar-concentration systems'.\nStellar specific angular momentum: Hardwick et al. (2022a) provide stellar specific angular momentum ( 𝑗 * ) estimates for 564 xGASS Hi-detected galaxies of inclinations, 𝑖 > 30 • . 𝑗 * is calculated within an aperture of 10 times the 𝑟-band half-light radius of the disc (provided by Cook et al. 2019). These calculations assume that the galaxy's rotational velocity is constant and set by the Hi profile width, therefore, assuming that the stars are co-rotating with the Hi and the bulge is co-rotating with the disc. Any assumptions made do not affect the 𝑗 * estimates by more than 0.1 dex (for details, refer to Hardwick et al. 2022a).", "publication_ref": ["b8"], "figure_ref": [], "table_ref": []}, {"heading": "The final sample", "text": "Before the last step of our sample selection, we remove the 'confused' galaxies that are affected by the presence of more dominant sources of Hi emission within the same ∼ 3.5 arcmin Arecibo beam. For Hi-detected galaxies (i.e. those with the xGASS flag, HIsrc < 4), confused galaxies are indicated in the xGASS catalogue by an Hi quality flag of HI_FLAG ≥ 3. We first remove these confused galaxies and then select centrals using the environment code (env_code_B > 0 or rank_Mstar > 0). For Hi-undetected galaxies, HI_FLAG is not provided and centrals are selected based on their environment code alone. Table 1 summarises the statistics of our final sample of centrals based on their environmental and Hi-detection properties. Table 1 also lists the statistics in the 'ΔMS sub-samples' (i.e. xGASS centrals with SFR estimates) and the ' 𝑗 * sub-samples' (i.e. xGASS centrals with 𝑗 * estimates). In this paper, 'centrals' refers to the combination of isolated galaxies and group centrals.", "publication_ref": [], "figure_ref": [], "table_ref": ["tab_0", "tab_0"]}, {"heading": "RESULTS", "text": "We present the results of our study in this section. The strength of the correlation between two parameters is quantified by calculating the Spearman's rank correlation coefficient (𝜌 S ), which is only considered significant and stated if it has a 𝑝-value < 0.03.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "The median Hi-halo mass relation of xGASS centrals", "text": "Fig. 1 a and b display the Hi-halo mass parameter space with the xGASS centrals matched to the Y07 and S16 group catalogues respectively. The points are categorised by the environmental and Hi detection properties of the centrals. It is clear that our sample is dominated by Hi-detected, isolated galaxies where log 10 (𝑀 halo /M ⊙ ) < 12.5(12.3) and Hi-undetected, group centrals where log 10 (𝑀 halo /M ⊙ ) ≥ 12.7(12.9) in Fig. 1a (Fig. 1b). We note that the sample in Fig. 1a, as opposed to that in Fig. 1b, has a higher fraction of isolated galaxies, i.e. 70% and 56% respectively.\nTo estimate the median Hi-halo mass relation and quantify the variance of its scatter, we bin our sample of centrals by the 𝑀 halo values of their host halos, and calculate the median 𝑀 HI,c for each bin. Throughout this paper, we use fixed bin widths of 0.2 dex. However, if the counts are < 10, we set a wider bin width to ensure good statistics. For each 𝑀 halo bin, Table 2 lists the 𝑀 halo limits, galaxy counts (𝑁) and the median 𝑀 HI,c value. We prefer to use medians (rather than averages) because these are not affected by the nondetections, as long as the median value itself is a detection. Table 2 also provides the scatter, quantified as the 16th-84th percentile of the 𝑀 HI,c distribution in that bin. The uncertainties of the median 𝑀 HI,c values are determined via bootstrapping, generating 100,000 random samples for each bin of halo mass. Note, that if the median 𝑀 HI,c value is consistent Hi-undetected centrals, we show it as an upper limit. Similarly, to highlight the parameter space that is unconstrained by our data, the percentile values are only shown if the percentile is consistent with Hi-detected centrals. Median Hi-halo mass relations are modelled by fitting a third order polynomial to the mid 𝑀 halo and median 𝑀 HI,c values of each bin. This median model is given by,\n𝑀 HI,c = 0.08𝑀 3 halo -3.00𝑀 2 halo + 38.41𝑀 halo -154.50,(2)\nfor the centrals matched to the Y07 group catalogue and by,\n𝑀 HI,c = 0.20𝑀 3 halo -7.59𝑀 2 halo + 98.10𝑀 halo -412.29,(3)\nfor the centrals matched to the S16 group catalogue. We find consistent medians and scatter in Fig. 1 a and b, despite the different 𝑀 halo estimation methods used. For log 10 (𝑀 halo /M ⊙ ) < 12.7, there is a large scatter of 𝑀 HI,c values between 0.8-1.3 dex and the medians appear approximately constant at log 10 (𝑀 HI,c /M ⊙ ) ≈ 9.40. At higher 𝑀 halo values, the medians are dominated by Hiundetected centrals, meaning that the scatter of the relation is either similar to that observed at lower 𝑀 halo values or, most likely, larger. In the next subsection we explore if there is a physical reason behind such a significant scatter of the relation.", "publication_ref": [], "figure_ref": ["fig_1", "fig_1", "fig_1", "fig_1", "fig_1", "fig_1"], "table_ref": ["tab_1", "tab_1"]}, {"heading": "The scatter along the median Hi-halo mass relation", "text": "In this section, we investigate which galaxy property correlates with the scatter of the Hi-halo mass relation. Stellar, kinematic and environmental properties of a galaxy are known to correlate with its cold-gas properties (e.g. Oosterloo et al. 2010;Odekon et al. 2016;Janowiecki et al. 2017;Stevens et al. 2019;Janowiecki et al. 2020;Li et al. 2022;Saintonge & Catinella 2022;Cortese et al. 2021). To identify physical properties that might be driving the scatter, we  investigated all the observables available for the xGASS sample. These include 𝑁 gal , 𝑀 * , SFR, specific SFR, ΔMS, 𝐶 𝑖 , bulge-to-total ratios of both 𝑀 * and light in the 𝑔, 𝑟 and 𝑖 bands and stellar and baryonic specific angular momenta of both the overall galaxy and its disc component alone. Of these, ΔMS, 𝐶 𝑖 and 𝑗 * , which trace the degree of star-formation activity, stellar structure and stellar kinematics respectively, show the strongest trends with the scatter. Therefore, hereafter we focus on these three parameters and show related results for the xGASS centrals matched to the Y07 group catalogue in Fig. 2. The left column shows the Hi-halo mass parameter space with points colour-coded by either ΔMS (panel a), 𝐶 𝑖 (panel c) or 𝑗 * (panel e). The corresponding right column shows the correlation of these galaxy properties with the central's deviation from the median model relation (Δ𝑀 HI ), where the points are colour-coded by their respective 𝑀 halo values. Note that we repeat our analysis from this section on the xGASS centrals matched to the S16 group catalogue and find consistent results (see Fig. A1 for details). Since our results do not vary significantly when using the different group catalogues, hereafter we focus on the results from using the Y07 group catalogue \n[M ⊙ ] [M ⊙ ] [M ⊙ ]\nxGASS centrals matched to the Y07 group catalogue (Fig. 1a)\nand present equivalent figures from using the S16 group catalogue in appendix A.", "publication_ref": ["b52", "b51", "b26", "b65", "b27", "b40", "b56", "b9"], "figure_ref": ["fig_2", "fig_7", "fig_1"], "table_ref": []}, {"heading": "Position relative to the star-forming main-sequence", "text": "Given the link between Hi and star formation, we can expect to find that the position of centrals in the Hi-halo mass parameter space correlates with their position relative to the SFMS. The first row of Fig. 2 shows that, at a fixed 𝑀 halo , higher 𝑀 HI,c corresponds to higher ΔMS and vice versa. This means that, not surprisingly, the scatter of the Hi-halo mass relation varies with ΔMS. This is quantitatively shown in the right panel, where a 𝜌 S = 0.53 indicates a significant correlation between Δ𝑀 HI and ΔMS.\nInterestingly, in Fig. 2b, we see a secondary dependence of the scatter on 𝑀 halo , where Δ𝑀 HI values are higher for centrals in host halos of higher 𝑀 halo and vice versa. This is because starforming centrals have a significant positive Hi-halo mass correlation (𝜌 S = 0.54) and, while they dominate at the low 𝑀 halo end (log 10 (𝑀 halo /M ⊙ ) < 12.7), their importance in driving the median trend decreases with increasing 𝑀 halo . In other words, star-forming centrals move away from the flat median Hi-halo mass relation as 𝑀 halo increases. Conversely, the passive centrals represent the typical galaxy (Δ𝑀 HI = 0) at the higher 𝑀 halo end, but lie significantly below the median at lower 𝑀 halo values. This suggests that different populations drive the Hi-halo mass relation at different 𝑀 halo , indi-cating that just computing medians might be reductive and not very informative, as in the case of the SFR-𝑀 * relation. We expand on this point in section 4.\nWhile a high correlation between ΔMS and Δ𝑀 HI is found, this cannot be interpreted as SFR driving the Hi mass in centrals. Indeed, if anything, the amount of cold gas in a galaxy regulates the amount of star formation (Schmidt 1959(Schmidt , 1963;;Kennicutt 1989Kennicutt , 1998)). Thus, in panels c-f, we investigate other galaxy properties that may be driving the scatter of the Hi-halo mass relation.", "publication_ref": ["b61", "b62", "b30", "b31"], "figure_ref": ["fig_2", "fig_2"], "table_ref": []}, {"heading": "Stellar-concentration index", "text": "It is largely understood that the majority of Hi lies in the discs of galaxies (e.g. Kerr 1977;Knapp 1987) as the rotational support in discs allows the gas to be stable against collapse. While direct measurements of galaxy kinematics are difficult to acquire for a large sample of galaxies, proxies for galaxy structure are more readily available. In this subsection, we look at one such proxy of structure: light-concentration in the 𝑟 band.\nThe second row of Fig. 2 shows that the scatter follows similar trends with 𝐶 𝑖 as it does with ΔMS, but with a weaker correlation, 𝜌 S = -0.32. At a fixed 𝑀 halo , the disc-dominated centrals tend to be more Hi-rich than the high stellar-concentration centrals. The secondary dependence on 𝑀 halo is also seen here, with high stellar-concentration centrals lying below the relation at low 𝑀 halo values, but on the relation in the highest 𝑀 halo bin. If we focus only on the disc-dominated centrals, 𝑀 HI,c and 𝑀 halo show a moderate correlation (𝜌 S = 0.46).\nWe repeat this analysis with the bulge-to-total ratios (𝐵/𝑇) presented in Cook et al. (2019) for xGASS galaxies. However, we find that the majority of Hi-detected centrals are pure discs and assigned 𝐵/𝑇 = 0 and those centrals with 𝐵/𝑇 > 0 are dominated by 𝑀 HI,c upper limits. This low dynamic range of 𝐵/𝑇 for pure-discs in combination with observational limitations towards bulge-dominated systems makes it difficult to study the scatter's dependence on 𝐵/𝑇. In comparison, 𝐶 𝑖 has a higher dynamic range for pure-discs, depending on the compactness of their stellar component, being an estimate of the steepness of their light profiles. However, 𝐶 𝑖 is not robust against all biases (e.g. edge-on spirals can be mistaken for early-type systems, see Strateva et al. 2001;Masters et al. 2010) and only has a weak correlation with Δ𝑀 HI .", "publication_ref": ["b32", "b34", "b8", "b66", "b45"], "figure_ref": ["fig_2"], "table_ref": []}, {"heading": "Stellar specific angular momentum", "text": "In this subsection, we explore the kinematic state of the subset of 427 xGASS centrals with values of 𝑗 * available. Overall, the trends are the same as those found with ΔMS and 𝐶 𝑖 , but the correlations appear somewhat stronger, as shown in the bottom row of Fig. 2. 𝑗 * and Δ𝑀 HI have a high correlation coefficient, 𝜌 S = 0.55, and the secondary dependence on 𝑀 halo appears more clearly defined: i.e. 𝑀 HI,c of the 𝑗 * sub-sample increases with 𝑀 halo , gradually deviating further from the flat median Hi-halo mass relation.\nIt is important to note that we focus on 𝑗 * in this study, even though Δ𝑀 HI shows a significantly higher correlation with baryonic specific angular momentum ( 𝑗 b ; provided by Hardwick et al. 2022b). The way Hardwick et al. (2022b) estimated 𝑗 b , makes it strongly correlated with 𝑀 HI (𝜌 S = 0.89) by construction, so any correlation may just be indicative of the bias in its estimation method. Conversely, 𝑗 * has no built-in correlation with 𝑀 HI . Thus, 𝑗 * is a more reliable avenue to investigate the role of specific angular momentum in driving the scatter of the Hi-halo mass relation. Lastly, before concluding that specific angular momentum may be the primary driver of the scatter of the Hi-halo mass relation, we note that the analysis based on 𝑗 * only uses a sub-sample of the all the xGASS centrals, limited to Hi-detected galaxies of 𝑖 > 30 • . Therefore, we must re-check the correlation of the scatter with the three galaxy properties tested in this section, using the same subsample of centrals (i.e. those catalogued with both ΔMS and 𝑗 * values). Doing so, we find the correlation of Δ𝑀 HI is 𝜌 S = 0.55(0.50) with 𝑗 * , 𝜌 S = 0.25(0.21) with ΔMS and insignificant (𝜌 S = -0.12) with 𝐶 𝑖 , for the selected sub-sample of centrals matched to the Y07 (S16) group catalogue. Thus, we conclude that the scatter of the Hi-halo mass relation shows the strongest correlation with specific angular momentum.", "publication_ref": [], "figure_ref": ["fig_2"], "table_ref": []}, {"heading": "DISCUSSION", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "The median Hi-halo mass relation", "text": "The median Hi-halo mass relation of xGASS centrals is flat at log 10 (𝑀 HI,c /M ⊙ ) ≈ 9.40. For log 10 (𝑀 halo /M ⊙ ) < 12.7, the median is a rotation-supported, star-forming and disc-dominated central, which tends to be Hi-detected and isolated. At higher 𝑀 halo values, the median is a low angular momentum, passive and high stellarconcentration central, which tends to be Hi-undetected and lies in groups (𝑁 gal > 1). Therefore, at the low 𝑀 halo end, the Hi-rich centrals are dominant and drive the medians up whereas, at the high 𝑀 halo end, the Hi-poor centrals are dominant and drive the medians down (to the detection limit). This switch in dominance of centrals of different properties leads to the flat median Hi-halo mass relation when median 𝑀 HI,c values are calculated across the entire sample of xGASS centrals, without binning by their secondary properties (see Fig. 3 for visual aid). This dependence of a scaling relation's slope on the underlying galaxy bi-modality is also seen in the Hi gas fraction-𝑀 * relation, where the slope arises because two different galaxy populations dominate at the two 𝑀 * ends (Brown et al. 2015).\nA flat median relation is an incomplete representation of the distribution of centrals in the Hi-halo mass parameter space. The starforming xGASS centrals, which tend to be rotation-supported, discdominated and isolated, showcase a high and positive correlation (𝜌 S > 0.5) between 𝑀 HI,c and 𝑀 halo , indicative of an increasing Hi-halo mass relation (shown in Fig. 4). These centrals also showcase a positive trend between Δ𝑀 HI and 𝑀 halo , i.e. as their host halo mass increases they move further away from the flat median relation. This is reminiscent of the distribution of galaxies on the SFR-𝑀 * parameter space (e.g. Brinchmann et al. 2004;Elbaz et al. 2007;Noeske et al. 2007;Salim et al. 2007;Peng et al. 2010), where there are multiple galaxy populations and, if we fit a median trend across all galaxies, we would not be able to isolate the SFMS from the passive population (e.g. Saintonge et al. 2017;Catinella et al. 2018;Janowiecki et al. 2020).\nIn a recent study, Korsaga et al. (2023) looked at the Hi masses of 150 isolated galaxies with extended discs and 𝑖 > 30 • from the Spitzer Photometry and Accurate Rotation Curves (SPARC; Lelli et al. 2016) survey and Local Irregulars That Trace Luminosity Extremes, The Hi Nearby Galaxy Survey (LITTLE THiNGS; Hunter et al. 2012) and measured their host halo masses between 9.4 < log 10 (𝑀 halo /M ⊙ ) < 12.5 from rotation curves. For galaxies spanning 4 orders of magnitude in 𝑀 * , they found an increasing Hihalo mass relation and a universal Hi-halo mass ratio, indicative of possible mass-independent self-regulation mechanisms. In another recent study, Dutta et al. (2022) studied Hi-detected galaxies from the SPARC sample and 40% of the Arecibo Legacy Fast Arecibo L-band Feed Array (ALFALFA; Haynes et al. 2011) survey area. Dutta et al. (2022) treated all galaxies as isolated and estimated their host halo masses, between 9.4 < log 10 (𝑀 halo /M ⊙ ) < 12.9, by abundance-matching the Hi mass function with an Hi-selected halo mass function. Doing so, they too recovered an increasing Hi-halo mass scaling relation with the functional form of a double power-law.\nIn Fig. 4 (Fig. A2), we compare the median Hi-halo mass relation of xGASS centrals matched to the Y07 (S16) group catalogue with the scaling relations presented in Dutta et al. (2022) and Korsaga et al. (2023). In comparison to the xGASS medians, both scaling relations have on average 0.6-0.7 dex higher 𝑀 HI,c values. If we restrict the xGASS sample to star-forming galaxies, we recover a similar positive slope but with a negative offset of 0.3-0.5 dex from these published scaling relations. This is not surprising given that both Dutta et al. (2022) and Korsaga et al. (2023) used samples that are more biased towards Hi-rich galaxies than xGASS. Thus, our results, while confirming that 𝑀 HI,c monotonically increases with 𝑀 halo for star-forming centrals, highlight that it is challenging to accurately quantify the shape of the Hi-halo mass relation using only Hi-selected samples. In the next subsection, we compare our findings to those of other observational studies that use spectral stacking methods on optically-selected samples.", "publication_ref": ["b3", "b2", "b15", "b50", "b58", "b54", "b57", "b4", "b27", "b36", "b39", "b23", "b14", "b21", "b14", "b14", "b36", "b14", "b36"], "figure_ref": ["fig_3", "fig_4", "fig_4", "fig_8"], "table_ref": []}, {"heading": "Comparison with stacking results", "text": "In Fig. 5 (Fig. A3), we compare the average Hi-halo mass relation of xGASS centrals matched to the Y07 (S16) group catalogue with those found in spectral stacking studies of Guo et al. (2020) and Rhee et al. (2023). Guo et al. (2020) used the Lim et al. (2017) group catalogue to stack ALFALFA centrals, and measured the average 𝑀 HI,c values within a fixed aperture of diameter 200 kpc and velocity width 600 km s -1 centred on the central. Rhee et al. (2023) used the Galaxy And Mass Assembly (GAMA) group catalogue (Driver et al. 2022) to stack centrals in the Deep Investigation of Neutral Gas Origins (DINGO, Meyer 2009) survey, and measured the average 𝑀 HI,c values within a 49 kpc square aperture and 300 km s -1 velocity width centred on the central.\nHere, we work with linear averages instead of medians to make fair comparisons between the xGASS data and the stacked relations. Given that averages are more affected by non-detections than medians, we present two extremes for our average relation, estimated by setting non-detections to either 0 or their upper limit. We shade between these lowest and highest averages and define this shaded area as the average Hi-halo mass relation of xGASS centrals. As is evident, the Hi-undetected centrals have a limited impact on our average relation.\nThe Hi-halo mass relation of centrals from Guo et al. ( 2020) agrees reasonably well with the xGASS averages, with an offset within 0.3 dex towards systematically lower 𝑀 HI,c . The Hi-halo mass relation of centrals from Rhee et al. (2023) is significantly flatter than the xGASS averages. The averages of Rhee et al. (2023) have a positive offset for log 10 (𝑀 halo /M ⊙ ) < 12 because they only stack group centrals (𝑁 gal ≥ 2) that, in this 𝑀 halo range, showcase flatter averages in both our sample and that of Guo et al. (2020). The averages of Rhee et al. (2023) have a negative offset for 12 < log 10 (𝑀 halo /M ⊙ ) < 13.5 because their sample does not include the Hi-rich isolated galaxies and, in this 𝑀 halo range, is more greatly dominated by the Hi-poor red centrals in comparison to the xGASS sample. Curiously, the relation from Rhee et al. (2023) is in line with our median relation for log 10 (𝑀 halo /M ⊙ ) > 11.5, however, we consider this to be just a  coincidence given that it is meaningless to compare stacking results with median trends. ", "publication_ref": ["b18", "b55", "b18", "b41", "b55", "b13", "b55", "b55", "b18", "b55", "b55"], "figure_ref": ["fig_5", "fig_9"], "table_ref": []}, {"heading": "Comparison with simulations", "text": "The scatter of the Hi-halo mass relation shows a correlation with ΔMS, 𝐶 𝑖 and 𝑗 * properties of centrals. Of all these secondary properties, Δ𝑀 HI most strongly correlates (𝜌 S ≥ 0.5) with specific angular momentum. This strong correlation is consistent with the dependence between 𝑀 HI and specific angular momentum seen in baryonic Fall relations (e.g. Murugeshan et al. 2020;Mancera Piña et al. 2021a,b;Hardwick et al. 2022b) and suggests that, at fixed 𝑀 halo , the kinematic state of a central may be key in driving the amount of atomic gas available for star formation. This is also confirmed by the positive correlation we recover between 𝑀 HI,c and 𝑀 halo of rotation-supported and/or star-forming centrals. Given the positive Hi-halo mass correlation of rotation-supported isolated galaxies and the potentially large scatter driven by passive group centrals, it is tempting to speculate that the scatter of the Hi-halo mass relation is driven by the host halo formation history. This would be in line with the results from previous works that use (semi-)analytical models (e.g. Guo et al. 2017;Chauhan et al. 2020). As such, it is interesting to see how our results compare with predictions from cosmological simulations. Baugh et al. (2019), Spinelli et al. (2020) and Chauhan et al. ( 2020) modelled the median Hi-halo mass relation of centrals using different semi-analytical models (SAMs) of galaxy formation: GALFORM (Lacey et al. 2016), GAlaxy Evolution and Assembly (GAEA, De Lucia et al. 2014;Hirschmann et al. 2016;Xie et al. 2017;Zoldan et al. 2017) and SHARK (Lagos et al. 2018) respectively. In Fig. 6 (Fig. A4), we compare the medians of xGASS centrals matched to the Y07 (S16) group catalogue with the median relations from the three different SAMs. Although the 16th-84th percentile scatter of GALFORM and SHARK centrals is not published, from comparing the medians it appears that GALFORM and SHARK predominantly produce centrals that are populated with less Hi than that observed with xGASS between 11.4 < log 10 (𝑀 halo /M ⊙ ) < 12.7 and 11.9 < log 10 (𝑀 halo /M ⊙ ) < 12.7 respectively. This is most likely due to a prescription of the AGN feedback that removes too much gas in large halos. On the other hand, GAEA is more in line with the xGASS results, with consistent scatter and a systematic offset of ∼ 0.4 dex towards higher median 𝑀 HI,c (see Fig. B1 in Spinelli et al. 2020, for details of the 16th-84th percentile scatter of GAEA centrals). This demonstrates the potential of xGASS to provide tighter constraints to models, with particular emphasis on AGN feedback prescriptions.\nIt is important to acknowledge that some of the differences between xGASS and the predictions of theoretical models may also stem from the differences in the definition of central galaxies, combined with the challenge associated with accurately measuring halo masses from observations. Our use of two independent group catalogues offers some insights into these observational uncertainties (see Fig. 6 and Fig. A4). Moreover, Chauhan et al. (2021) show how the variations in the definition of centrals may impact the exact quantification of 𝑀 HI,c at fixed 𝑀 halo . However, it is extremely unlikely that the substantial differences between the results from xGASS and predictions from GALFORM/SHARK can be solely attributed to the disparity in the definition of centrals. Of course, the situation is different if a simulation estimates 𝑀 HI,c by taking into account the Hi associated with the entire central sub-halo, as done for example in Villaescusa-Navarro et al. (2018) with IllustrisTNG, a cosmological magneto-hydro-dynamical simulation. In that case, a comparison with xGASS is completely meaningless and indeed the IllustrisTNG relation (not shown) is systematically offset towards higher Hi masses.\nBesides studying the shape of the Hi-halo mass relation of centrals, Chauhan et al. (2020) also investigated the physical properties driving its scatter. They find a significant scatter, which is linked to the halo spin parameter (𝜆) for log 10 (𝑀 halo /M ⊙ ) < 11.5. In their 'transition region', 11.5 < log 10 (𝑀 halo /M ⊙ ) < 12.5, the scatter depends on both 𝜆 and the black hole-to-stellar mass ratio of the central galaxy (𝑀 BH,c /𝑀 * ,𝑐 ): i.e. centrals in host halos of high 𝜆 and with low 𝑀 BH,c /𝑀 * ,𝑐 are Hi-rich and centrals in host halos of low 𝜆 and with high 𝑀 BH,c /𝑀 * ,𝑐 are Hi-poor (for details see Fig. 10 and 11 of Chauhan et al. 2020). Finally, for log 10 (𝑀 halo /M ⊙ ) > 12.5, the high 𝑀 BH,c /𝑀 * ,𝑐 washes out the effect of 𝜆. Overall, they find that centrals in host halos of high 𝜆 have an increasing Hi-halo mass relation where log 10 (𝑀 halo /M ⊙ ) < 12.5. While 𝜆 and the specific angular momentum of a central can be very different in reality, SHARK assumes that the dark matter and gas follow the same specific angular momentum and that the central and halo have aligned specific angular momenta. Therefore, in low mass halos, where the main contribution of Hi is from the centrals, Chauhan et al. (2020) found the relation between 𝑀 HI and 𝜆 to be a reflection of that between 𝑀 HI and the central's specific angular momentum. Despite the mismatch in median relations, these findings from Chauhan et al. ( 2020) are qualitatively consistent with our results that, for centrals, the scatter of the Hi-halo mass relation has a strong correlation with specific angular momentum and that, for rotation-supported centrals, the 𝑀 HI,c increases with 𝑀 halo . However, our study cannot test if the correlation with specific angular momentum washes out at high 𝑀 halo due to high 𝑀 BH,c /𝑀 * ,𝑐 , since we do not have measurements of 𝑗 * for Hi-undetected centrals, which dominate at the high 𝑀 halo end.", "publication_ref": ["b48", "b17", "b6", "b1", "b63", "b37", "b22", "b74", "b77", "b38", "b63", "b7", "b70", "b6", "b6", "b6"], "figure_ref": ["fig_6", "fig_10", "fig_1", "fig_6", "fig_10", "fig_1"], "table_ref": []}, {"heading": "CONCLUSIONS", "text": "We use the xGASS 𝑀 HI catalogue and the Y07 group catalogue to study the scatter of the Hi-halo mass relation of 764 centrals. Our derived median Hi-halo mass relation is flat at log 10 (𝑀 HI,c /M ⊙ ) ≈ 9.40 across halo masses, 11.1 < log 10 (𝑀 halo /M ⊙ ) < 14.1, consistent with the low correlation, 𝜌 S < 0.3, found between 𝑀 HI,c and 𝑀 halo . We find that this flat Hi-halo mass relation arises from the combination of two different population of centrals dominating statistics at the opposite ends of the 𝑀 halo distribution. Our medians are fully constrained by the data up to log 10 (𝑀 halo /M ⊙ ) < 12.7, after which 𝑀 HI,c upper limits dominate the median relation. Our results do not change significantly when, instead of the abundancematching estimates from Y07, we use dynamical 𝑀 halo estimates from S16 to conduct the same analysis. This confirms that our study is robust against disagreements between different 𝑀 halo estimation methods.\nWe investigate the drivers of the scatter of the Hi-halo mass relation by studying secondary galaxy and halo properties. We find a correlation of the scatter with the ΔMS, 𝐶 𝑖 , 𝑗 * properties of the centrals. The scatter most strongly correlates with ΔMS and 𝑗 * , with a high correlation coefficient, 𝜌 S ≥ 0.5, between them and Δ𝑀 HI . Altogether, the typical galaxy represented by our flat median Hi-halo mass relation becomes more passive, centrally concentrated in stellar structure and dispersion-supported as 𝑀 halo increases. These flat medians fail to showcase that the star-forming, disc-dominated and rotation-supported isolated galaxies in host halos of high masses tend to be Hi-rich. This is reminiscent of the distribution of galaxies on the SFR-𝑀 * plane, suggesting that simple median or average relations may not be a complete representation of all centrals in the Hi-halo mass parameter space, especially at the high 𝑀 halo end.\nWhen making comparisons with previous observation-based studies that use spectral stacking techniques, we find consistent results as the average Hi-halo mass relations found by Guo et al. (2020), but we see a small tension with the result of Rhee et al. (2023), who found a flatter average relation. To further understand the true scatter while taking advantage of the improved number statistics enabled by the spectral stacking studies, we advise that centrals are also binned by their secondary properties (related to their kinematic state) before their spectra are co-added.\nWhen comparing xGASS with cosmological simulations, we find that GALFORM and SHARK semi-analytical models predict extremely Hi-poor centrals in host halos above log 10 (𝑀 halo /M ⊙ ) ∼ 12.3. We speculate that this is primarily an issue with the AGN feedback prescription in these models. Conversely, among the models tested in this paper, GAEA shows the least tension with our results, with a relatively mild systematic offset towards higher 𝑀 HI,c values (∼ 0.4 dex) across the entire range of 𝑀 halo values investigated here.\nWe note that our study is limited at the high 𝑀 halo end, log 10 (𝑀 halo /M ⊙ ) ≥ 12.7, where Hi-undetected centrals start dominating. Our study can be improved with follow-up surveys or targeted searches, conducted with the new and state-of-the-art radio telescopes such as the Five hundred meter Aperture Spherical Telescope (Nan et al. 2011) and the Square Kilometre Array (Dewdney et al. 2009) and its precursors (Johnston et al. 2008;Jonas 2009;Koribalski et al. 2020;Rhee et al. 2023). Observations from such surveys would not only have better resolution, enabling studies that use rotation curves to empirically measure 𝑀 halo (e.g. Korsaga et al. 2023) and galaxy kinematics (e.g. Fall & Romanowsky 2018;Mancera Piña et al. 2021a), but also better sensitivity, improving the number statistics. Targeted Hi searches may also be able to provide 𝑀 HI,c detections or upper limits of centrals in very high mass halos, i.e. log 10 (𝑀 halo /M ⊙ ) > 13.5, where our study has only one wide 𝑀 halo bin and beyond which only a handful of observations exist (e.g. Mc-Namara et al. 1990;Jaffe 1990;Taylor 1996;Taylor et al. 1999;Véron-Cetty et al. 2000;Struve et al. 2010;Saraf et al. 2023).    ", "publication_ref": ["b18", "b55", "b49", "b12", "b28", "b29", "b35", "b55", "b36", "b16", "b25", "b68", "b69", "b71", "b67", "b59"], "figure_ref": [], "table_ref": []}, {"heading": "DATA AVAILABILITY", "text": "The xGASS catalogues used in this work are publicly available at xgass.icrar.org/data.html. Bulge-disc decomposition's from Cook et al. (2019), and the matched catalogue between xGASS and S16 with our assigned environmental codes can be made available upon direct request to the authors.", "publication_ref": ["b8"], "figure_ref": [], "table_ref": []}, {"heading": "AUTHOR CONTRIBUTION STATEMENT", "text": "LC devised this project. MS lead the data analysis and drafted the manuscript with advice from LC and OIW. BC led the xGASS team that observed the data. SJ provided the matched group catalogues. JAH provided the specific angular momentum estimates. MS and LC are responsible for the interpretation of the results into the discussion. All authors provided constructive comments that improved this manuscript.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "APPENDIX A: DYNAMICAL HALO MASS ESTIMATES", "text": "Fig. A1, A2, A3 and A4 are the same as Fig. 2,4, 5 and 6 respectively, but present the results for the xGASS centrals matched to the S16 group catalogue. Overall, the results do not change significantly between the two group catalogues and, thus, are found to be robust against variances between the abundance-matching and dynamical 𝑀 halo estimation techniques.", "publication_ref": [], "figure_ref": [], "table_ref": []}], "references": [{"ref_id": "b0", "title": "", "journal": "The Astrophysical Journal Supplement Series", "year": "2009", "authors": "K N References Abazajian"}, {"ref_id": "b1", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2019", "authors": "C M Baugh"}, {"ref_id": "b2", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2004", "authors": "J Brinchmann; S Charlot; S D M White; C Tremonti; G Kauffmann; T Heckman; J Brinkmann"}, {"ref_id": "b3", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2015", "authors": "T Brown; B Catinella; L Cortese; V Kilborn; M P Haynes; R Giovanelli"}, {"ref_id": "b4", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2018", "authors": "B Catinella"}, {"ref_id": "b5", "title": "", "journal": "Publications of the Astronomical Society of the Pacific", "year": "2003", "authors": "G Chabrier"}, {"ref_id": "b6", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2020", "authors": "G Chauhan; C D P Lagos; A R H Stevens; D Obreschkow; C Power; M Meyer"}, {"ref_id": "b7", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2021", "authors": "G Chauhan; C D P Lagos; A R H Stevens; M Bravo; J Rhee; C Power; D Obreschkow; M Meyer"}, {"ref_id": "b8", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2019", "authors": "R H W Cook; L Cortese; B Catinella; A Robotham"}, {"ref_id": "b9", "title": "", "journal": "Publications of the Astronomical Society of Australia", "year": "2021", "authors": "Cortese L Catinella; B Smith; R "}, {"ref_id": "b10", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2014", "authors": "De Lucia; G Tornatore; L Frenk; C S Helmi; A Navarro; J F White; S D M "}, {"ref_id": "b11", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2023", "authors": "A Dev"}, {"ref_id": "b12", "title": "", "journal": "IEEE Proceedings", "year": "2009", "authors": "P E Dewdney; P J Hall; R T Schilizzi; T J L W Lazio"}, {"ref_id": "b13", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2022", "authors": "S P Driver"}, {"ref_id": "b14", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2022", "authors": "S Dutta; N Khandai; S Rana"}, {"ref_id": "b15", "title": "", "journal": "Astronomy and Astrophysics", "year": "2007", "authors": "D Elbaz"}, {"ref_id": "b16", "title": "", "journal": "The Astrophysical Journal", "year": "2018", "authors": "S M Fall; A J Romanowsky"}, {"ref_id": "b17", "title": "", "journal": "The Astrophysical Journal", "year": "2017", "authors": "H Guo; C Li; Z Zheng; H J Mo; Y P Jing; Y Zu; S H Lim; H Xu"}, {"ref_id": "b18", "title": "", "journal": "The Astrophysical Journal", "year": "2020", "authors": "H Guo; M G Jones; M P Haynes; J Fu"}, {"ref_id": "b19", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2022", "authors": "J A Hardwick; L Cortese; D Obreschkow; B Catinella; R H W Cook"}, {"ref_id": "b20", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2022", "authors": "J A Hardwick; L Cortese; D Obreschkow; B Catinella"}, {"ref_id": "b21", "title": "", "journal": "The Astronomical Journal", "year": "2011", "authors": "M P Haynes"}, {"ref_id": "b22", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2016", "authors": "M Hirschmann; Lucia G De; F Fontanot"}, {"ref_id": "b23", "title": "", "journal": "The Astronomical Journal", "year": "2012", "authors": "D A Hunter"}, {"ref_id": "b24", "title": "", "journal": "The Astrophysical Journal", "year": "2023", "authors": "Z L Hutchens"}, {"ref_id": "b25", "title": "", "journal": "Astronomy and Astrophysics", "year": "1990", "authors": "W Jaffe"}, {"ref_id": "b26", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2017", "authors": "S Janowiecki; B Catinella; L Cortese; A Saintonge; T Brown; J Wang"}, {"ref_id": "b27", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "1982", "authors": "S Janowiecki; B Catinella; L Cortese; A Saintonge; J Wang"}, {"ref_id": "b28", "title": "", "journal": "Experimental Astronomy", "year": "2008", "authors": "S Johnston"}, {"ref_id": "b29", "title": "", "journal": "IEEE Proceedings", "year": "2009", "authors": "J L Jonas"}, {"ref_id": "b30", "title": "", "journal": "The Astrophysical Journal", "year": "1989", "authors": " R C Kennicutt"}, {"ref_id": "b31", "title": "", "journal": "The Astrophysical Journal", "year": "1998", "authors": " R C Kennicutt"}, {"ref_id": "b32", "title": "", "journal": "IAU Symposium", "year": "1977", "authors": "F J Kerr"}, {"ref_id": "b33", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2017", "authors": "H.-S Kim; J S B Wyithe; C M Baugh; C D P Lagos; C Power; J Park"}, {"ref_id": "b34", "title": "", "journal": "Publications of the Astronomical Society of the Pacific", "year": "1987", "authors": "G R Knapp"}, {"ref_id": "b35", "title": "", "journal": "Astrophysics and Space Science", "year": "2020", "authors": "B S Koribalski"}, {"ref_id": "b36", "title": "", "journal": "The Astrophysical Journal", "year": "2023", "authors": "M Korsaga"}, {"ref_id": "b37", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2016", "authors": "C G Lacey"}, {"ref_id": "b38", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2018", "authors": "C D P Lagos; R J Tobar; A S G Robotham; D Obreschkow; P D Mitchell; C Power; P J Elahi"}, {"ref_id": "b39", "title": "", "journal": "The Astronomical Journal", "year": "2016", "authors": "F Lelli; S S Mcgaugh; J M Schombert"}, {"ref_id": "b40", "title": "", "journal": "The Astrophysical Journal", "year": "2022", "authors": "X Li; C Li; H J Mo; T Xiao; J Wang"}, {"ref_id": "b41", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2017", "authors": "S H Lim; H J Mo; Y Lu; H Wang; X Yang"}, {"ref_id": "b42", "title": "", "journal": "Astronomy and Astrophysics", "year": "2021", "authors": "Mancera Piña; P E Posti; L Fraternali; F Adams; E A K Oosterloo; T "}, {"ref_id": "b43", "title": "", "journal": "Astronomy and Astrophysics", "year": "2021", "authors": "Mancera Piña; P E Posti; L Pezzulli; G Fraternali; F Fall; S M Oosterloo; T Adams; E A K "}, {"ref_id": "b44", "title": "", "journal": "The Astrophysical Journal", "year": "2005", "authors": "D C Martin"}, {"ref_id": "b45", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2010", "authors": "K L Masters"}, {"ref_id": "b46", "title": "", "journal": "The Astrophysical Journal", "year": "1990", "authors": "B R Mcnamara; J N Bregman; R W O'connell"}, {"ref_id": "b47", "title": "Proceedings of Panoramic Radio Astronomy: Widefield 1-2 GHz Research on Galaxy Evolution", "journal": "SISSA", "year": "2009", "authors": "M Meyer"}, {"ref_id": "b48", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2020", "authors": "C Murugeshan; V Kilborn; T Jarrett; O I Wong; D Obreschkow; K Glazebrook; M E Cluver; C J Fluke"}, {"ref_id": "b49", "title": "", "journal": "International Journal of Modern Physics D", "year": "2011", "authors": "Nan R "}, {"ref_id": "b50", "title": "", "journal": "The Astrophysical Journal", "year": "2007", "authors": "K G Noeske"}, {"ref_id": "b51", "title": "", "journal": "The Astrophysical Journal", "year": "2016", "authors": "M C Odekon"}, {"ref_id": "b52", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2010", "authors": "T Oosterloo"}, {"ref_id": "b53", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2017", "authors": "H Padmanabhan; G Kulkarni"}, {"ref_id": "b54", "title": "", "journal": "The Astrophysical Journal", "year": "2010", "authors": "Y.-J Peng"}, {"ref_id": "b55", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2023", "authors": "J Rhee"}, {"ref_id": "b56", "title": "", "journal": "Annual Review of Astronomy and Astrophysics", "year": "2022", "authors": "A Saintonge; B Catinella"}, {"ref_id": "b57", "title": "", "journal": "The Astrophysical Journal Supplement Series", "year": "2017", "authors": "A Saintonge"}, {"ref_id": "b58", "title": "", "journal": "The Astrophysical Journal Supplement Series", "year": "2007", "authors": "S Salim"}, {"ref_id": "b59", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2023", "authors": "M Saraf; O I Wong; L Cortese; B S Koribalski"}, {"ref_id": "b60", "title": "", "journal": "Astronomy and Astrophysics", "year": "2016", "authors": "C Saulder; E Van Kampen; I V Chilingarian; S Mieske; W W Zeilinger"}, {"ref_id": "b61", "title": "", "journal": "The Astrophysical Journal", "year": "1959", "authors": "M Schmidt"}, {"ref_id": "b62", "title": "", "journal": "The Astrophysical Journal", "year": "1963", "authors": "M Schmidt"}, {"ref_id": "b63", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2020", "authors": "M Spinelli; A Zoldan; Lucia G De; L Xie; M Viel"}, {"ref_id": "b64", "title": "", "journal": "Nature", "year": "2005", "authors": "V Springel"}, {"ref_id": "b65", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2019", "authors": "A R H Stevens"}, {"ref_id": "b66", "title": "", "journal": "The Astronomical Journal", "year": "2001", "authors": "I Strateva"}, {"ref_id": "b67", "title": "", "journal": "Astronomy and Astrophysics", "year": "2010", "authors": "C Struve; T A Oosterloo; R Morganti; L Saripalli"}, {"ref_id": "b68", "title": "", "journal": "The Astrophysical Journal", "year": "1996", "authors": "G B Taylor"}, {"ref_id": "b69", "title": "", "journal": "The Astrophysical Journal", "year": "1999", "authors": "G B Taylor; C P O'dea; A B Peck; A M Koekemoer"}, {"ref_id": "b70", "title": "", "journal": "The Astrophysical Journal", "year": "2018", "authors": "F Villaescusa-Navarro"}, {"ref_id": "b71", "title": "", "journal": "Astronomy and Astrophysics", "year": "2000", "authors": "M.-P Véron-Cetty; L Woltjer; L Staveley-Smith; R D Ekers"}, {"ref_id": "b72", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2011", "authors": "J Wang"}, {"ref_id": "b73", "title": "", "journal": "The Astronomical Journal", "year": "2010", "authors": "E L Wright"}, {"ref_id": "b74", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2017", "authors": "L Xie; Lucia G De; M Hirschmann; F Fontanot; A Zoldan"}, {"ref_id": "b75", "title": "", "journal": "The Astrophysical Journal", "year": "2007", "authors": "X Yang; H J Mo; F C Van Den Bosch; A Pasquali; C Li; M Barden"}, {"ref_id": "b76", "title": "", "journal": "The Astrophysical Journal", "year": "2012", "authors": "X Yang; H J Mo; F C Van Den Bosch; Y Zhang; J Han"}, {"ref_id": "b77", "title": "", "journal": "Monthly Notices of the Royal Astronomical Society", "year": "2017", "authors": "A Zoldan; Lucia G De; L Xie; F Fontanot; M Hirschmann"}], "figures": [{"figure_label": "1", "figure_type": "figure", "figure_id": "fig_1", "figure_caption": "Figure 1 .1Figure 1. The Hi-halo mass relation of xGASS centrals, matched to the Y07 (panel a) and S16 (panel b) group catalogues. Isolated galaxies are marked with filled symbols and group centrals are marked with open symbols. Hi-detected isolated/group centrals are displayed as blue/cyan circles, and those with Hi mass upper limits are displayed as magenta/orange downward-facing arrows. The median Hi mass values are displayed in black and marked by circles with error-bars, if consistent with Hi-detected centrals, or by downward-facing arrows, if consistent with Hi-undetected centrals. Dashed black lines mark the median model Hi-halo mass relations given by equation 2 (panel a) or equation 3 (panel b).In each bin, the region between the grey lines shows the 16th-84th percentile of the Hi mass distribution, marking a large Hi mass scatter at all halo masses. The 16th percentile is not constrained at the high halo mass end, where Hi mass upper limits dominate.", "figure_data": ""}, {"figure_label": "2", "figure_type": "figure", "figure_id": "fig_2", "figure_caption": "Figure 2 .2Figure 2. The scatter along the median Hi-halo mass relation of xGASS centrals, matched to the Y07 group catalogue. Hi-detected centrals are displayed as circles, and those with 𝑀 HI,c upper limits are displayed as downward-facing arrows. Left: The Hi-halo mass parameter space, with points colour-coded by either ΔMS (panel a), 𝐶 𝑖 (panel c) or 𝑗 * (panel e). The median Hi mass values (open black symbols) and the 16th-84th percentile (region between grey lines) are displayed as in Fig. 1a. The 𝜌 S value between 𝑀 HI,c and 𝑀 halo is stated for star-forming and disc-dominated centrals in panels a and c respectively. Right: Δ𝑀 HI as a function of either ΔMS (panel b), 𝐶 𝑖 (panel d) or 𝑗 * (panel f), with their 𝜌 S values stated and points colour-coded by 𝑀 halo . Δ𝑀 HI is calculated from the median model Hi-halo mass relation (equation 2), which is represented by the horizontal dashed black line at Δ𝑀 HI = 0. The SFMS is marked by the region between the two vertical dashed black lines in panel b. In each row, the limits of the colour bars in the left column are the same as the limits of the 𝑥-axis in the right column and vice versa. Note, the second row displays only the ΔMS sub-sample and the bottom row displays only the 𝑗 * sub-sample.", "figure_data": ""}, {"figure_label": "3", "figure_type": "figure", "figure_id": "fig_3", "figure_caption": "Figure 3 .3Figure 3. Diagram summarising the drivers of a flat median Hi-halo mass relation of centrals.", "figure_data": ""}, {"figure_label": "4", "figure_type": "figure", "figure_id": "fig_4", "figure_caption": "Figure 4 .4Figure 4. Comparing the Hi-halo mass relations presented in Dutta et al. (2022) (dotted green line) and Korsaga et al. (2023) (dashed yellow line) to the medians of xGASS centrals matched to the Y07 group catalogue. The xGASS median Hi mass values and 16th-84th percentiles are displayed as in Fig. 1a. The xGASS medians of star-forming centrals are shown as blue stars and those of passive centrals are shown as red downward-facing arrows. Note, the bins used to find the median Hi mass values of star-forming or passive centrals are different from each other and those used for finding the overall median median Hi mass values to ensure all bins have > 10 centrals.", "figure_data": ""}, {"figure_label": "5", "figure_type": "figure", "figure_id": "fig_5", "figure_caption": "Figure 5 .5Figure 5. Comparing the stacked Hi-halo mass relations presented in Guo et al. (2020) (dashed yellow line) and Rhee et al. (2023) (dotted red line) to the linear averages of xGASS centrals matched to the Y07 group catalogue (dark blue shaded region). The solid dark blue line marks the highest linear averages. For reference, the xGASS median Hi mass values and 16th-84th percentiles are displayed as in Fig. 1a.", "figure_data": ""}, {"figure_label": "6", "figure_type": "figure", "figure_id": "fig_6", "figure_caption": "Figure 6 .6Figure 6. Comparing the median Hi-halo mass relations predicted from SAMs in Baugh et al. (2019) (dotted red line), Spinelli et al. (2020) (dash-dotted blue line) and Chauhan et al. (2020) (dashed yellow line) to the observed medians of xGASS centrals matched to the Y07 group catalogue. The xGASS median Hi mass values and 16th-84th percentiles are displayed as in Fig. 1a.", "figure_data": ""}, {"figure_label": "A1", "figure_type": "figure", "figure_id": "fig_7", "figure_caption": "Figure A1 .A1Figure A1. Same as Fig. 2, but for the xGASS centrals matched to the S16 group catalogue, whose modelled median Hi-halo mass relation is given by equation 3.", "figure_data": ""}, {"figure_label": "A2", "figure_type": "figure", "figure_id": "fig_8", "figure_caption": "Figure A2 .A2Figure A2. Same as Fig. 4, but for xGASS centrals matched to the S16 group catalogue.", "figure_data": ""}, {"figure_label": "A3", "figure_type": "figure", "figure_id": "fig_9", "figure_caption": "Figure A3 .A3Figure A3. Same as Fig. 5, but for xGASS centrals matched to the S16 group catalogue.", "figure_data": ""}, {"figure_label": "A4", "figure_type": "figure", "figure_id": "fig_10", "figure_caption": "Figure A4 .A4Figure A4. Same as Fig. 6, but for xGASS centrals matched to the S16 group catalogue.", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Statistics of xGASS centrals, matched to the Y07 and S16 group catalogues, categorised by their environmental and Hi detection properties. Additional columns refer to centrals with catalogued ΔMS and 𝑗 * estimates. Filters are applied to ensure that all the Hi-detected centrals are not affected by beam confusion.", "figure_data": "Y07S16full sample ΔMS sub-sample𝑗  *  sub-sample full sample ΔMS sub-sample𝑗  *  sub-sampleall measurements531528344369366251isolated galaxies Hi detection415413344300298251Hi upper limit116115-6968-all measurements23323283285284111group centralsHi detection13713783165165111Hi upper limit9695-120119-all measurements764760427654650362total centralsHi detection552550427465463362Hi upper limit212210-189187-"}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "The median Hi mass values, marked in Fig.1a and b, are presented alongside the halo mass limits and counts of centrals (𝑁 ) for each bin. The 16th and 84th percentiles of the scatter in the Hi mass distribution of each bin is also provided where constrained. 𝑀 halo ) log 10 ( 𝑀 HI,c ) log 10 ( 𝑀 HI,c )", "figure_data": "Bin𝑁MedianScatterlog 10 ("}], "formulas": [{"formula_id": "formula_1", "formula_text": "𝑀 HI,c = 0.08𝑀 3 halo -3.00𝑀 2 halo + 38.41𝑀 halo -154.50,(2)", "formula_coordinates": [3.0, 305.57, 463.22, 242.64, 13.54]}, {"formula_id": "formula_2", "formula_text": "𝑀 HI,c = 0.20𝑀 3 halo -7.59𝑀 2 halo + 98.10𝑀 halo -412.29,(3)", "formula_coordinates": [3.0, 305.57, 496.94, 242.64, 13.54]}, {"formula_id": "formula_3", "formula_text": "[M ⊙ ] [M ⊙ ] [M ⊙ ]", "formula_coordinates": [5.0, 77.62, 124.72, 162.24, 7.44]}], "doi": "10.1088/0067-0049/182/2/543"}
