{"title": "\"All of the White People Went First\": How Video Conferencing Consolidates Control and Exacerbates Workplace Bias", "authors": "M O Houtti", "pub_date": "2023-01-30", "abstract": "Workplace bias creates negative psychological outcomes for employees, permeating the larger organization. Workplace meetings are frequent, making them a key context where bias may occur. Video conferencing (VC) is an increasingly common medium for workplace meetings; we therefore investigated how VC tools contribute to increasing or reducing bias in meetings. Through a semi-structured interview study with 22 professionals, we found that VC features push meeting leaders to exercise control over various meeting parameters, giving leaders an outsized role in affecting bias. We demonstrate this with respect to four core VC features-user tiles, raise hand, text-based chat, and meeting recording-and recommend employing at least one of two mechanisms for mitigating bias in VC meetings-1) transferring control from meeting leaders to technical systems or other attendees and 2) helping meeting leaders better exercise the control they do wield.", "sections": [{"heading": "INTRODUCTION", "text": "Research in meeting science has long established the integral role meetings play in organizational functioning, shaping processes, structures, and outcomes [56]. Meeting quality is an important contributor to the health of many businesses, with the quality of team meetings predicting organizational success up to 2.5 years later [26]. Even putting economic factors aside, meeting quality is immensely relevant to knowledge workers-an estimated 1 billion people globally [45]. The typical knowledge worker spends 25-80% of their working hours in meetings [47]-assuming a 40-hour workweek, this amounts to 10-32 hours each week. Employee satisfaction with and participation in meetings is associated with overall job satisfaction and productivity [6,64], and poor meetings reduce employee well-being, e.g., by increasing emotional exhaustion [30].\nWith movements to remote work caused by the COVID-19 pandemic [33], commercial video conferencing (VC) software providers enjoyed massive increases in the adoption of their products for workplace meetings. Zoom Video Communications-owner and operator of Zoom, the world's most popular video conferencing platform [9]-saw its annual revenue more than quadruple from $623 million in 2020 to $2.65 billion in 2021 [46]. The widespread adoption of computer-mediated communication in an area of such critical importance to individuals and organizations makes professional meetings an area of research with renewed importance in CSCW, and presents us with an opportunity to help answer a question of wide-ranging significance: how is the adoption of VC likely to change professional meetings? In exploring this ourselves, we illuminate avenues for improving professional meetings at scale; VC is computationally mediated, so we can employ design solutions much more easily, broadly, and cost-effectively than in the equivalent in-person contexts.\nTo ground this study, we focus our inquiry on a widely occurring problem-that of bias. We consider a VC system biased if it systematically imposes inequitable costs or barriers to participation on an individual or group-whether on the basis of immutable characteristics such as race, or changing characteristics such as seniority or organizational role.\nOur first reason for focusing on bias is pragmatic; compounding the negative outcomes of poor meetings, employees who experience workplace bias are less productive and more likely to quit their jobs earlier [32,37]. The growing diversity of the global workforce [27,34,62] makes this problem increasingly important.\nWe also believe addressing bias is important ethically. Experiencing bias in the workplace can contribute to depression, anxiety, stress, low self-esteem, and lower overall job satisfaction [24,32]. Our concern is heightened by the fact that bias disproportionately affects minorities who already face myriad other obstacles at work [11,23,36]. We believe VC software designed to decrease bias would be more ethical, and that reducing bias is therefore an inherently worthwhile objective.\nThe goal of our research was to 1) understand whether and how VC contributes to bias against groups of users in workplace meetings, and 2) provide specific feature and design recommendations for VC systems to reduce bias in workplace meetings. We conducted semi-structured interviews, asking 22 professionals about bias and barriers to participation they face in workplace meetings related to their use of VC. Through qualitative analysis of the interview transcripts, we provide detailed insight into employees' experiences of bias in meetings, and synthesize these insights to produce concrete design recommendations.\nOur results show that VC pushes meeting leaders to take on excess control over core meeting parameters. In some cases, VC does this by directly allocating technical control-e.g., a designated meeting host can unilaterally decide whether the meeting is recorded. In other cases, control is allocated socially, sometimes because of ambiguities about whether and how various VC features should be used-e.g., whether or not meeting participants should raise their hands to speak. How this control is wielded has major implications for bias in VC meetings. We organize our recommendations for reducing bias around four VC features participants frequently referred to. These features exist in similar forms across most popular VC platforms including Zoom, Cisco Webex, Microsoft Teams, and Google Meet.\nWe summarize key findings and corresponding design recommendations (bolded) below:\n• User Tiles. Inconsistent user tile placement across users' interfaces precludes speaking order from emerging organically, thereby pushing meeting leaders to decide who speaks when.\nPACM on Human-Computer Interaction, Vol. 7, No. CSCW1, Article 121. Publication date: April 2023.\n\"All of the White People Went First\" 121:3\nOther aspects of tile placement can lead meeting leaders to call on people in ways that exacerbate already-existing participation inequalities. VC systems should make tile placement across users' interfaces consistent, and/or allow meeting leaders to select random speaking orders.\n• Raise Hand. Employees rarely use the raise hand feature unless explicitly instructed to do so by a meeting leader. This feature has the potential to lower barriers to participation for people who are uncomfortable interrupting their co-workers.\nVC systems should enable meeting participants to anonymously communicate their preferred hand-raising norms and/or push meeting leaders to set explicit norms.\n• Text-Based Chat. Participants who communicate through text-based chat often rely on meeting leaders to acknowledge their questions and contributions to the meeting. Incorporating textbased chat is perceived to reduce bias, and significantly lowers barriers to participation for those who are least likely to speak up. VC systems should divert some of chat's uses (e.g., encouraging messages) to other channels so meeting leaders can more easily parse chat content and incorporate it into meetings.\n• Meeting Recording. Employees rely on meeting leaders to decide whether a meeting is recorded and how the recording is used. Recording a meeting allows those with with certain cognitive disabilities greater access to meeting content, but may inhibit participation from some minority groups during the meeting. VC systems should allow meeting participants to hide their appearance in recordings without having to hide their appearance in the meeting and/or give meeting leaders tools to more easily obtain consent for recording.\nNot all meetings are led by a single person or group of people, but our participants mostly spoke about meetings where a clear meeting leader could be identified. We expect this is a substantial portion or majority of workplace meetings. We begin our results by outlining the various ways in which our participants identify who the meeting leader is, and set the stage for understanding to whom additional control accrues in meetings. We then outline our findings with regards to the four VC features listed above. Using our participant interviews, we show how each feature as currently implemented in popular commercial VC systems puts control in the hands of the person or people leading the meeting. We then show how this control gives meeting leaders influence over whether and how a meeting is biased. We first, however, outline the literature in which our own work is situated and provide an overview of our methods.", "publication_ref": ["b55", "b25", "b44", "b46", "b5", "b63", "b29", "b32", "b8", "b45", "b31", "b36", "b26", "b33", "b61", "b23", "b31", "b10", "b22", "b35"], "figure_ref": [], "table_ref": []}, {"heading": "RELATED WORK", "text": "Our work extends research in three main areas. We begin with a description of prior work on VC, focusing specifically on the central challenges CSCW research has tried to address. We then describe the relevant literature on workplace bias, and conclude with an overview of prior work on how meeting leaders shape workplace meeting outcomes.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Video Conferencing", "text": "Prior work has documented many advantages of VC use in the workplace and elsewhere, including protecting employees' health from disease [42], reducing travel expenses and time [29], drawing international participants together from different locations [61], and allowing virtual teams to bond socially [21].\nOur work is situated in the body of HCI and CSCW research that has revealed and improved on VC's limitations, however. As Ackerman [1] argued, there is a \"divide between what we know we must support socially and what we can support technically. \" He termed this the \"social-technical gap\", and argued that \"ameliorating this social-technical gap is the central challenge for CSCW as a field and one of the central problems for human-computer interaction. \" Researchers in CSCW must often provide approximate solutions that do not satisfy all the social requirements and social contexts where the technology is used. Olson and Olson [43] studied this gap within the context of distance communication technology in particular, and concluded that \"There will likely always be certain kinds of advantages to being together. However, as a wide range of collaborative tools emerges, we will find useful ways to use them to accomplish our goals. \"\nWe take on the central intellectual challenge posed by Ackerman, seeking to understand the socialtechnical gaps that lead VC to exacerbate meeting bias, and to show where the latest approximate solutions lead to bias in workplace meetings. And following Olson and Olson, we continue the line of research that finds useful ways for admittedly imperfect distance communication tools to help us accomplish our goals-in this case, our equity goals. Subsequent work in CSCW has addressed similar gaps in VC's ability to fully support collaborative social interaction.\nIn a 2016 literature review, Bonaccio et al. [7] identified four essential functions of nonverbal communication in the workplace, including promoting social functioning and fostering high-quality relationships. Researchers in HCI and CSCW have found these functions are inhibited in the VC context. Nguyen and Canny [38], for example, compared groups using video conferencing under different conditions and found that traditional VC setups slowed the development of intragroup trust because of limitations on nonverbal gesturing. These adverse effects were minimized, however, in setups that preserved the spatial relationships of participants to each other, allowing participants to gesture towards each other more effectively. Limited nonverbal communication has also been partially credited with the phenomenon of \"Zoom fatigue\"-used to describe the physical and emotional exhaustion often experienced by participants in virtual meetings [8,63]. By building on prior academic theory and research, Bailenson [3] provided several possible explanations for Zoom fatigue, including that VC requires individuals to put more effort into directing signals for nonverbal cues, resulting in heavier cognitive load.\nOur work extends this literature by relating much of it directly to bias in workplace meetings. For example, we find that a shared sense of space is important not only for building trust, but also for collectively making unbiased decisions about speaking order. Spatial fidelity is therefore also an important factor in mitigating bias in VC meetings. We also find that VC's limits on nonverbal communication affect people differently. Many rely on body language to interject in face-to-face workplace meetings, but find that these same tools do not work in the VC-mediated context. When meeting leaders do not explicitly set alternatives for interjecting, marginalized voices are often further marginalized.", "publication_ref": ["b41", "b28", "b60", "b20", "b0", "b42", "b6", "b37", "b7", "b62", "b2"], "figure_ref": [], "table_ref": []}, {"heading": "Workplace Bias", "text": "We take a broad definition of bias in this work, understanding it as encompassing any instance where an inequitable cost or barrier to participation is imposed on a group or individual, intentionally or unintentionally. Prior work has extensively documented contexts in which workplace bias occurs and the characteristics it is frequently based on.\nIn a literature review of 25 studies, Nowrouzi et al. [40] observed that bias permeates almost every stage of employment including recruiting, job interviews, hiring, and evaluation. Deprez-Sims and Morris [16] found that those making hiring decisions often favored those with accents most similar to their own. Rudolph et al. [49] found that overweight individuals faced worse outcomes in performance evaluations and hiring decisions. In a literature review of studies on gender discrimination, Badgett et al. [2] found that 20-57% of transgender participants reported experiencing workplace discrimination in studies from 1996 to 2006. Dawson et al. [15] identified Black women whose natural hairstyle choices led them to experience negative workplace consequences.\nIn CSCW, some attention has been given to bias arising from workplace adoption of VC systems. Das et al. [14] interviewed 36 neurodivergent individuals about their work-from-home experiences and identified several ways VC software is inaccessible for neurodivergent employees. Some participants, for example, cited difficulties with taking turns speaking given the absence of nonverbal cues. Our own results corroborate this finding, and we suggest potential design improvements.\nTo our knowledge, there is little other work in CSCW or elsewhere that examines the specific role of VC in workplace bias. This is a particularly important gap because bias that arises primarily from technical systems can be mitigated at scale much more easily than bias that is due to deeply entrenched business practices or human tendencies. We contribute new knowledge here by identifying how features of VC lead to biased meeting outcomes, how these effects differ based on participants' personal characteristics like gender, gender identity, race, neurodivergence, etc., and by providing actionable design recommendations VC software designers can use to mitigate these adverse outcomes.", "publication_ref": ["b39", "b15", "b48", "b1", "b14", "b13"], "figure_ref": [], "table_ref": []}, {"heading": "The Role of Meeting Leaders", "text": "Prior work has highlighted the essential role leaders play in meeting dynamics and outcomes. Sauer and Kauffeld [51] performed social network analysis to examine meeting leader behaviors in 46 meeting videos, and found that meeting leaders are key to connecting meeting participants with one another. Several other studies [25,31,54,55] have identified meeting leaders' many responsibilities, including planning for the agenda, guiding meeting flow, encouraging participants to exchange ideas, and keeping a healthy meeting environment. In short, meeting leaders play an essential role in meeting success. Given this understanding, Perkins [44] investigated positive meeting leader qualities and how to elicit them via coaching.\nAdditional attention has been given to leadership in virtual meetings in recent years, with much of this work focused on helping leaders run better online meetings. Ferrazzi [19], for example, created a checklist for best practices meeting leaders can reference before, during, and after meetings: start the meeting with a regular check-in, encourage solving problems collectively, and finish the meeting with a cool ending. Other suggestions include frequently checking attendees' engagement levels [28], setting inclusive norms for communication, and utilizing available technology to provide a better meeting experience [17].\nOur work extends this literature by showing how many of meeting leaders' responsibilities arise from VC features pushing them to take control over core meeting parameters, and how this excess responsibility can lead to bias. While we primarily contribute design recommendations, a few of our recommendations center around pushing meeting leaders to behave differently (e.g., setting explicit hand-raising norms) and thus, viewed differently, could also be considered recommendations for more effective meeting leadership.", "publication_ref": ["b50", "b24", "b30", "b53", "b54", "b43", "b18", "b27", "b16"], "figure_ref": [], "table_ref": []}, {"heading": "METHODS", "text": "Our methods were based on inductive thematic analysis [10]. We now detail our implementation of this approach.", "publication_ref": ["b9"], "figure_ref": [], "table_ref": []}, {"heading": "Interview Protocol", "text": "Our research team collaboratively developed a semi-structured interview protocol to understand how employees in the workplace experience and perceive bias in VC meetings. The lead author then conducted pilot studies with two graduate students to help refine the interview questions. Data from pilot studies were excluded from our final analysis.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Recruitment and Participants", "text": "We submitted our research plan to the University of Minnesota's Institutional Review Board and obtained approval prior to beginning recruitment. We reached out to personal and professional contacts, asking them to circulate our recruitment message in their workplaces. We also used snowball sampling-asking our participants to forward our message to others in their networks. The recruitment message linked to a sign-up form where participants could provide contact information, specify interview availability, list preferred VC platforms, and consent to participation in the study. We used email to schedule VC meetings with those who signed up. All participants listed Zoom as one of their preferred VC platforms, so we used it for all interviews.\nAfter each interview, we used an online survey to collect the participant's demographic information. All questions in the survey were optional, and all except \"job level\" were free-response. Participants' answers to these survey questions are listed in Table 1. The survey did not ask participants for the industry they worked in, but many participants mentioned their industries during the interviews, which included insurance, educational technology, information technology, and performing arts, in both commercial and higher education settings.\nOur initial round of recruitment yielded a participant pool that was diverse in terms of gender, but was largely white and Asian. Given our research topic, we wanted to include a racially diverse set of voices, so we conducted an additional round of recruitment focused on individuals from under-represented minority groups. We reached data saturation shortly before completing our analysis, so we stopped recruiting after the second round. Each participant received a $20 Amazon gift card as compensation for participating.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Conducting Interviews", "text": "We began each interview by going over our data privacy practices-e.g., ensuring participants understood they would be anonymized in any related manuscripts/publications, and that we would not disclose their participation to any third parties. We gave participants a chance to ask any remaining questions, then confirmed their consent for us to record the interview.\nWe explained the general focus of our study. To avoid constraining participant responses to our preconceptions, we did not provide a specific definition of \"bias\". We did refer to \"barriers to participation\" throughout the interviews to ensure participants did consider the type of bias we were focused on. We first asked participants to think of a recent virtual work meeting that seemed relevant to the themes we were concerned about. We then asked specific questions about the meeting setup, followed by more general questions about the interplay of various meeting factors with bias, participation, and engagement-e.g., \"how does camera usage affect your participation in meetings?\" In the spirit of semi-structured interviewing, most of our interview questions flowed from interesting threads brought up by the participants themselves in the course of conversation.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Data Collection and Analysis", "text": "The interviews ranged in length from 42:39 to 1:27:13; the average length was 1:04:24. The raw data for our analysis was auto-generated transcripts from the Zoom recordings. The transcripts contained errors, but we could often deduce the original meaning based on context clues and recollection of the interviews. When needed, we also referred back to the original meeting recordings.\nWe applied open codes on the transcripts using MAXQDA2022-a popular online tool for qualitative data analysis. Two researchers worked together to set standards for open coding on a single interview, then individually generated open codes for the remaining interviews. At the end of  1. User demographics. All questions were optional, and all but job level were free-response. Some responses under \"Race and Ethnicity\" were modified for brevity, but original granularity was maintained. Blank cells indicate no response.\nthis process, we had approximately 1700 open codes, each summarizing a distinct participant statement-e.g., one code read \"P13: Weird to have meeting there in perpetuity esp when misgendered\".\nThe same two researchers then performed axial coding together. Using Miro, we iteratively grouped open codes into thematic categories and sub-categories. For example, the aforementioned code for P13 was placed in the sub-category \"permanence\" under the category \"recording\". As overarching patterns became clearer, we altered the categories to better capture the associations between open codes. All results were derived from patterns and themes identified through this process.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "RESULTS", "text": "All our participants had extensive experience using VC for workplace meetings. All indicated familiarity with Zoom, though a couple mentioned primarily using Microsoft Teams or Google Meet.\nThe interviews took place in October through November of 2021, when many of our participants were still working remotely due to COVID-19 pandemic restrictions. Some had little experience with in-person meetings in their current role, either because they had recently started a new job or because they had worked remotely even before the onset of the pandemic. Others had previous inperson meeting experience in the same role, and were therefore able to provide useful comparisons between the two modalities within the same professional context.\nOur interviews surfaced many topics and findings from prior academic and popular literature, such as the occurrence of \"Zoom fatigue\" [8,21,63] (P21 described VC as causing \"mental drain\"), work-life conflict caused by having children at home while working remotely [52] (P7 perceived people who engaged in child-care during meetings \"a little bit less professionally\"), and the VC's ability to increase efficiency through multitasking [12] (being able to work on other things is \"definitely a net positive\" of VC for P12).\nOur focus on bias also revealed how VC pushes or requires meeting leaders to exercise control over core meeting parameters, and how this affects bias in meetings. We summarize these findings and corresponding design recommendations from the Discussion section in Table 2. As context for this, we first outline who meeting leaders are, according to our participants.", "publication_ref": ["b7", "b20", "b62", "b51", "b11"], "figure_ref": [], "table_ref": []}, {"heading": "Who Leads Meetings?", "text": "Participants indicated that meetings were frequently led by the most senior person or people in attendance. P9, for example, described \"the usual cadence\" as involving \"leadership leading the meeting. \" She recalled one instance of a weekly meeting where \"another person joining the meeting was one level above\" the usual two meeting leaders, \"so the three of them were leading the meeting. \" Leading a meeting often involves setting the agenda, which meeting leaders do with varying levels of structure. In P9's case, the \"two people a level above\" her who were in charge of leading the weekly meeting \"always provide a clear meeting agenda, usually earlier in the day or the day before. \" P10, by contrast, described how her manager runs a weekly team meeting that is \"the most unstructured meeting of my week. \"\nSince we have no agenda, and since he doesn't set any boundaries around the meeting or what should happen in the meeting, it's just kind of up to him what he wants to do.\nThere are exceptions to this general rule. In meetings with no clear role hierarchy, for example, meeting leadership could depend on other factors, such as who called the meeting-often the person designated as \"meeting host\" and given special technical privileges:\nThe host is at the top of the hierarchy, so the host is always allowed to talk, and they can talk to anyone. This is my imagination of how it is; I'm sure it's not written down anywhere. (P17) By extension, having special technical privileges to call meetings-and to be meeting host-also confers social privileges. P20 called this out explicitly, by observing how her inability to schedule new VC meetings affects how she perceives her role in existing meetings: I think there are definitely questions of, well, if I don't have access to this platform, I think that impacts how people see their ability to take the lead, or to take up space. So I see that as a dynamic that plays out in the meeting.\nIn some cases, there is no meeting leader at all. P11 mentioned that \"often it's not one specific person leading a meeting, \" especially in cases where the meeting doesn't require a facilitator-e.g., \"it's me and three other people to just brainstorm something.\" (P11) However, participants mostly spoke about meetings where there was a clear leader. Our results, therefore, focus on these types of meetings, which we expect encompass a substantial portion-if not a majority-of workplace meetings.\nBeyond just setting the agenda and having more space to talk, VC gives meeting leaders new avenues for control over meeting parameters that govern whether and how others participate, including in ways that have major implications for bias. We now show how this manifests through particular VC features, beginning with user tiles. ", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "User Tiles", "text": "Participants in VC meetings are typically each represented within a tile containing the person's name and, optionally, a video feed from their webcam. Zoom, which the majority of our participants used, has two main views-gallery view, in which participants are given equally sized tiles and organized into rows, and speaker view, in which the current speaker is displayed in a larger tile that takes up most of the screen (Fig. 1). Several participants noticed that the order of tiles was not the same on every meeting participant's screen-i.e., the person in the bottom-left tile on one user's screen might be in a different position on another user's screen. While seemingly innocuous, this design decision creates additional reliance on meeting hosts to call on people to speak. We explain how this occurs using an illustrative example from P11's experience. We then outline other aspects of tile positioning that cause hosts to unintentionally exacerbate participation biases.", "publication_ref": [], "figure_ref": ["fig_0"], "table_ref": []}, {"heading": "Leader Picks Who Speaks", "text": "Next. P11 recounted an instance of bias at a weekly check-in, where her manager called on people individually to share updates. \"He stopped like one or two times, seeming to have to think about it, and then was like 'Oh, we didn't hear from whoever yet. \"' P11 noticed that the ad-hoc order in which her manager called on people seemed to be in the \"order of his ranking of importance\", creating an unintentional but clear bias in favor of those the manager felt closest to:\nI wouldn't say it was in order of seniority, but it was almost in order of seniority. But that made it so that all of the white people went first before any of the people of color, which I don't think was intentional, but it was very noticeable to me. The meeting was punctuated by another instance of bias, this time against P11-the only woman present:\nAnd then, when he wrapped up the meeting, I was the only one that he didn't ask to speak. So he forgot about me.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "P11 speculated about what the same meeting might have looked like in person:", "text": "When we were in person, there were similar dynamics at play, but it didn't feel as weird. If we're going around the room doing a check-in, it was always kind of like 'Okay, we'll start here' and there seemed to be a reason, at least, for the order that was picked for people sharing.\nIn other words, being in a physical space together would have allowed meeting participants to use a common practice for assigning speaking order-going around in a circle. But the way in which VC-in this case Zoom-presented each participant with a different physical layout of the meeting precluded them from doing so, causing the meeting leader-P11's manager-to take on additional authority with regards to participation order. P7 noticed the same thing in her meetings, and complained that \"we should all have the same order, because there's always that awkwardness of who's going next. \" She hypothesized that consistent ordering could solve the problem of meeting leaders always \"prioritiz[ing] the people whose videos are on.\" Participants noticed this aspect of tile ordering often meant meeting leaders' decisions about who to call on exacerbated existing participation biases, especially because people who were more likely to speak up were also more likely to have their cameras on. As we will now show, the baseline participation for people with cameras on is greater, and this difference is exacerbated because VC pushes meeting leaders to include those with cameras on more than those with cameras off.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "People", "text": "With Cameras are Prioritized. Participants reported higher engagement with camera on, which in turn led them to participate more. P11, for example, noted being \"more engaged if I have my camera on. \" For P22, \"if I have my camera on, I'm usually participating in the meeting more and driving the meeting more. \" Conversely, when P15 has camera off, \"there's nothing coming from me. \"\nMeeting leaders and other attendees also reported being more likely to bring participants with cameras on into the conversation. P22, for example, recalled that \"when people have camera on... I'm looking at people and I'm like 'Oh, this person looks like he or she has something they want to say.\"' Similarly, if P10 \"can tell from their facial expression that they have something to contribute that might be a different opinion, then I would... be like 'Hey, do you have anything to say? It looks like you haven't said anything. Is everything okay?' And that just gives them a chance to express their opinion.\" The effect goes both ways, too-having camera off also actively discourages bringing a person into the conversation. As P18 described it, there is often \"an implicit understanding that if they're not on video, maybe don't call on that person.\" After all, \"if your camera's off it's probably for good reason-like you're in transit, you're getting your water, you can't necessarily speak up. \" As we show in section 4.5, this assumption is often incorrect, as meeting participants frequently turn their cameras off for other reasons-e.g., to avoid being recorded.\nParticipants noted that visual ordering of users' tiles was based on cameras, further exacerbating the inequalities we outlined above. P7 noticed that the \"type of people who tend to show their camera, they're the same ones that always pop up at the front\" page of her interface. \"It's the same few people who always come up in my default view.\" She criticized Zoom for \"prioritizing the people with the cameras\"-the same people who are already most engaged and likely to speak.\nBringing those with cameras on to the front also involves pushing those with cameras off to the back, leading P3 to observe that \"the people without their cameras on often are treated as being in the back row. \" This is consistent with prior work in proxemics showing that physical positions relative to others in a room affect how likely a person is to be engaged in conversation [58]. Thankfully, the raise hand feature provides alternative means by which meeting participants-even those \"in the back row\"-could break into the conversation. However, we now outline how even use of this feature largely depends on meeting leaders to set norms for its use.", "publication_ref": ["b57"], "figure_ref": [], "table_ref": []}, {"heading": "Raise Hand", "text": "The raise hand feature enables participants to indicate they would like to speak. In most current implementations, when a participant raises their virtual hand, they are featured in a more prominent position (e.g., the top-left tile of the first page in gallery view) on other meeting participants' screens, and an icon on their tile indicates a raised hand. Our results indicate that the raise hand feature relies on meeting leaders to set explicit participation norms. Most fail to do so, making the feature chronically under-used in professional VC meetings. This reduces the participation of users who are more hesitant to participate in the first place. 4.3.1 The Default is to Not Raise Your Hand. Several participants attributed sparse usage of the raise hand feature to meeting norms. No participants recounted instances of hand-raising being actively discouraged, but several indicated lack of any clear guidance around its usage. P14, for example, often wondered, \"Do they want me asking a question in person or should I raise my hand?\" In these cases, participants defaulted to not using the feature. P7, for example, said that raise hand was \"not something we commonly use. It's just not been adopted, so I always feel silly doing it. \" P11 similarly did not raise her hand because \"it's just a norm in this company. I've never seen anyone do it in a non-classroom setting. \" Many decided not to use the feature unless given clear instruction to do so because it did not feel completely appropriate for professional contexts-i.e., it \"seems very elementary school\" (P13) or \"it's almost too awkward. \" (P10) However, in cases where clear guidance to use the raise hand feature was provided, participants reported doing so. P10 recalled one such example:\nThe only time I've had an experience with this was actually last week, where we had a meeting and someone explicitly said, 'If you want to say something, please raise your hand. ' That's when people started using it. Meeting leaders therefore have often-unexercised (and unrecognized) control over whether the raise hand feature gets used as a tool for interjecting. This has been documented in prior researchespecially in the educational context, where hand-raising has been studied the most. Nunneley et al. [41], for example, recommended that educators using VC (emphasis ours) \"proactively inform their learners how questions should be raised, such as through chat boxes, 'raise hand' features or vocal interjections, and whether they should be spontaneous or asked during specific times.\" As we will now show, this recommendation could apply to the professional meeting context too, as meeting leaders' decisions-or lack thereof-with regards to hand-raising have major implications for whether and how others participate.", "publication_ref": ["b40"], "figure_ref": [], "table_ref": []}, {"heading": "Raise Hand Makes Interjecting Easier. \"", "text": "The biggest differentiator\" between the in-person and virtual meeting experiences for P7 was that \"trying to interject myself, I think, is a lot harder in a virtual meeting than in real life. \" Subtle body language cues like \"leaning forward\" (P11) to speak are more difficult to communicate and pick up on. Meetings are often dominated by \"people who aren't as comfortable with silence or who like to speak a lot. \" (P7) They tend to miss the signs that someone is \"trying to break in and say something. \" (P7) This is further exacerbated in cases where participants have their cameras turned off, precluding any reading of facial or body language cues. There is thus a greater burden on people to insert themselves into the conversation, which makes speaking more difficult for people who are hesitant to participate in the first place. \"For remote meetings,\" said P14, \"you have to rely on people bringing themselves forward with more deliberate action to say, 'I want to participate. \"' One such deliberate action could be \"raising\" one's virtual hand, indicating a desire to speak. As P16 put it, it's \"easier in a big group Zoom meeting than a big group in person meeting\" because \"on Zoom, you can just raise your hands.\" Yet as we have shown, participants rarely feel comfortable taking advantage of this feature unless explicitly instructed to do so. This is despite recognizing its benefits for them and others who might not otherwise feel comfortable interjecting. P5, for example: I don't know if you use [Microsoft] Teams. They have that hand up feature which is useful for like, 'Hey I have something to say, but I don't want to interrupt what's going on right now. ' I think things like that are really useful. \" In keeping with prior work-which has documented how being able to virtually raise a hand makes it easier for students [39] and conference participants [57] to ask questions-our participants agreed with P5 that the feature is useful for trying to break into an ongoing professional meeting, and lamented that it is not used more. In describing her difficulties with interjecting during meetings, P7 observed that \"some teams, or some people, use the emojis on Zoom to raise their hand\" as a solution. Similarly, P13 is neurodivergent and sometimes has trouble with reading social cues. They do not want to accidentally interrupt someone:\nWhen you're on Zoom, it seems like a lot of social cues just go out the window. I'm not super adept at picking up on social cues in the first place, but I can usually tell when somebody is about to speak-and if I'm about to interrupt them-if I'm in the room with them... I wish people would just raise their hands when they're ready to speak in Zoom meetings... It would help me personally a lot, to feel like I'm not interrupting people, or I'm not speaking over somebody if we just use the tools that are available to us.\nFor P13, this was especially salient in large meetings like their monthly all-hands meetings with over 100 participants:\nIt seems so silly to me that with that many people, you expect people to just speak up when they're ready to speak... There are people who struggle with being heard in the first place-shy people, neurodivergent people, maybe people of color or trans or LGBT people in general, who are already disadvantaged in these settings where white, cis-gender people speak up more. I think that it makes it even harder for people who are marginalized to participate.\nMany marginalized meeting participants used text-based chat as an alternative way to have their voices heard, especially when norms about raising hands were ambiguous. P14, for example, described common situations where \"it's unclear when you can speak. You just don't know. Is there a pause? Should I jump in? Do they want me asking a question in person or should I raise my hand? And then you're like, 'Uh, I don't know, I'll just type it in. \"' We now cover ways in which the full use of text-based chat depends, once again, on decisions by meeting leaders.", "publication_ref": ["b38", "b56"], "figure_ref": [], "table_ref": []}, {"heading": "Text-Based Chat", "text": "Text-based chat allows users to communicate through text messages-both private messages to a single user and public messages to the entire meeting room-while a meeting is ongoing. Our results show that employees who use text-based chat often rely on meeting leaders to acknowledge their questions and contributions to the meeting, and sometimes feel discouraged from using chat when their contributions are ignored. At the same time, VC makes it difficult for meeting leaders to keep track of and fully incorporate chat, which participants viewed as a secondary medium parallel to the main voice-based conversation. We describe these results, then show how, when successfully used, text-based chat reduces barriers to entry into meeting participation-especially for those who would otherwise be least likely to participate.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Leader", "text": "Has to Incorporate Chat Into the Meeting. Chat was frequently used to ask questions during meetings without interrupting the active speaker. Some participants expressed frustration that presenters often failed to read chat messages. P7, for example, doesn't use chat much because \"sometimes people put a comment in the chat, but by the time someone reads it, you've gone way past the point you were trying to make five minutes ago.\" In addition to questions, some users rely on meeting leaders to acknowledge their contributions and bring them into the main voice-based conversation. P18 described a co-worker for whom this is true: She uses the chat function a lot. Maybe she's not ready to speak yet, but she'll put her ideas in the chat during this specific meeting I'm referring to, and then maybe the SVP reads it, and if she likes it she'll say, 'Oh, I saw that Beth wrote something in the chat.' And then she's heard that way. P18 added that \"SVPs typically wouldn't use the chat. That medium lends itself to more junior management. \" She hypothesized one reason for higher usage by younger and more junior employees \"could be just comfort with our phones and technology, like growing up with the internet, and these platforms. \" P9's experience offers up an alternative explanation-that keeping track of chat when leading a meeting is just too difficult. \"They're using the chat to ask all these questions and I don't have time to divert from the training and read all of them and answer all of them. \" (P9) As a solution, P9 finds it \"useful to have someone on with me\" who can answer questions in her stead during trainings. This works well for those who ask questions, like P11 who said it \"doesn't particularly matter who answers the question\" as long as someone with the right knowledge does. Some meeting leaders who do not (or cannot) have others serve in this role expressed regret at being unable to incorporate chat messages-P8, for example, lamented that \"they do [use chat], but it's my fault\" for not reading it.\nIn either case, chat is a medium that is used more by junior meeting participants who typically have less authority in the meeting. But its full use still relies on those leading meetings-usually more senior participants-to acknowledge and incorporate the content therein as necessary. Unfortunately, incorporating chat into the main conversation is difficult, so many meeting leaders fail to do so. When chat use is encouraged and properly incorporated, however, participants reported that it lowered barriers to participation.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Chat", "text": "Lowers Barrier to Participation. As P2 stated, \"being able to just add a little chat comment in there feels really easy. You're not interrupting anyone, you don't have a whole room of people pivoting to look at you in the same way. So I think it feels like there's a lot more psychological safety in being able to add your opinions, your thoughts, or your comments. \" This was most beneficial for those who might otherwise be least likely to participate-e.g., people who are uncomfortable with public speaking. A lot of participation in chat comes from those who \"had there not been a chat, you might never have actually heard them because they might have been too hesitant to actually move into the flow of the conversation.\" (P2) Others echoed this sentiment. P14 hypothesized that big cross-organizational meetings saw more chat use because many were \"nervous to speak in front of all these people. \" P22 similarly expressed appreciation that chat \"allows people to participate, without leaving their comfort zone if they're introverted. \"\nAll our participants were fluent English-speakers in primarily English-speaking workplaces, but they also noticed how non-native speakers, or native speakers with foreign accents struggled to communicate verbally in professional meetings. P5 recounted how \"we have a couple Indian contractors who speak English fluently but have an accent, and I think sometimes maybe they don't feel as comfortable speaking up in a meeting if they feel like other people can't understand them well. They have a tendency not to talk in these meetings. \" Chat was presented as a tool that could alleviate the language issues many foreign employees face, in large part because \"at least you don't say the wrong thing if there's a language barrier. You can formulate the question first and make it right before submitting it.\" (P6) While these observations were second-hand-i.e., not from individuals who face language issues themselves-they are consistent with prior work by Satar et al. [50], who found that text-based computer-mediated communication was more effective than voice-based at reducing language anxiety for non-native English speakers.\nNot all of chat's use-cases require engagement from the active speakers or presenters. Chat also provides a way for meeting participants to share \"side thoughts\" (P16) without derailing the main voice-based conversation. \"You're not interrupting anyone\" (P2) when you communicate in chat, making it a useful tool for communicating information that is important, but that does not require others to actively engage with it. For example, \"if we've been in a meeting for three hours and I really want to use the bathroom\", P10 uses chat to write \"brb\". In other cases, parallel chat-based conversations allow substantive discussion about the meeting's content to occur when they might not otherwise have-for example, if the meeting is \"moving on to the next topic, but they still need to have a conversation about\" (P13) the previous topic.\nThe ability to communicate without interrupting also brings other benefits, such as frequent expressions of agreement, support, and/or gratitude. P2 remarked that \"unless it's a stump speech at a political rally no one's going to go 'yeah!' in the standard business meeting context. But you do get that in chat. 'Yeah that's a really good idea, I like that point' or 'that's interesting. \"' Many participants appreciated that chat enables these positive messages from colleagues. P9, for example, noted that the prevalence of positive messages \"feels like a cool team thing\". Other participants observed how this was unlikely to work in person or through a voice-based medium. P4, for example, imagined that \"If everyone were to do it, then it would be really loud and sound very horrible\", whereas text-based chat allows people to \"just type a thank you on the chat\".\nText-based chat also lets participants skirt the meeting recording feature. We now describe how and why this happens.", "publication_ref": ["b49"], "figure_ref": [], "table_ref": []}, {"heading": "Meeting Recording", "text": "VC software typically allows meeting audio and video to be recorded for later viewing. The ability to start and stop recording a meeting rests entirely with the designated meeting hosts-often the person or people leading the meeting. We find recording meetings to be a double-edged sword that provides crucial access to meeting content for some marginalized groups, while simultaneously reducing the meeting participation of other marginalized groups. Meeting leaders typically make fiat decisions about recording and, we argue, many of them do not sufficiently account for the trade-offs between recording's costs and benefits.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Meeting Leaders Make", "text": "Recording Decisions Unilaterally. Meeting participants are rarely asked for consent to record a meeting. P9, for example, recalled only one such instance:\nAnd then she asked every single person individually in the meeting, 'Do you mind if we record this?' And she wanted a verbal 'yes' from everyone. And some people are just like 'yeah' or they had their camera off and they were on mute and she was like 'Robert?', [and I felt] like 'this is awkward. ' I think that was the only time I experienced that. P9's experience reveals how unusual obtaining consent for recording is, and a potential reason why-VC software provides few features for obtaining consent to record, making it \"awkward\" to do so. Moreover, the power to control meeting recording is typically only given to certain users-often the meeting leaders, and sometimes groups of employees designated by company policy. At P10's company, for example:\nOne thing to note in our company, we don't have recording rights. I don't have permissions for that. It's the product managers who have those permissions. This concentration of technical power leads other meeting participants to take advantage of other features-e.g., camera and text-based chat-to limit their own appearance on meeting recordings. As we will now show, this alters meeting dynamics and behaviors in ways that are especially salient for certain disadvantaged groups of people-e.g., racial minorities, transgender individuals, and people who have previously had (or currently have) a speech disorder.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Meeting", "text": "Recording is a Double-Edged Sword for Bias. Recording a meeting can have harmful effects that are more pronounced for certain groups of people over others. Many of our participants reported feeling more self-conscious during recorded meetings because they perceived meeting content as permanent. As P21 said, \"you want to make sure, because it's permanent and it's gonna be out there forever, that you come off with the right impression.\" This is consistent with a robust literature comparing ephemeral and persistent online communication-e.g., Bayer et al. [4], who found that Snapchat use comes with reduced concerns about self-presentation because its content is automatically erased after being viewed, and He et al. [22] and Ma et al. [35], who found that users are more comfortable sharing information with others when they perceive it to be ephemeral.\nOur participants also described changing their behavior when a meeting was recorded, often by taking advantage of features that were in their control. The most common reaction was to turn off their camera which, as we already showed, can lead to reduced engagement and participation. P10, for example, \"wouldn't be as comfortable with keeping my video turned on in a recorded meeting, just because I would be more conscious, and I would have to take care that my expression isn't giving away something.\" P22 also turns off his video when a meeting is being recorded because \"I don't want to be immortalized doing something and having it be a meme. Like picking my nose or something. I mean that's kind of stupid, but I'm being honest here.\" P20 also reported turning off her video when a meeting is recorded, but her concerns centered on her experience as a Black woman in a predominantly white workplace:\nUsually if a meeting is recorded, I turn off my camera and will change my name. So as much as I can not show my own image and I can not put my full name, that usually makes me comfortable enough to speak if I want to participate or just be present and take it in. But usually I'm not super excited about video recordings of me, and that comes from a space of constantly having my image used to diversify things. Like they're always going to pick the five most diverse people, however that's determined, and stick their Zoom video squares together and be like 'this is the thing we did'. In addition to turning off video, some participants relied more on text-based chat to participate when a meeting was recorded. P10, for example: When a meeting is being recorded, yes, I do get more conscious. I don't want to unmute myself and say something. I at least gravitate towards the chat where no one's going to hear my voice. P11 recalled behaving similarly: If it's not recorded, I'll just unmute and answer for him because that's easier. But if it is recorded, I'm way more likely to just put '33' in the chat. This use was informed in part by knowing that chat would be \"hidden when it [the meeting] is recorded. \" (P7) In some cases, however, meeting participants were unable to behave in ways that made them adequately comfortable with meeting recording. The act of recording can, for example, make instances of discrimination more poignant. P13 recalled an uncomfortable situation where they were repeatedly misgendered during a recorded meeting, ensuring the negative experience would be \"there in perpetuity\" rather than being confined to a singular place and time. Moreover, P13 could not take advantage of turning off their camera because doing so made instances of misgendering more likely: I'm not on hormone replacement therapy at this time, so my voice is coded as female for a lot of people. I think when they hear my voice they automatically react to how it sounds rather than how I look, or what my pronouns are, or how I dress, or whatever. I mean, I always wear men's clothes, you know? I signal to people that I'm trans in other ways than my voice. But I think that, because meetings on Zoom or on the phone are so reliant on how people sound, I think people make a lot of assumptions based on the pitch of my voice, which seems incongruous with my physical appearance or presentation or identity.\nIn other cases, meeting participants cannot take advantage of features like text-based chat because of job expectations-e.g., when giving a presentation. P11 commonly found herself in this situation, and expressed deep discomfort with meeting recordings because of her childhood experience dealing with a speech disorder: I had a very severe speech impediment growing up, so I don't like public speaking. Can I do it? Sure. Do I want to? Absolutely not, because I hate being on recordings. I don't want there to be videos of me talking. Despite discomfort with meeting recording, our participants generally recognized its value. P6, for example, sees recording as primarily being there to serve \"people who aren't there to listen, that they can watch later. \" This is likely more important for workers who have a greater share of home-life obligations and need greater flexibility-most often women [13].\nEven when meeting attendance is not an issue, recordings still provide value because they can be consumed in an asynchronous format that allows for speeding up, slowing down, or replaying content. P22 remarked that people often \"talk slower than you can listen to\" so he often finds himself thinking \"I'm so glad this is recorded, because I can go back to it and listen to it on 2x speed. \" Conversely, P20 appreciates that \"for folks with cognitive disabilities that make processing in real time a little bit more challenging, we're able to record stuff really quick and easy.\" Thus, meeting recordings can increase efficiency while also providing crucial access for individuals who process meetings more slowly, such as those with dyslexia [59,60] or ADHD [20,48].\nHowever, despite meeting recordings' potential utility, many participants expressed skepticism about whether they are actually used. P11, for example, hypothesized that \"more often than not, people aren't going to end up watching meeting recordings. \" Other participants expressed the same thing. P12 assumed \"that most people don't even bother to view the recording afterwards,\" but, interestingly, still said \"I prefer not to be recorded. \" P10 echoed this: I know internally that no one's going to look at it, but it's still something that makes me extra conscious. Discomfort with meeting recordings was not contingent on knowing that the recording would be viewed by others. Participants commonly changed their behaviors in response to meeting recording-often in ways that reduced their meeting participation-but also assumed that the recording would not be viewed. If our participants' speculations are correct, meeting recording's harms during meetings are not likely to be balanced out by its benefits for others after meetings-i.e., recording's potential benefits do not actually accrue due to lack of use. This leads us to believe that many meeting leaders do not adequately engage with meeting recording's trade-offs.", "publication_ref": ["b3", "b21", "b34", "b12", "b58", "b59", "b19", "b47"], "figure_ref": [], "table_ref": []}, {"heading": "DISCUSSION", "text": "We begin our discussion by focusing on the four features of VC, synthesizing prior work alongside our results to describe how each feature contributes to bias. Then, we outline strategies VC system designers and future researchers can implement or explore to mitigate bias in VC systems for each feature, summarized in Table 2.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "User Tiles", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Lack of Spatial Fidelity Makes", "text": "Leaders Decide Who Speaks. CSCW researchers have long understood that the lack of shared physical space hinders spatial referencing in VC meetings-e.g., directing your gaze or pointing at someone [5]. Our results build on these findings by showing that spatial fidelity also influences prioritization in meetings. As P7 and P11 indicated, face-to-face meeting participants use a shared sense of space to make collective decisions about speaking order and priority. The inconsistent ordering of user tiles precludes this from happening, requiring", "publication_ref": ["b4"], "figure_ref": [], "table_ref": []}, {"heading": "Feature", "text": "Effects on Bias Causes of Leader Control", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Recommendations", "text": "User Tiles User tiles prioritize displaying participants whose cameras are on, making them even more likely to participate and pushing others to the \"back row\".\nThe lack of spatial fidelity prevents organic speaker orders like going around in a circle, so meeting leaders often have to decide who speaks when.\n• Display a single ordering of participants that is the same for all users. • Do not order participants based on whether their cameras are on/off. • Allow meeting leaders to generate random speaking orders.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Raise Hand", "text": "Raise hand is most useful for participants who have trouble interjecting.\nRaise hand is only used if the meeting leader explicitly says it should be, but meeting leaders rarely set explicit norms for its use.\n• Provide features for participants to anonymously communicate their preferred raise hand norms. • Adjust the feature so social expectations are communicated through its technical settings (e.g., by making it toggle-able).", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Text-based Chat", "text": "Text-based chat lowers barriers to participation, especially for those who might not otherwise participate.\nMany participants rely on meeting leaders to incorporate their text-based contributions into the main voicebased conversation.\n• Divert some of text-based chat's cluttering uses to other media (e.g., display status updates on user tiles). • Allow participants to anonymously nudge meeting leaders towards text-based chat.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Meeting Recording", "text": "Meeting recording is a double-edged sword; it negatively impacts some marginalized groups during the meeting, but provides crucial access for other marginalized groups after the meeting.\nMeeting leaders have complete technical control over whether a meeting is recorded, and do not have tools for easily obtaining consent from participants.\n• Provide tools for meeting leaders to obtain recording consent. • Allow participants to control how they appear on meeting recordings separately from the meetings themselves.\nTable 2. A summary of our findings in Results and corresponding design recommendations in Discussion. Each recommendation functions through one or both of the mechanisms detailed in Section 5.5-transferring control from meeting leaders and helping meeting leaders better exercise their control.\nmeeting leaders to decide who speaks when. While some VC systems (e.g., Zoom) allow for a common tile ordering to be set by the host, none of our participants reported using this feature and, in fact, none of this paper's authors even knew the feature existed during interviews. Participants must again rely on meeting leaders to take proactive steps whose benefits are unclear, unless perhaps they have read (or written) this paper.\n5.1.2 Tile Positioning Makes Likely Speakers More Visible. When given the responsibility to choose who speaks, participants report that leaders decide in systematically biased ways. Conceptualizing tile placement as a virtual form of seating arrangement allows us to draw from prior work in proxemics to understand how VC causes this. Steinzor [58] found that people in small conversational circles tend to speak to those immediately in front of them more than those by their sides. VC systematically positions those with cameras on-those who are already most likely to speak updirectly in front of meeting leaders, thereby further increasing the likelihood they will be engaged in conversation. VC can further exacerbate these biases because it is not constrained by physical limitations that apply in the face-to-face context, such as when 10 people occupy the first page on every meeting participant's interface because they have their cameras on. An analogous situation in person would be if everyone in the room were facing these 10 people, including the 10 people themselves. While impossible in a physical space, this is exactly the situation meeting participants are often confronted with in the VC-mediated virtual space.", "publication_ref": ["b57"], "figure_ref": [], "table_ref": []}, {"heading": "How to Mitigate", "text": "Bias. There are simple solutions to problems with visibility and tile order. First, VC systems could stop visually prioritizing the tiles of users with their cameras on, opting for a random arrangement instead. Future work should also explore other strategies for arranging user tiles; ordering participants by ascending order of speaking time could help equalize participation by making those who have spoken less more visible (and vice versa). VC systems could also make user tile ordering consistent between participants' screens, like Zoom has in the aforementioned buried feature. Alternatively, VC systems could add tools that let meeting leaders generate random speaking orders, thereby outsourcing decisions about who speaks next to transparent technical systems.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Raise Hand", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Raise", "text": "Hand Makes Meeting Participation Easier. Prior work has explored VC's raise hand feature in educational contexts, where hand-raising is more common. Noviyanti [39] and Smolenskiy and Levshin [57] have documented how the raise hand features makes it easier for students and conference participants, respectively, to ask questions. Our findings confirm and extend this literature, suggesting it is generalizable to professional meetings. P7 and P14 said that interjecting in VC meetings is more difficult because participants cannot effectively make use of body language cues. This is especially true for participants who have their cameras off. P8 also observed that raise hand is especially useful for people whose voices are marginalized, making the feature useful for reducing bias in meetings.", "publication_ref": ["b38", "b56"], "figure_ref": [], "table_ref": []}, {"heading": "VC Enables", "text": "Ambiguous Hand Raising Norms. Once again, however, the raise hand feature's ability to mitigate bias requires meeting leaders to encourage its use. Unless meeting leaders explicitly encourage meeting participants to use the raise hand feature, our participants said it was typically not used. At first glance, this seems to be a social problem with a \"straightforward\" social solution-tell meeting leaders to set explicit participation norms about raise hand. Indeed, this aligns with the existing literature that gives advice on how to better manage meetings (e.g., [17,19,28]). However, the UI implementation of this feature in most VC systems creates normative ambiguity around hand-raising. For example, the raise hand feature is often available by default for meeting participants to use-even in small meetings where participants might agree it should not or will not be used. The availability of the feature, therefore, does not signal anything about its expected usage in meeting participation.  [53] suggested this quality could make chat useful for supporting informal interactions at work because of its low personal cost for the receiver-i.e., it does not involve interrupting and can be ignored.\nOur findings reveal that this quality of also makes text-based chat useful for reducing bias in meetings. Many employees seem to prefer low-cost interactions even when communication is formal and work-related, and many of them do not contribute at all unless given a low-cost alternative to the main voice-based channel. In VC meetings, however, employees do not appreciate that their chat messages can be-and often are-ignored, so meeting leaders are saddled with greater responsibility to engage with chat.", "publication_ref": ["b16", "b18", "b27", "b52"], "figure_ref": [], "table_ref": []}, {"heading": "VC Makes", "text": "Chat Difficult to Incorporate. When meeting leaders fail to adequately incorporate chat, some participants-like P7-stop using it altogether, and its bias-reducing potential remains unrealized. Chat's implementation in contemporary VC systems contributes to this. On top of all their regular responsibilities in running a meeting, meeting leaders are expected to keep track of two separate communication channels simultaneously. As P22 mentioned, chat frequently becomes chaotic because it is used for multiple purposes-questions, comments, side-conversations, words of encouragement, etc. Some-like P9-get around this by enlisting help from a meeting co-facilitator whose sole responsibility is to keep track of chat. This is a costly solution, however, and the need for it could be mitigated by technical solutions, which scale much more efficiently.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "How to Mitigate Bias.", "text": "Making it easier for meeting leaders to incorporate chat in their meetings can reduce bias. VC systems could do this by enabling meeting participants to \"push\" messages to the main video feed, or anonymously nudge the meeting leader to look at chat. This would let participants make their low-cost communications more visible.\nVC systems could also reduce clutter by separating out different types of chat messages. For example, words of praise could be automatically detected and ephemerally presented elsewheresuch as a corner of the main video feed-to prevent them from drowning out questions and other substantive contributions to the meeting. Adding user status icons or custom status text-e.g., \"stepping away for a quick bathroom break\" on a participant's user tile-could also divert some of chat's usage to other media, leaving more room for substantive contributions to be noticed.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Meeting Recording", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Meeting", "text": "Recording Affects Groups Differently. Our findings on meeting recording extend a robust literature showing that users are more comfortable communicating through ephemeral media [4,22,35]. We similarly find that VC meeting attendees are more comfortable participating when their communication is ephemeral, and less so when it is persistent in a meeting recording.\nThe act of recording a meeting can therefore increase participation bias, because members of certain marginalized groups-e.g., P13, who was repeatedly misgendered in a recorded meeting-are affected more adversely by permanence. Conversely, meeting recording provides a means by which other marginalized groups-e.g., people with certain cognitive disabilities, as P20 mentioned-can access otherwise inaccessible meeting content. Recording is a double-edged sword and, once again, the onus for reaping its benefits and minimizing its costs lay almost entirely with meeting leaders.", "publication_ref": ["b3", "b21", "b34"], "figure_ref": [], "table_ref": []}, {"heading": "5.4.2", "text": "Recording is All-or-Nothing With Few Tools for Consent. To understand whether recording is appropriate, meeting leaders must know whether the recording is likely to be viewed later, and how individual meeting participants are likely to feel about being recorded. Meeting leaders are not likely to have this information, yet VC systems commonly give them unilateral and inalienable control over recording.\nAs P9 recounted, getting consent to record is difficult and awkward, so it rarely happens. Some VC systems like Zoom can be set to notify participants when recording begins, allowing anyone not consenting to leave the meeting. In practice, however, leaving a recorded meeting is rarely a viable option. And as we have already shown, turning off video is a sub-optimal solution that reduces the person's visibility in the meeting-not just in the recording.\nUnfortunately, recording in many VC systems is all-or-nothing; meeting hosts must record the entirety of a meeting's audio and video stream or record nothing at all. In some systems, the option to record audio only exists, but is often buried in a separate interface. Participants must therefore once again rely on meeting leaders to make use of the available features.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "5.4.3", "text": "How to Mitigate Bias. VC systems could reduce bias from recording by allowing meeting leaders to distribute control to other meeting participants. A feature that enables meeting leaders to quickly and efficiently obtain individual consent from users could encourage communication within organizations about recording's costs and benefits. Giving meeting participants more control over how they appear in recordings could also help mitigate participation bias. Several participantse.g., P20, P21, and P22-either turned off their cameras or were more conscious of their physical appearances when a meeting was recorded. Enabling them to keep their cameras on during the meeting, but prevent themselves from showing up in the meeting recording could have perhaps assuaged their concerns without requiring any changes to their in-meeting behaviors.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "How to Mitigate Bias: Two Primary Mechanisms", "text": "We find that VC systems give leaders excess control over key meeting parameters that affect bias. Meeting leaders are unable to delegate their control, ill-equipped to exercise it properly, or both, so our recommendations for how to mitigate bias function through at least one of two mechanismstransferring control from meeting leaders to technical systems or other attendees and helping meeting leaders better exercise the control they do wield. These are central to each of our previous recommendations, so we find this is a useful framework for bias mitigation in VC systems regardless of the specific feature being considered.\nFor example, our recommendation to make tile ordering consistent between users aims to transfer control from meeting leaders to the group as a whole with regards to speaking order. Our recommendation that VC systems enable participants to alter how they appear on meeting recordings follows from the same thinking about transferring control, despite its pertinence to a different feature entirely.\nThe same is true of the latter mechanism. VC systems can reduce bias by enabling meeting participants to anonymously provide information about their preferred hand-raising norms, or by making text-based chat less chaotic. In both cases, the aim is to help meeting leaders exercise their control-over hand-raising norms and text-based chat, respectively-in ways that enable broader participation.\nSelecting a mechanism (or combination of mechanisms) for a specific context must consider the cultural and contextual values of the organization. If reducing power imbalances is a primary goal, then transferring control from meeting leaders might be preferred. On the other hand, if the organizational culture is more hierarchical and deferential to authority, this may be difficult, and the emphasis may lean towards helping leaders exercise their control more effectively.\nVC systems' failure to leverage one or the other mechanism can persistently reinforce the marginalization of already-marginalized voices. We now outline how the marginalizing effects of one feature could compound with or mitigate those from other features.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Compounding or Mitigating Effects", "text": "Let us imagine a hypothetical employee, P0, and consider the following example in which all her routes to participation are suppressed:\n• Recording. P0 decides to turn off her camera to avoid showing up in the meeting recording.\nThis causes her to become less engaged. • User Tiles. P0 would like to participate, but turning her camera off has made her less visible to the meeting leader, so she is not brought into the conversation. • Raise Hand. P0 considers raising her hand to make a comment, but the meeting leader has not set clear norms around raising hands. She decides not to because it feels silly. • Text-Based Chat. P0 decides to put her comment in chat, but the meeting leader does not see it until 10 minutes later, by which time she has already tuned out of the meeting completely. She decides to stop using chat because it doesn't seem like an effective way to contribute.\nAt each step, our imagined participant's marginalization results from a meeting leader having too much control and/or not having the right tools to exercise their control appropriately. While hypothetical, this example illustrates how each of these features could plausibly work together to further marginalize participants who are already marginalized by one of them. Conversely, features such as text-based chat and raise hand, when used properly, can also help mitigate biases that arise from meeting recording and issues with tile placement. For example, had the meeting leader acknowledged P0's chat message, P0 would have been able to contribute to the meeting in some form despite the barriers imposed by meeting recording, tile placement, and ambiguous norms around raising hands. Notably, these barriers arise even in cases where the meeting leader fully intends to create an equitable meeting environment-i.e., it is in large part due to how VC makes meeting leaders assume control over meeting parameters they would otherwise not have to in person, but does not communicate any of these new expectations.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Limitations", "text": "We now outline some of our work's limitations. First, we focused primarily on VC meetings in English-speaking (almost all US-based) workplaces, and only interviewed employees who were fluent in English. Many of our findings may not apply to other contexts or cultures, and may not provide a complete picture with regards to the experience of non-native English speakers in Englishspeaking workplaces. For example, our findings with regards to text-based chat's perceived benefits for non-native speakers, while consistent with prior work, cannot serve as concrete evidence of chat's benefits for this group. Similarly, our use of snowball sampling limits the types of jobs and workers represented. For example, while our participants occupied a variety of industries, many of them worked at tech companies or in technical departments at non-tech companies.\nOur inquiry also had broad aims. We did not focus on a single type of meeting or-perhaps most importantly-a single population of marginalized individuals. More specific work that builds on our findings-for example, work that investigates the experiences of Black employees with meeting recording, or how transgender individuals use VC features to communicate their identities-could contribute richness and depth we do not provide here.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "CONCLUSION", "text": "This work contributes empirical findings that reveal how VC systems create bias in workplace meetings. We show that bias in VC often results from excess control being pushed onto meeting leaders. Our design recommendations emphasize two important mechanisms for reducing biastransferring control from meeting leaders and helping meeting leaders better exercise their control. For both pragmatic and ethical reasons, we hope the knowledge provided here will help move VC systems towards designs that produce more equitable outcomes in workplace meetings.", "publication_ref": [], "figure_ref": [], "table_ref": []}], "references": [{"ref_id": "b0", "title": "The intellectual challenge of CSCW: the gap between social requirements and technical feasibility", "journal": "Human-Computer Interaction", "year": "2000-09", "authors": "Mark S Ackerman"}, {"ref_id": "b1", "title": "Bias in the workplace: Consistent evidence of sexual orientation and gender identity discrimination 1998-2008", "journal": "Chicago-Kent Law Review", "year": "2009", "authors": "M V Lee Badgett; Brad Sears; Holning Lau; Deborah Ho"}, {"ref_id": "b2", "title": "Nonverbal overload: A theoretical argument for the causes of Zoom fatigue", "journal": "", "year": "2021", "authors": "Jeremy N Bailenson"}, {"ref_id": "b3", "title": "Sharing the small moments: ephemeral social interaction on Snapchat", "journal": "Information, Communication & Society", "year": "2016-07", "authors": "Joseph B Bayer; Nicole B Ellison; Sarita Y Schoenebeck; Emily B Falk"}, {"ref_id": "b4", "title": "Shared spaces: transportation, artificiality, and spatiality", "journal": "Association for Computing Machinery", "year": "1996", "authors": "Steve Benford; Chris Brown; Gail Reynard; Chris Greenhalgh"}, {"ref_id": "b5", "title": "Impact Of Employee Participation On Job Satisfaction, Employee Commitment And Employee Productivity", "journal": "", "year": "2007-06", "authors": "Khalid Komal; Tahir Masood Bhatti;  Qureshi"}, {"ref_id": "b6", "title": "Nonverbal Behavior and Communication in the Workplace: A Review and an Agenda for Research", "journal": "Journal of Management", "year": "2016-07", "authors": "Silvia Bonaccio; Jane O' Reilly; Sharon L O'sullivan; François Chiocchio"}, {"ref_id": "b7", "title": "How to avoid Zoom fatigue while working from home", "journal": "", "year": "2020", "authors": "Sweta Bothra"}, {"ref_id": "b8", "title": "The Video Call Platforms that Dominate the World", "journal": "", "year": "2021", "authors": "Robert Brandl"}, {"ref_id": "b9", "title": "Thematic analysis", "journal": "American Psychological Association", "year": "2012", "authors": "Virginia Braun; Victoria Clarke"}, {"ref_id": "b10", "title": "Second generation Caribbean black male youths discuss obstacles to educational and employment opportunities: a critical race counter-narrative analysis", "journal": "Journal of Youth Studies", "year": "2018-04", "authors": "Anthony Q Briggs"}, {"ref_id": "b11", "title": "Large Scale Analysis of Multitasking Behavior During Remote Meetings", "journal": "Association for Computing Machinery", "year": "2021-04", "authors": "Hancheng Cao; Chia-Jung Lee; Shamsi Iqbal; Mary Czerwinski; N Y Priscilla; Sean Wong; Brent Rintel; Jaime Hecht; Longqi Teevan;  Yang"}, {"ref_id": "b12", "title": "Research on Household Labor: Modeling and Measuring the Social Embeddedness of Routine Family Work", "journal": "Journal of Marriage and Family", "year": "2000", "authors": "Scott Coltrane"}, {"ref_id": "b13", "title": "Towards accessible remote work: Understanding work-from-home practices of neurodivergent professionals", "journal": "", "year": "2021", "authors": "Maitraye Das; John Tang; Kathryn E Ringland; Anne Marie Piper"}, {"ref_id": "b14", "title": "Hair matters: Toward understanding natural black hair bias in the workplace", "journal": "Journal of Leadership & Organizational Studies", "year": "2019", "authors": "Katherine A Gail A Dawson; Joy V Karl;  Peluchette"}, {"ref_id": "b15", "title": "Accents in the workplace: Their effects during a job interview", "journal": "International Journal of Psychology", "year": "2010", "authors": "Anne-Sophie Deprez-Sims ; Scott B Morris"}, {"ref_id": "b16", "title": "Videoconferencing Etiquette: Promoting Gender Equity During Virtual Meetings", "journal": "Journal of Women's Health", "year": "2021", "authors": "Natasha Dhawan; Molly Carnes; Angela Byars-Winston; Narjust Duma"}, {"ref_id": "b17", "title": "Social translucence: an approach to designing systems that support social processes", "journal": "ACM Transactions on Computer-Human Interaction", "year": "2000-03", "authors": "Thomas Erickson; Wendy A Kellogg"}, {"ref_id": "b18", "title": "How to run a great virtual meeting", "journal": "Harvard Business Review", "year": "2015", "authors": "Keith Ferrazzi"}, {"ref_id": "b19", "title": "Processing Speed Weakness in Children and Adolescents with Non-Hyperactive but Inattentive ADHD (ADD)", "journal": "Child Neuropsychology", "year": "2010-11", "authors": "L Timothy; Cecilia Goth-Owens; Michelle M Martinez-Torteya; Joel T Martel;  Nigg"}, {"ref_id": "b20", "title": "Virtually in this togetherhow web-conferencing systems enabled a new virtual togetherness during the COVID-19 crisis", "journal": "European Journal of Information Systems", "year": "2020", "authors": "Janine Hacker; Jan Vom Brocke; Joshua Handali; Markus Otto; Johannes Schneider"}, {"ref_id": "b21", "title": "Preserving User Privacy Through Ephemeral Sharing Design: A Large-Scale Randomized Field Experiment in the Online Dating Context", "journal": "", "year": "2020", "authors": "Yumei He; Xingchen Xu; Ni Huang; Yili Hong; De Liu"}, {"ref_id": "b22", "title": "Gender Stereotypes in the Workplace: Obstacles to Women's Career Progress", "journal": "Emerald Group Publishing Limited", "year": "2007", "authors": "Madeline E Heilman; Elizabeth J Parks-Stamm"}, {"ref_id": "b23", "title": "African American Women in the Workplace: Relationships Between Job Conditions, Racial Bias at Work, and Perceived Job Quality", "journal": "American Journal of Community Psychology", "year": "1997", "authors": "Diane Hughes; Mark A Dodge"}, {"ref_id": "b24", "title": "Energizing the \"Zoom-bie\" Experience: Understanding virtual meetings through the influence of speaking times on perceived meeting satisfaction", "journal": "", "year": "2021", "authors": "Ingrid Bronken; Jakobsson ; Tucker Woodham Brock"}, {"ref_id": "b25", "title": "Meetings Matter: Effects of Team Meetings on Team and Organizational Success", "journal": "Small Group Research", "year": "2012-04", "authors": "Simone Kauffeld; Nale Lehmann-Willenbrock"}, {"ref_id": "b26", "title": "Global Workforce Diversity Management: Challenges across the World", "journal": "EDP Sciences", "year": "2021", "authors": "Daniela Kharroubi"}, {"ref_id": "b27", "title": "Optimizing Virtual Team Meetings: Attendee and Leader Perspectives", "journal": "American Journal of Health Promotion", "year": "2021-06", "authors": "Liana Kreamer; George Stock; Steven Rogelberg"}, {"ref_id": "b28", "title": "Managerial use of video conferencing", "journal": "Information & Management", "year": "1994", "authors": "Christine T Kydd; Diane L Ferry"}, {"ref_id": "b29", "title": "Our love/hate relationship with workplace meetings: How good and bad meeting attendee behaviors impact employee engagement and wellbeing", "journal": "Management Research Review", "year": "2016", "authors": "N K Lehmann-Willenbrock; J A Allen; D Belyeu"}, {"ref_id": "b30", "title": "The critical importance of meetings to leader and organizational success: Evidence-based insights and implications for key stakeholders", "journal": "Organizational Dynamics", "year": "2017", "authors": "Nale Lehmann-Willenbrock; Steven G Rogelberg; Joseph A Allen; John E Kello"}, {"ref_id": "b31", "title": "Perceived workplace gender-bias and psychological impact: The case of women in a Moroccan higher education institution", "journal": "European Journal of Training and Development", "year": "2019-01", "authors": "Siham Lekchiri; Cindy Crowder; Anna Schnerre; Barbara A W Eversole"}, {"ref_id": "b32", "title": "Remote Work: The Biggest Legacy Of Covid-19", "journal": "", "year": "2020", "authors": "Gad Levanon"}, {"ref_id": "b33", "title": "Women of color are surging into the U.S. workforce, causing a historic first in who's getting hired -The Washington Post", "journal": "", "year": "2019-10", "authors": "Heather Long; Andrew Van Dam"}, {"ref_id": "b34", "title": "Perceived ephemerality, privacy calculus, and the privacy settings of an ephemeral social media site", "journal": "Computers in Human Behavior", "year": "2021-11", "authors": "Xiaofen Ma; Yuren Qin; Zhuo Chen; Hichang Cho"}, {"ref_id": "b35", "title": "Managing a Homosexual Identity within a Heteronormative Workplace Environment", "journal": "The Sociological Imagination: Undergraduate Journal", "year": "2015-07", "authors": "Kyle Militello"}, {"ref_id": "b36", "title": "Bias in the Nursing Workplace: Implications for Latino(a) Nurses", "journal": "Journal of Cultural Diversity", "year": "2012", "authors": "Joane T Moceri"}, {"ref_id": "b37", "title": "Multiview: improving trust in group video conferencing through spatial faithfulness", "journal": "", "year": "2007", "authors": "T David; John Nguyen;  Canny"}, {"ref_id": "b38", "title": "STUDENTS' PERCEPTION ON THE UTILIZATION OF ZOOM VIDEO CONFER-ENCING IN IMPROVING SPEAKING ABILITY AMIDST COVID-19 PANDEMIC", "journal": "ELLTER Journal", "year": "2022-04", "authors": "Dinda Rachmitha; Noviyanti "}, {"ref_id": "b39", "title": "Weight bias in the workplace: A literature review", "journal": "", "year": "2015", "authors": "Behdin Nowrouzi; Alicia Mcdougall; Basem Gohar; Behnam Nowrouz-Kia; Jennifer Casole; Fizza Ali"}, {"ref_id": "b40", "title": "Leading synchronous virtual teaching sessions", "journal": "The Clinical Teacher", "year": "2021", "authors": "E Chloë; Michael Nunneley; Kathryn M Fishman; Rachel E Sundheim; Robert H Korus; Blair A Rosen; Katherine A Streater; Lori R O'donnell; Carolyn H Newman;  Marcus"}, {"ref_id": "b41", "title": "Understanding cybersecurity challenges of telecommuting and video conferencing applications in the COVID-19 pandemic", "journal": "Journal Homepage", "year": "2020", "authors": "Kenneth Okereafor; Phil Manny"}, {"ref_id": "b42", "title": "Distance matters", "journal": "Human-computer interaction", "year": "2000", "authors": "M Gary; Judith S Olson;  Olson"}, {"ref_id": "b43", "title": "How executive coaching can change leader behavior and improve meeting effectiveness: An exploratory study", "journal": "Consulting Psychology Journal: Practice and Research", "year": "2009", "authors": "D Robert;  Perkins"}, {"ref_id": "b44", "title": "Council Post: The Year Of The Knowledge Worker", "journal": "", "year": "2020", "authors": "Ricard Sébastien"}, {"ref_id": "b45", "title": "Infographic: Zoom Retains Pandemic Gains As Hybrid Work Is Here to Stay", "journal": "", "year": "2021", "authors": "Felix Richter"}, {"ref_id": "b46", "title": "Meeting analysis: findings from research and practice", "journal": "", "year": "2001", "authors": "N C Romano; J F Nunamaker"}, {"ref_id": "b47", "title": "Slow processing speed: a cross-disorder phenomenon with significant clinical value, and in need of further methodological scrutiny", "journal": "European Child & Adolescent Psychiatry", "year": "2020-10", "authors": "Nanda Rommelse; Marjolein Luman; Rogier Kievit"}, {"ref_id": "b48", "title": "A meta-analysis of empirical studies of weight-based bias in the workplace", "journal": "Journal of Vocational Behavior", "year": "2009", "authors": "Charles L Cort W Rudolph; Marcus D Wells; Boris B Weller;  Baltes"}, {"ref_id": "b49", "title": "The Effects of Synchronous CMC on Speaking Proficiency and Anxiety: Text Versus Voice Chat", "journal": "The Modern Language Journal", "year": "2008", "authors": "H ; Müge Satar; Nesrin Özdener"}, {"ref_id": "b50", "title": "The ties of meeting leaders: A social network analysis", "journal": "Psychology", "year": "2015", "authors": "Nils ; Christian Sauer; Simone Kauffeld"}, {"ref_id": "b51", "title": "Work-Life Conflict During the COVID-19 Pandemic", "journal": "Socius", "year": "2021-01", "authors": "Scott Schieman; Philip J Badawy; Melissa A Milkie; Alex Bierman"}, {"ref_id": "b52", "title": "A comparison of chat and audio in media rich environments", "journal": "Association for Computing Machinery", "year": "2006", "authors": "Jeremiah Scholl; John Mccarthy; Rikard Harr"}, {"ref_id": "b53", "title": "ENHANCING MEETINGS: The Impact of Leader Behavior", "journal": "PACM on Human-Computer Interaction", "year": "2019-04", "authors": "Vivien E Schuleigh; John M Malouff; Nicola S Schutte; Natasha M Loi"}, {"ref_id": "b54", "title": "Effects of Meeting Leader Training on Meeting Attendees", "journal": "Journal of Leadership Education", "year": "2021", "authors": "Vivien E Schuleigh; John M Malouff; Nicola S Schutte; Natasha M Loi"}, {"ref_id": "b55", "title": "Five Theoretical Lenses for Conceptualizing the Role of Meetings in Organizational Life", "journal": "Cambridge University Press", "year": "2015", "authors": "Cliff Scott; Joseph A Allen; Steven G Rogelberg; Alex Kello"}, {"ref_id": "b56", "title": "The Problem of Determining the Video Conferencing Platform Criteria for Online Learning", "journal": "Springer International Publishing", "year": "2022", "authors": "Mikhail Smolenskiy; Nikolay Levshin"}, {"ref_id": "b57", "title": "The spatial factor in face to face discussion groups", "journal": "The Journal of Abnormal and Social Psychology", "year": "1950", "authors": "Bernard Steinzor"}, {"ref_id": "b58", "title": "A processing speed deficit in dyslexic adults? Evidence from a peg-moving task", "journal": "Neuroscience Letters", "year": "2006-05", "authors": "Catherine J Stoodley; John F Stein"}, {"ref_id": "b59", "title": "The cerebellum and dyslexia", "journal": "Cortex: A Journal Devoted to the Study of the Nervous System and Behavior", "year": "2011", "authors": "Catherine J Stoodley; John F Stein"}, {"ref_id": "b60", "title": "Supporting collaborative virtual meetings using multi-agent systems", "journal": "IEEE", "year": "2009", "authors": "Phil Thompson; Rahat Iqbal; Anne James"}, {"ref_id": "b61", "title": "Labor force projections to 2024: the labor force is growing, but slowly", "journal": "U.S. Bureau of Labor Statistics", "year": "2015", "authors": "Mitra Toossi"}, {"ref_id": "b62", "title": "Working through COVID-19:'Zoom'gloom and 'Zoom'fatigue", "journal": "Occupational Medicine", "year": "2021", "authors": "Nerys Williams"}, {"ref_id": "b63", "title": "Employee participation and the influence on job satisfaction of the 'new generation' of Chinese employees", "journal": "The International Journal of Human Resource Management", "year": "2015-10", "authors": "Ying Zhu; Yuhua Xie; Malcolm Warner; Yongxing Guo"}], "figures": [{"figure_label": "1", "figure_type": "figure", "figure_id": "fig_0", "figure_caption": "Fig. 1 .1Fig. 1. The two primary user views on Zoom. Images retrieved from Zoom's support website on May 25, 2022: https://support.zoom.us/hc/en-us/articles/201362323-Adjusting-your-video-layout-during-a-virtual-meeting", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "fig_1", "figure_caption": "PACM on Human-Computer Interaction, Vol. 7, No. CSCW1, Article 121. Publication date: April 2023. \"All of the White People Went First\" 121:11", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "fig_2", "figure_caption": "PACM on Human-Computer Interaction, Vol. 7, No. CSCW1, Article 121. Publication date: April 2023. \"All of the White People Went First\" 121:21", "figure_data": ""}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_2", "figure_caption": "5.2.3 How to MitigateBias. Bias could be mitigated by making hand-raising norms clearer. This could be done with UIs where technical settings communicate social expectations, in what Erickson and Kellogg would classically describe as \"social translucence\"[18]. VC systems could implement a feature where raise hand was off by default, and meeting participants could anonymously request that the meeting leader toggle the feature. The technical ability for meeting participants to raise their hands might become interpreted as a social invitation to raise them, while also giving meeting participants a low-cost way to ask meeting leaders to set participation norms. Low Cost of Chat Can Reduce Meeting Bias. Many of text-based chat's benefits in our results were because it enabled participants to communicate without interrupting. This corroborates prior work by Scholl et al.[53] who found that users in a multi-media communication environment (video, audio, and chat) often preferred communicating through chat because it felt less intrusive. Scholl et al.", "figure_data": "5.3 Text-based Chat5.3.1"}], "formulas": [], "doi": "10.1145/3579597"}
