{"title": "Usability Study of Security Features in Programmable Logic Controllers", "authors": "Karen Li; Kopo M Ramokapane; Awais Rashid", "pub_date": "2022-08-04", "abstract": "Programmable Logic Controllers (PLCs) drive industrial processes critical to society, e.g., water treatment and distribution, electricity and fuel networks. Search engines (e.g., Shodan) have highlighted that Programmable Logic Controllers (PLCs) are often left exposed to the Internet, one of the main reasons being the misconfigurations of security settings. This leads to the question -why do these misconfigurations occur and, specifically, whether usability of security controls plays a part? To date, the usability of configuring PLC security mechanisms has not been studied. We present the first investigation through a task-based study and subsequent semi-structured interviews (N=19). We explore the usability of PLC connection configurations and two key security mechanisms (i.e., access levels and user administration). We find that the use of unfamiliar labels, layouts and misleading terminology exacerbates an already complex process of configuring security mechanisms. Our results uncover various (mis-) perceptions about the security controls and how design constraints, e.g., safety and lack of regular updates (due to long term nature of such systems), provide significant challenges to realization of modern HCI and usability principles. Based on these findings, we provide design recommendations to bring usable security in industrial settings at par with its IT counterpart.", "sections": [{"heading": "Introduction", "text": "Industrial Control Systems (ICS) are the systems and devices that monitor, manage, and enable human control of industrial processes of critical infrastructures (e.g., electricity, water) [11,1,22]. PLCs are computing devices that control the physical processes through inputs and outputs via sensors and actuators. As such they are the fundamental component of the ICS infrastructure. They are usually connected and configured through Human Machine Interfaces (HMIs). HMI is a visualization system whose primary purpose is to present data to the operator.\nHigh profile attacks, such as those on the Ukrainian Power Grid 1 and other indus-trial facilities (e.g., the Florida water treatment attack 2 ) have highlighted the security risks of connected industrial infrastructures. These risks are exacerbated by the wide accessibility of PLCs on the Internet. For instance, at any given point in time a large number of PLCs and other controllers used in such infrastructures are visible-and in many cases remotely accessible-on Shodan 3 . But, to what extent is this open visibility and accessibility down to potential misconfiguration of security settings? A detailed example of such misconfiguration is reported in a year-long observational study, conducted between March 2016 and March 2017, by Foley [7]. He discovered a misconfiguration which had exposed a PLC operating a public utility infrastructure onto the Internet. After contacting the infrastructure owners-outlining the vulnerabilities and suggesting a possible solution-and following acknowledgment of receipt, he tracked the subsequent changes for a year. He found that while many configurations took place, the reported device was never correctly configured for a year. At some point, the reported open port was closed, but another critical port was left open, leaving the same system vulnerable. Incidents such as the one reported by Foley, coupled with the accessibility of large numbers of PLCs on Shodan and the authors' own observations of the complex workflows required to configure PLCs 4 , naturally beg the question as to why such misconfigurations arise and the extent to which usability of security or lack thereof plays a part.\nSignificant efforts have been made in various areas to help protect PLCs, ranging from studies of attacks and vulnerabilities [21,42] to intrusion detection systems [9,12,32,15], and testbeds [15,8]. However, to date, no prior work has examined the usability of security mechanisms available to users configuring PLCs: whether they are suited to the task at hand, the challenges the users may face when configuring security and their potential impact-resulting in PLCs being available widely on the Internet. In this paper we address these very questions.\nIn IT environments, such as enterprise settings, efforts to understand and improve the usability of configuring security mechanisms are well understood [16,41,13,18,19,36,2,34]. However, prior literature has not investigated the usability of configuring the security mechanisms of PLCs. To bridge this knowledge gap, we conduct an exploratory study with 19 participants to understand their usability perceptions and the challenges they encounter when configuring the security mechanisms for PLCs. We evaluated a connection configuration and two common PLC security mechanisms (i.e., access level controls and user administration) in a lab environment using a Siemens S7-1200 5We found that the complexities of configuring security mechanisms of PLC lie in the process itself: complex navigation, misleading terminology, and the use of unfamiliar icons and cues. These findings suggest that PLCs lack modern usability design and patterns to help users configure security mechanisms effectively. For instance, while cues and dialogs play a vital role in configuring mechanisms in an IT environment, in case of PLCs, such cues and signals carry a different meaning than their IT counter-parts. The interfaces \"look\" dated since they cannot be upgraded frequently for safety reasons and to ensure up-time and reliability of the infrastructure. In some cases, this design inconsistency creates a mismatch between what operators are used to in their everyday lives and what they must deal with at their workplaces. The lack of such basic consistencies fundamental to usability makes configuration and verification (of correct settings) difficult for users.\nIn summary, we make the following contributions:\n• To our knowledge, ours is the first study to investigate the usability of security configuration mechanisms for PLCs. First, we conducted a task-based study using a Siemens PLC, then reviewed the same configurations for Allen Bradley/Rockwell and Mitsubishi PLCs-finding commonalities in the configuration process. Using the flow diagrams of the completed tasks, we demonstrate where usability challenges for operators lie in the configuration process, consequently providing empirical evidence on where usability can be improved.\n• We uncover several factors that underpin the usability challenges encountered by PLC operators. Some of these complexities are introduced by the design and deployment considerations of PLCs (e.g., Flashing LED feature) and HMIs (e.g., crammed interface), which makes addressing some of these challenges complex-more than updating the interface or adding capacitive screens (such as those used in smartphones and tablets).\n• Our work also shows that understanding PLC operators and their role is significant to improving security in ICS settings. For example, by uncovering operators' usability perceptions, we show that most procedures in configuring PLCs are designed to fit the technology to its functionality/use (i.e., PLCs are designed to complete a task safely and reliably not to be easy to operate) rather than the functionality to the operator, which is a common theme behind usable security studies.\nIT Environment ICS Environment Operating system managed by IT professional.\nOperating system managed by Control Engineers and Operators. Software updates are typically applied in a timely fashion (including security patches -often automatically) Software updates are far between each other. Vendor testing and schedule must be in place for ICS outages.", "publication_ref": ["b10", "b0", "b21", "b6", "b20", "b41", "b8", "b11", "b31", "b14", "b14", "b7", "b15", "b40", "b12", "b17", "b18", "b35", "b1", "b33"], "figure_ref": [], "table_ref": []}, {"heading": "Standard communication protocols and typical IT networking practises", "text": "Proprietary and standard communication protocols with complex networks.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Components are usually local and easy to access", "text": "Components can be isolated, remote and require extensive physical effort to access. System specified with enough resource to support the addition of applications such as security solutions.\nLimited computing resources to support the addition of security capabilities.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Table 1: ICS and IT environment differences 2 Background", "text": "There is a significant amount of literature on usable security, mainly focusing on IT but none on ICS domain. In fact, in general, security in ICS is still at the infant stage; concerns, traditions, practices, and potential solutions are yet to be established. However, to successfully improve the usability of configuration security mechanisms in ICS like in IT environment, there is a need to understand better the ICS environment, devices, and the people who work in this area.\nIT and ICS environments do not only differ in terms of software and hardware, but the way they meet their functionality demands (Table 1). ICS equipment is functionality critical and designed to operate in a harsh environment, while IT systems are modern, powerful, and constantly advancing at an unprecedented scale. IT systems are also easy to reach and regularly updated, improving their usability and functionality all the time. On the other hand, ICS run on legacy firmware, and upgrades and updates are usually far apart, leaving them old and unpatched. Furthermore, updates can easily be pushed remotely to IT devices, but for ICS, engineers must plan for weeks or months in advance, with exhaustive pre-deployment testing [24]. IT devices also have better screens that provide a high level of intuition for users, while ICS still depend on HMIs which are typically small and designed to run and configure devices out in the field, sometimes in places without internet connection.\nRegarding usable security, IT space is well established; challenges have been studied extensively resulting in mature principles and design patterns that can be followed to help users configure security mechanisms. Unfortunately, in the ICS space, usable security is not well understood; there are a lot of unknown knowns, for instance, constraints and challenges that operators and engineers must deal with when configuring systems have not well been established. However, as the number of threats in ICS space increases, usable security will be critical-understanding the usability of configuring security mechanisms can help mitigate against potential attacks.", "publication_ref": ["b23"], "figure_ref": [], "table_ref": []}, {"heading": "Methodology", "text": "To understand the usability of configuring PLCs security mechanisms, from October 2019 to March 2020 (just before the pandemic and lockdown measures were put in place), we invited 19 participants to configure the security mechanisms of a Siemens S7-1200 PLC followed by a semi-structured interview. We also used cognitive walkthrough and the think-aloud protocol [3,31,25,26]; participants completed the tasks whilst describing their the decisions behind each action. The researchers observed and took notes.", "publication_ref": ["b2", "b30", "b24", "b25"], "figure_ref": [], "table_ref": []}, {"heading": "Ethical considerations", "text": "This study was reviewed and approved by our institutional ethics review board (IRB). Before taking part in the study, participants were given a participants information sheet and a consent form. The participants information sheet contained all the information Under Siemens S7-1200, users can configure four access level. Setting the access level and password restricts access to some functions and memory areas without a correct password. The four levels are as follows:\nNo protection -Configurations can be read and modified by anyone; Write protection -Configurations can be read without a password while every other modification require valid password; Write/Read protection -Gives access to HMI and diagnostic data only; Complete protection -No access and modification to configurations without valid password.\n• To configure these access levels, the user must first right click on the Central Processing Unit (CPU) in the project and then on properties on the resulting panel (From Task 1).\n• Then, under the \"General\" tab, they are required to click on \"Protection & Security\" and then click \"Access Level, \" which will display all the access level controls.\n• To configure complete protection, which means setting passwords to all the other three levels, the user must select the last level before setting the passwords for other levels. A failure to select this particular level first means that the user will not be able to set any passwords and would receive a small pink error message \"the password has to be entered\".\nThe purpose of Task 2 was to examine the usability of configuring access level control mechanisms. Access level control is an important security mechanism for managing or restricting access to different features (e.g., memory) and configurations of a PLC. To explore this, participants were asked to provide \"Complete protection\" to all access levels (i.e., restrict access without password) of the PLC. Participants were expected to navigate to the access level control menu, select the appropriate level, and then provide passwords to all the other levels. A successful task involves a participant being able to navigate to access level control mechanisms, selecting \"Complete protection\" option, and then setting passwords to all the other levels.\nThe purpose of this task was to investigate the usability of the process of connecting a PLC to a PC. We studied this procedure because connecting a PLC to PC is a standard procedure in ICS settings for any configurations. To investigate this, we asked participants to link a provided PLC to the PC that was already connected physically to a PC through an ethernet cable. We expected participants to link and verify the connection between the PLC and the PC, either using the IP Address we provided or the Ethernet cable. A successful connection is achieved when the participant can flash the LED lights on the PLC.\nTo connect a Siemens S7-1200 PLC to a computer, a user would need to load a TIA portal. If there is no existing project, then they would need to create a new one by clicking on \"create new project. \" After a project has been created, the user then needs to configure the device. To configure the device, they first need to add the device, which involves finding the right PLC type and version from the provided dropdown menus.\n• The next step involves them to right-click on the added PLC and then properties.\n• On the resulting screen, under the \"General\" tab, the participant is then required to locate and click on 'ethernet addresses' on the inside left pane.\n• The user is then asked to provide the method of connection, ethernet cable, or provide a valid IP address.\n• After this, the user must then click \"Go online\". To confirm if the PLC is connected, the participant must search for the PLC by clicking on \"start search\".\n• Once the PLC is found, the option to flash the LED lights on a PLC is made available. By checking the \"Flash LED\" box will flash the LEDs on the actual PLC device. This is optional.\n• Once completed, the user would click \"Go Online\". The \"Go Online\" means connecting to the PLC so one can upload logic or send commands.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Task 1 Task 2", "text": "To protect applications against unauthorized operations, users are allowed to set up access protection for data and other functions of the PLC by creating accounts and groups for other users. HMI is a user interface that allows users to manage or control industrial control devices.\n• To create a new HMI user account, the administrating user must add a HMI device to one's PLC project, a new interface appears and ask users to select a HMI to connect to the PLC.\n• Participants are then asked to create a login button within the HMI screen. They would then need to double click \"User administration, \" to create their individual login.\n• Under the HMI project, the administrating user must then select the user tab located at the top right corner.\n• Then, they must double click \"Add new\" under the user tab to add a new username and password for a new user. They will be required to confirm the password before being asked to ratify the changes. The administrating user can create and simulate the HMI to test the new login details.\nThe purpose of this task was to examine the usability of creating and testing an HMI user account. Creating an HMI user is a common practice for adding new operators. In this task, we asked participants to create an HMI user interface/device with a login button, then create a user account to test if the created HMI is working. We expected participants to add a new HMI device to the existing PLC project, and then create an HMI screen with a login mechanism. Afterward, they were to create a user account (i.e., username and password) before testing them on their HMI screen. A successful procedure includes the participant being able to login successfully into the created HMI screen using the details of the newly created user.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Task 3", "text": "Figure 1: Tasks used in our study about the study, the study's main objectives, what was expected of the participants, and how data from the study will be handled and stored.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Experiment Design", "text": "We designed a task-based study focusing on configuring a Siemens S7-1200 PLC followed by a semi-structured interview. Siemens PLC mechanisms are configured through the Totally Integrated Automation Portalfoot_5 (TIA portal). TIA is designed to give operators unrestricted access to many Siemens digitized automation services.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Task-based exercises", "text": "Our task-based exercises aimed to observe participants configuring the mechanisms of a PLC. They were not designed to test participants' abilities or how long they took, but to understand how they configured the mechanisms.\nWe designed three tasks (explained in detail in Fig. 1). The first task required the participants to connect the PLC to the computer using the TIA portal. The second task focused on configuring the access level control of the PLC, while the third task was aimed at examining the usability of creating and testing an HMI user account. Completing Task 1 first was critical since Tasks 2 and 3 were dependent on the accomplishment of Task 1 (if participants failed to complete Task 1, they would be helped to complete the task). The main plan was to get participants to walk the researchers through the whole configuration process, describing what they were doing and their reasoning while being observed by researchers. At the end of each task, we asked participants about the task, how they found the task and the challenges they experienced when completing the tasks.\nWe chose a connecting task (PLC to PC) because it is standard for operators to set this up before they can configure anything on the PLC. Task 2 and 3 involve common mechanisms (i.e., identification and authentication) for protecting the PLC and the processes that the PLC automates. They are commonly used for enforcing identification, authentication and confidentiality [14]. Lastly, we chose a Siemens PLC because Siemens has the highest share of the market [27]. However, at a high level, the steps to configure some of these security mechanisms are similar with most brands (i.e., Allen Bradley/Rockwell, Siemens, and Mitsubishi); (see Appendix D).", "publication_ref": ["b13", "b26"], "figure_ref": [], "table_ref": []}, {"heading": "Post Study Interview", "text": "The task-based exercises were followed up by semi-structured interview questions, which aimed at understanding their perception of configuring security mechanisms and thoughts on how the configuration process could be improved. For example, we asked participants which task was challenging to complete and what could be improved to make the configuration task easy to complete. Our interview guide is provided in Appendix B.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Study Protocol", "text": "All the study sessions were conducted in person by the lead researcher except for two, where the second researcher was present. Participants who agreed to take part in the study were first invited to our lab-at their own convenient time. Before taking part in the study, each participant was given the study information sheet and consent form. The study was carried out in two phases: the task-based exercises and the post study semi-structured interview.\nAfter consenting to take part in the study, participants completed the three taskbased exercises (Task 1 to Task 3). All three tasks took approximately 55 minutes to complete. For the task exercises, we employed two methods: informal cognitive walk-through and think-aloud approach. A cognitive walk-through is a task-specific approach modeled after the software engineering practice of code walking-through used to examine the usability of a product [31]. It allows the researcher to define a single task or set of tasks that participants have to complete while researchers take notes of their observations. To capture these thought processes as participants completed the task, we adopted a coaching method [26]. The coaching method is a variant think-aloud technique which allows the researcher to probe, prompt, and encourage participants to describe their actions while completing the tasks. We probed and observed participants to increase the reliability of our data. There is evidence that users sometimes do not report their actual practices during studies [38,37]. Observation ensured data triangulation which is usually missing in many usability studies. Once the task-based exercises were complete, the lead researcher conducted the final exit interview with each participant. Each interview took an average of 15 minutes. After the interview, each participant completed a short demographics form. At the end of each session, participants were reminded of the study objectives and the withdrawal process. The lead researcher then thanked them for volunteering to take part in the study.", "publication_ref": ["b30", "b25", "b37", "b36"], "figure_ref": [], "table_ref": []}, {"heading": "Pilot User Study", "text": "Before we finalized our study design, we conducted a pilot study with two participants with knowledge of ICS and configuring PLCs. The goal of this pilot study was to confirm that the task objectives were clear-we would get meaningful results, and the study was not time-consuming and physically demanding. In addition to simplifying the language, the pilot study also helped us to reduce task complexities. For instance, we removed parts of the task that involved using WIFI and connecting to servers. While pilot study participants helped to improve the study, their sessions are not included in the analysis and the results.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Recruitment", "text": "Evaluating mechanisms that require specific skills is complicated as one needs to recruit people who configure such mechanisms as part of their jobs or have proficient skills. The main challenge, however, is that these people are usually trained to configure these mechanisms and may be biased towards what they currently have and use and not be able to give a fair opinion. For instance, due to familiarity and adaptability, such participants may not report challenges fairly since they have developed workarounds to address the problem. Recruiting inexperienced users has its shortcomings as well; they may find the mechanisms not usable because they have no experience of configuring them or because of first-time use. However, inexperienced participants may provide plentiful opinions concerning the configuration process. To reduce biases and maximize feedback, we recruited both experienced (n=13) and inexperienced participants (n=6). In the context of this paper, experienced participants are users who configure PLCs as part of their job or people who have proficient skills to configure PLCs. Inexperienced participants are users who may have configured PLCs (or other ICS machinery) before (e.g. engineering/placement students or interns), but they considered themselves having low skills to configure PLCs.\nWe recruited participants through our existing professional networks and encouraged participants to invite their colleagues to take part in the study (snowball sampling [10]). Before accepting participants, we asked them to fill a screening questionnaire that aimed at balancing the demographics and finding out whether they had  16) participants identified as Male, while three (3) were as female. Regarding experience in configuring PLCs, thirteen (13) considered themselves experienced while six (6) considered themselves as less experienced. configured a PLC before, and with which brand of PLC were they familiar. The purpose of the screener was to ensure that we interviewed participants who had experience or at least had configured PLCs before. Despite our efforts to use the screener to also balance the demographics, particularly gender, majority of our respondents were adults who identified themselves as males, 3 as females. Control system engineering field has long been dominated by males [30].\nIn the end, we managed to recruit 19 participants to complete the study. Out of the 19, 16 reported having configured PLCs before, but only 13 of them considered themselves experienced, while the other three (3) stated that they had configured PLCs before, they did not consider themselves experienced. The rest of the participants (n=3) stated that they knew about control systems but had no configuration experience. Our participants included six (6) from electrical or electronics engineering, four (4) from mechanical or mechatronics engineering while the rest were from computer, software, or civil engineering. The majority of our participants were in full-time employment (6) followed by engineering students (5) while others were either contractors, trainees from industry, or retired. Table 2 summarizes the demographics of our study.", "publication_ref": ["b9", "b29"], "figure_ref": [], "table_ref": ["tab_0"]}, {"heading": "Data Analysis", "text": "Once the study sessions were transcribed, two researchers independently analyzed the observation notes and the interview transcripts (i.e., for all the tasks) using the inductive thematic qualitative approach [4,5]. The second researcher first independently coded the lead researcher's observation notes and two transcripts to produce a low-level but detailed codebook. The lead researcher then coded a single transcript from the two that the second researcher used and updated the codebook with more low-level codes. Both researchers then met and discussed the codebook, similar codes were merged, and some code description were refined. After both researchers agreed on the codebook, the coding of other transcripts started. The inter-coder agreement, Cohen's kappa, was calculated to be 0.78, indicating a \"substantial\" agreement between coders [6]. We then grouped similar and related codes to form themes covering a wide range of areas. The research team then discussed the key themes around users' perceptions, suggestions, and challenges of configuring the security mechanisms of PLCs.\nFor all the disagreements during coding, the two researchers worked collaboratively and through a series of discussions (i.e., arguing to consensus [17]) to resolve discrepancies between the coders. During this process, we either refined the code book if the disagreement was attributed to some inconsistency in our understanding or invited a third opinion.", "publication_ref": ["b3", "b4", "b5", "b16"], "figure_ref": [], "table_ref": []}, {"heading": "Threats to Validity and Limitations", "text": "Despite our efforts to recruit a more balanced sample, we acknowledge that this work has several limitations.\nFirst, due to the specific skills required in this study, configuring a PLC, our pool of participants was limited since we needed participants who had experience or were working with PLCs. This also affected diversity; we only managed to recruit participants who identified as males. Therefore, our results may overstate men's preferences and opinions, ignoring those of other genders who are PLC operators. Future confirmatory studies could use more representative samples and investigate the effect of gender on the usability of security mechanisms of PLCs.\nSecond, some of our participants are PLC operators who are normally trained to use PLCs, and it is possible that they did not report all the issues they encountered because they are used to seeing and working around them. This study involved a set of specific tasks and software (i.e., TIA Portal and Siemens). This means the participants who have worked with Siemen's portal before could have introduced their own biases to the study or applied mitigation strategies during the tasks (e.g., shortcuts). Moreover, participants who have never used Siemens could have found the usability of configuring security mechanisms challenging because they have never used Siemen's portal before. Despite this limitation -the results offer different perspectives and perceptions of security usability in PLC configurations.\nThird, we provide the first study to understand the usability of configuring security mechanisms of PLCs but acknowledge that the results are not generalizable. Our review of configuring other PLCs indicated similarities in the configuration process (See Appendix D), which indicates that the same challenges may manifest in configuring PLCs from other vendors.\nFourth, we acknowledge that the order of tasks could have influenced our findings in two ways. Firstly, participants' perceptions of the last tasks may have been largely influenced by their experience of the first tasks. For example, participants may have compared Task 2 and 3 to Task 1 or compared the two tasks, rather than judging each task independently. Comparing tasks may mean the last task is mostly compared to the previous task. Secondly, participants may have experienced fatigue while completing some of the tasks. Participants may have explained or been attentive on other tasks than others due to fatigue, or lack of interest, which is common in usability studies [29,35].\nLastly, we only managed to recruit 19 participants for our study. However, this is a good sample for qualitative work as we also managed to reach saturation point during our coding after the 13 th script. To ensure no more new codes were present, we interviewed until the 19 th participant. These limitations do not invalidate our results; our study provides valuable insights on the usability of configuring the security mechanisms of PLCs.", "publication_ref": ["b28", "b34"], "figure_ref": [], "table_ref": []}, {"heading": "Results", "text": "Our results spans four key usability concepts: communications, navigation, visuals, and features as shown in Figure 2. Our theme Communication includes notions around how the interface communicates with participants, whereas Navigation theme is more involved with the participants' interactions with the interface while configuring mechanisms. Visuals, as a theme, includes concepts that are about what the participants see on the interface, and Features, as our last theme, covers interface items needed to complete the configurations. Using these concepts, we discuss the factors that underpin participants' usability challenges while configuring PLC security mechanisms (Section 4.1). We then discuss participants' usability perceptions (Section 4.2), and suggestions that participants shared to improve usability (Section 4.3). The key findings from our study can be summarized into four high-level concepts, Communications, Navigation, Visuals, and Features.", "publication_ref": [], "figure_ref": ["fig_0"], "table_ref": []}, {"heading": "Where The Complexity Lies", "text": "We observed several complexities which leads to misconfigurations or pose challenges to users. These observations are not based on participants reports, but what we as researchers found during the study. We discuss these complexities below and show through Figure 3 the three tasks and where complexities lie. Figure 3 also shows which steps during the tasks pose more challenges or where most participants faced challenges.", "publication_ref": [], "figure_ref": ["fig_1", "fig_1"], "table_ref": []}, {"heading": "Crammed interface.", "text": "We observed participants struggle to find features or items they needed to configure the security mechanisms. Due to the number of items, they spent more time searching for relevant items. Most of them would hover over icons to get their description, while others scrolled through all the panes in search of items. Many items and features on the interface made locating specific features difficult, frustrating, and time-consuming.\nFlash LED feature.\nTo verify if the PLC is connected to the PC, the interface allows users to flash the LED on the actual PLC device through a checkbox 'Flash LED' option. However, during the connection tasks, some of the participants did not intuitively use this checkbox to test if the PLC is connected, they directly clicked 'Go online'. This could be due to a number of factors such as: they have not seen the feature, they do not find it necessary, or unsure of what it does.\nUnclear error messages. When participants configure the access level controls while they are still online, the interface greys out most fields and prevents them from making any changes. There is an error message which informs participants that the local configuration and online file are not identical. The majority of participants got confused by  this error message and ended up trying to find ways of syncing both files. We observed similar confusion when participants encountered other error messages.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Lack of confirmation dialog and buttons.", "text": "The lack of confirmation messages confused some participants during all the con-figuration tasks. After making changes, they expected to have a confirmation dialog either to confirm their action or to be notified of the configuration changes. Also, since there are no confirmation messages, we observed that most participants resorted to self-verification of the configurations or parameters. Self-verification prevented some errors, but not all, moreover, it was tedious. Similarly, participants expected a 'save' button to push their changes, especially after setting the IP address. Without a button, most hesitated to continue with the setup. We also noticed that participants who were uncertain about whether their changes were saved, they had closed and reopened the configuration window to confirm their changes.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Lack of guidance.", "text": "We observed that the interface does not provide any guidance to users to help them complete the configuration tasks. Also, it does not anticipate possible misconfigurations from users and does not react kindly to the configuration errors when they happen. For instance, when users attempt to configure access level control while online, the interface does not let users know that they needed to go offline to make any changes to the configuration files. It only alerts them about having non-identical configuration files.\nGrey Color Scheme. The use of color grey as the primary background color for the interface confused most of the inexperienced participants, particularly concerning editable fields. There seems to be little to no difference between editable fields and the grey background. Many participants failed to distinguish the differences hence ending up confused as to what they needed to do to complete the tasks. Moreover, concerning greyed out items, we noticed that often participants would attempt to expand the screen in order to have the full view of the screen. Other participants would scroll around or randomly click on the screen, hoping to get some response from the interface.\nUnusual Ordering. The ordering of the access level control settings confused most participants. When asked to configure complete protection for access level control, most participants attempt to change the first option (top option) on the list, which is No protection. The ordering appears to be unnatural considering the nature of mechanism; participants expected the top option to provide complete protection.\nToo Many Clicks. The number of clicks users have to perform to navigate to the right mechanisms introduces another source of complexity. The interface gives users the ability to navigate to these mechanics through various routes. However, some of these routes are longer and introduce mistakes. For example, to configure access level controls, users are required to navigate to 'Protection and Security,' which for some participants involved too many clicks, especially those who used the tree on the left panel. A high number of clicks meant users were likely to make mistakes or found locating the controls they needed more challenging.\nComplex operations. Configuring Complete Protection in the access level control mechanism was complex and confusing to some participants. To configure this, participants are required to select 'Complete Protection' (the last option on the list) but then set passwords to the top three levels of the access level control mechanisms. This process left some participants confused as to why they had to put passwords on the levels which they had not selected. Some expected to provide a password to just the selected option, not the other levels since Complete Protection meant all other levels were protected.\nConfusing use of familiar words. Participants were attracted to familiar labels. For instance, while searching for Access Level Controls, participants were more likely to click on 'Security Settings' than on 'Protection and Security'. In the TIA portal, 'Security Settings' contains security policies which confused some participants. We observed that using familiar words to mean things with which users were unfamiliar left some users frustrated. The use of familiar labels to mean something else also meant participants took more time searching for the right features and items.\nPoor signals or unfamiliar cues. Participants misinterpreted the signals from the interface during the configurations. They confused the orange/amber colors for mistakes and errors. When a PLC goes online successfully, an amber/orange line appears at the top row. To the majority of participants this implied there were some errors when this happened.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Participants' Perceptions of Security Usability", "text": "Our observation also reflected in the think aloud and interviews; and additional themes were added. Qualitative analysis of data from the think-aloud protocol and interviews revealed that participants' usability perceptions span three main concepts: communication, experience, and visuals.\nPoor Communication. The majority of the participants highlighted that the interface was not useful at communicating with them during the configuration process. They stated that the interface lacked dialogs, confirmation messages, and clear error messages. They expressed that the lack of confirmation and error messages leads to confusion, explaining that they were never assured about whether they were completing some steps correctly. All our inexperienced participants stated that the interface failed to notify them that they needed to be offline in order to complete this task.\n\"I think the confusing part for me is going offline to edit stuff and then coming back online\" P16, Inexperienced\nThe majority of participants reasoned that the error messages from the TIA portal were horrible and not useful during the configuration process.\n\"Oh [curse] is it doing authentication by you ask for whatever you want? Oh [curse], that's horrible\" P8, Inexperienced Some participants highlighted that the use of the grey color within the interface was confusing at times, especially when it involved a grey text-box to fill or edit. These participants explained that some grey boxes were editable while others were not, so in most cases, they confused the two, either thinking it was not editable when it was or vice versa.\n\"I can still click on it, but this one is in grey. But before when I was on grey, it means I couldn't click on it.\" P5, Inexperienced Moreover, when some participants could not edit the disabled grey text boxes, they assumed that it was because they did not have elevated privileges.\n\"Purely based on not being given admin rights, as such.\" P3, Experienced \"... so, I need to login, I suppose, with another user in order to have elevated privileges.\" P9, Experienced\nOther participants stated that the interface failed to show that their changes were accepted after updating some particular fields. For instance, after updating the IP address of the PLC, the interface did not signal to them that their changes were updated and saved.\n\"...Then there's no kind of save or anything so I'm just going to go out of it. And because there's no save, I'm rechecking.\"P12, Experienced Misleading terminology, icons, and cues. A point of consensus among participants was how certain terms, icons, and cues were used. The majority reported that the interface was full of 'bad' labels and wordings, which at times led to confusion. Some participants reported that the TIA portal had misleading cues. They stated that the TIA portal used cues with which they were unfamiliar, for instance, using an orange color to show that the PLC is connected rather than using the green color. They explained that orange or amber usually signified a warning while green meant everything was okay.\n\"...There is the orange bar to prove it. Which I think should be a neutral color. I think if there is a warning it would turn orange. Danger is red. Green means its connected. But Neutral color should be nothing has changed -no sign or danger.\" P14, Inexperienced They informed us that they were attracted to \"security\" while setting access level controls because it was more related to what they wanted to configure, but instead, they found that it contained information about security policies. Also, concerning the labeling, some participants cited that some wording was vague and confusing, for example, \"Go online,\" participants explained that it is not clear because it could mean connecting the PLC to the internet, which was not what they wanted to do.\n\"Although, I think that it is slightly misleading, if I'm honest, because online you'd think of the internet as opposed to a local connection.\" P17, Experienced Too much information. All the inexperienced participants stated that the interface had too much information and it was distracting.\n\"I think with five PLC you should not need all this out to you. It would distract you and frustrate you by this amount of information.\" P11, Experienced Two of our participants explicitly reported that the interface was not pleasant to use, and it caused some eyestrain after a while. They stated that having to search for items around the screen and the small text caused some stress to their eyes.\n\"Is there a way to make the screen bigger? Cause I am sure squinting my eyes is a health and safety problem.\" P13, Experienced Unfamiliar Layout and features. Other participants informed us that the order of the access level control was unfamiliar. They stated that they expected the control that provides the maximum protection to be at the top rather than the bottom of the list since it covered all the levels. Participants also informed us that the interface had many boxes or panes, which made locating certain features challenging.\n\"I think initially when you're looking at the interface, there's so many categories, subcategories, items that potentially could lead to [mistakes]. I was a bit overwhelmed at first as to... I think it's possibly more to do with just looking around, looking through the interface and trying to find what you're looking for and the icons does not explain for itself. It can sometimes be mistaken for something else\" P16, Inexperienced Experience needed. Several participants acknowledged the difficulty of configuring the security mechanisms and expressed the need for training or getting used to the interface. Some suggested that some experience is needed to be able to configure these mechanisms. One experienced participants said:\n\"When I was just an apprentice -it was [curse] a lot to take in. But after a few years under my belt, it was not hard to do it, but I can't say I understand it completely.\" P1, Experienced.\nWindows '98 Vibe. Some participants, particularly inexperienced users, suggested that the interface was old, messy and industry like, while experienced users suggested that it was 'ok' for industry standard. Some suggested that the grey color was not approachable, while others explained that too many unnecessary features made locating security features challenging.\n\"Yeah, it does have a... Windows '98 vibe.\" P7, Experienced \"It is not the color, it is also the whole organisation of everything, like it is so dated, so messy, so industrial product like.\" P6, Inexperienced Complex Navigation Flow. According to our participants, navigation around the interface is complex; finding items is challenging, and the interface lacks directions to help the user. They suggested that the interface has many items, especially menus, which is confusing. Some experienced users stated that, since they do not always configure these mechanisms, they also find locating items challenging because of the number of features on the screen. Others informed us that they expected the interface to help them during the configuration process, for instance, the interface showing them the next step.\n\"I would like instructional messages for example the online and offline when doing the online and offline. I was confident when the lights flash, for sure. Because it shows a successful and completed task or connection.\" P13, Experienced Some participants noted us that there are too many \"clicks\" involved in completing the tasks, while others stated that they did not understand why they sometimes have to double click while completing the task. Some participants suggested that it was difficult to predict where an item would pop-up sometimes items opened at the top other times at the bottom. This made it challenging for them to notice changes in the interface. In addition to the above factors, other participants cited the lack of 'save' button as unusual which made configuring security mechanisms a challenge.\n\"Something to save my settings. Or is that already saved?\" P19, Experienced", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Usability Suggestions", "text": "We now present participants' suggestions on how the usability of PLC security mechanisms configurations can be improved. These suggestions have been organized into four themes: (1) communication; (2) navigation; (3) features; and (4) color scheme. We include participants' quotations from the interviews to represent their views and ground the emerged themes.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Communication", "text": "Tell me what I am doing wrong. The majority of the participants would like to have more informative and clear messages. They suggested that error messages should be improved to provide detailed and clear information and at the right time. For example, participants needed to go offline to complete Task 2 or set up Access Management, but the interface does not make this clear. Many participants were left frustrated by this because they did not understand what they were doing wrong.\n\"I don't care what the interface looks like, I just want it to tell me when I'm going wrong...\"P8, Inexperienced.\nThe majority of our informants suggested that the interface should help them complete the setup configurations, for instance, instructions on what to do next.\n\"But I think some changes would be desirable to have such as the instruction messages for the access levels would be useful to have.\" P1, Experienced.\nOthers suggested improving the wording: \"It should say 'Live Mode' or something to say that this PLC is now live.\"P13, Experienced.\nReduce information and number of items. Some participants suggested that the amount of information on the interface should be reduced, stating that the reduction of information would help navigation. Others suggested reducing items in the interface, such as the number of menus.\n\"I think that it can be improved, yes. For example, you can display devices here and reduce the scope. Yeah, but you still need a lot of time to try and get the right answer, I think. It's a lot of information here.\" P9, Experienced. Dont just blink, tell me more. Two of the participants recommended that the interface should not just present cues but provide more information. This was about Task 1, where participants we asked to connect the interface to the PLC, when the PLC is successfully connected to the portal, one of the LED lights on the PLC flashes.\n\"It should not just blink, but not provide more info...\" P6, Inexperienced.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Navigation", "text": "I need a better flow process. Other participants proposed that the flow of operation should be simplified. One participant further noted that the challenge was not the information but the flow of what they needed to do. \"I would not simplify the amount of information, but I would develop the 'flow' of how the information is presented.\" P11, Experienced.\nWhat's next! Some participants, particularly those who struggled with navigation, suggested that the interface should provide some help or direction on what to do when they are stuck. For example, after adding the IP address during Task 1, what users should do next is not made obvious.\n\"If I have to improve the TIA Portal, it would be to give me directions and save buttons.\" P1, Experienced.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Features", "text": "I want to verify. In relation to the number of concerns over verification, the majority of participants recommended the addition of the confirmation mechanisms to the setup process. For example, after adding a new password to the access level, participants mentioned it would be beneficial to confirm that the password has been updated.\n\"I am checking my steps again and again, so it's nice to have a confirmation about if I've completed one step in order to proceed to the next one.\" P9, Experienced.\nHelp me 'save'. The majority of the participants proposed a 'push' button to allow them to save their changes. They highlighted that majority of the procedures do not include a save or push button; as a result, not making it evident to them that their changes have been saved.\n\"I even commented that they should have you know, put an 'apply' or 'whatever' button\" P6, Inexperienced.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Color scheme", "text": "Give colors a meaning. While most of our participants suggested color change, some specifically recommended that error color should be improved, for instance, the color used in cues should change based on the configuration status. They suggest this would help them understand the configuration status better. When participants went online during Task 1, an orange bar/line appeared on the portal followed by a few icons; this led to some participants assuming they had encountered an error which was not the case. This was just a sign they had connected to the PLC, but they interpreted it as a warning sign. \"Color should change based on configurations\" P14, Inexperienced.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Recommendations", "text": "Our findings show that the best practices found in HCI studies have not been deployed in ICS environments. This has led to a detrimental effect on the usability of security configuration mechanisms. Therefore the usable security in the ICS field lags approximately 20 years behind usable security in IT settings -as highlighted by seminal works in 1999 [40,28]. Our recommendations are derived to address those issues, and they draw upon best practices in HCI. We aim to draw attention to the importance of usable security and highlight how embedded practices (e.g., use of legacy terminology) and the specific nature of ICS (e.g., devices designed for longevity rather than usability) pose key challenges. We also provide a mapping between users' challenges, where these challenges have occurred the most, and the possible ways of addressing them in Table 3 -found in Appendix C.\nAddressing interface design issues. Participants found the wording, colors, and cues used in the interface confusing. While configuring the connection between PLC and PC, participants confused wording such as 'Go Online' to mean connecting to the internet. Moreover, when asked to connect the PLC using an IP address, most participants searched for \"network configurations.\" Also, the use of an orange color to show a successful connection led to many misinterpretations, participants interpreting it to mean a warning. Participants found searching for a particular feature time consuming. By following the current interface design patterns, reliable and established solutions to interface design, most problems can be solved. Tidwell [33] suggested that a simple user interface is required if users are experiencing challenges when finding items. It is important to show the most important features upfront, and let users reach for the hidden items by a single simple gesture would save time and effort.", "publication_ref": ["b39", "b27", "b32"], "figure_ref": [], "table_ref": []}, {"heading": "Recommendations:", "text": "1. Use clear and modern interface terminologies and cues, e.g., the orange color should be used to show a warning instead of a successful connection. 2. Adopt modern and commonly used interface design patterns. For example, use breadcrumbs and labels to show users the path from where they started to their current page. This can also include showing users only features relevant for the task at hand. Confirmatory feedback. Most participants found it difficult to proceed with configurations without confirming their changes. We believe that this is counter-intuitive to participants' mental models of always having a button or a confirmation dialog to approve changes before proceeding in more usable interfaces. Prior studies [39] on mental models show that sometimes people apply mental models from other settings to the situation at hand. In our study, we found that participants preferred to manually confirm their changes by closing and re-opening the configuration window, which was time-consuming. Without save buttons and confirmation dialogs, it is challenging for users to know whether their changes have been applied. These features will also improve the navigation and communication of errors-users would know what to do next and also understand what they are doing wrong.", "publication_ref": ["b38"], "figure_ref": [], "table_ref": []}, {"heading": "Recommendation:", "text": "1. Add confirmation dialogs to help users confirm changes. 2. Improve primary actions such as saving changes by including and making a 'save' button standout.\nReduce confusion over navigation path. Our findings show that participants click many times to find the right mechanisms. Because of this some participants mix and confuse navigation paths during configurations. We also recommend that the number of steps to configure some mechanisms such as access level control should be reduced. We contend that this would reduce complexity (reduce confusion over navigation path) and effort required to configure the mechanisms.\nRecommendation: Reduce cognitive load and complexity by reducing the number of steps to complete tasks. This can include navigation tabs, breadcrumbs, and progressive disclosures. For example, paths can be broken down into sections, or non-essential information and items could be hidden from users.\nSimplify configuration process. In addition to decreasing the navigation steps to reduce complexity, we also suggest to simplify the configuration process by providing users with some cues during configurations of the security mechanisms. In our study, many participants explained that the interface lacked guidance and direction. Most participants struggled with configuring the access level control mechanisms because of the way it presented to them. Using a more straightforward mechanism where users can quickly tick and provide a password for the desired access level would reduce the complexity of configuring the access levels. We also observed participants spending much time searching for the right items; some make use of tooltips to find the right icons. Providing such help would reduce the time taken to configure and verify the configuration settings and allow PLC operators to complete other responsibilities.\nRecommendation: Provide suitable cues to help users complete tasks. Use design patterns such as wizards; break the task into dependable sub-tasks.\nTesting mechanisms. Participants struggled to test their configurations; they spent a lot of the time trying to figure out how to test whether their configurations were successful. We posit that this is due to the lack of instructions to verify configurations and unusual testing mechanisms. We, therefore, recommend that the testing mechanisms and instructions should be clear to users. They should also be visible to avoid complexity.\nRecommendation: Introduce testing mechanisms with clear instructions. Users could be shown the new configuration before they continue.\nHelp mechanisms. During all the tasks, some participants used their devices to search for solutions when faced with some configuration challenges. Only two participants attempted to use the inbuilt help mechanism but decided against after realizing how it was organized and worked. Providing a suitable mechanism would help operators to stay within the application and not risk using other help mechanisms that would leave the plant vulnerable (e.g., connecting to the internet to search for solutions).Moreover, we also observed that providing clear instructions on how to perform certain tasks can help users configure complex configurations, e.g., setting Access Level Controls.\n3. Provide updated documentation as soon as it is available. 4. Provide post report of changed configurations to help reduce misconfigurations.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Discussion", "text": "6.1 Lack of \"Product Usability\" Our analysis indicated that PLCs are generally designed with a lack of usability considerations but for reliability and endurance [23]. TIA Portal was designed to configure PLCs out in the field when there were no powerful computers [20]. The interface resembles what operators will see on the HMI, crammed with a long, complex navigation flow. There is also an issue of terminology; the terminology used in the ICS field has not evolved the same way as in the IT space, \"going online\" in an ICS environment does not mean connecting to the internet. These differences cause much confusion on operators who are both IT and ICS devices users. We posit that solving usability issues will not work by simply updating the TIA portal. ICS equipment run critical infrastructures, which must provide robust safety features and real-time properties that operators may not be interested in tempering with. Moreover, simply upgrading the portal to provide usable security may disregard the expertise of the operators who configure these PLCs and make systems work. Security, in this case, will get in the way of engineers, and it may be costly to train all operators on how to use the new portal. Overall, our study and findings reveals the interplay between the design constraints and the operators' usability perception of configuring PLCs. It highlights the different aspects (absent in IT environments) that designers of PLC need to consider to help improve security in PLCs. Our findings reiterate the importance of usable security but in legacy systems and our recommendations solve those challenges. More work is needed such as assessing usable security in other ICS devices -such as HMIs and SCADA (Supervisory Control and Data Aquisition) platforms -in order to provide a more refined set of requirements.", "publication_ref": ["b22", "b19"], "figure_ref": [], "table_ref": []}, {"heading": "Experience vs Usability", "text": "Participants' usability suggestions imply that experience (or training) plays a vital role in the perception of usability. As we suggested in Section 3.5, experienced users tend to develop mitigations strategies over time and may ignore some usability challenges they face. For example, experienced participants in our study did not find any issues with not having a save button and the number of items on the screen. They did not suggest any improvements regarding them. This study presents the first evidence that operators and their role may play a vital role in bringing usable security to PLCschanging the interface may significantly impact operators' everyday tasks-leading to more misconfigurations. Studies should consider that PLC operators are also IT users, HCI principles and patterns more established in IT settings affect them in their everyday life outside the work environment. Research should explore how these differences influence their approach to usability when configuring PLCs; what do operators expect when working with PLCs, what mistakes do they usually commit, how do they recover from mistakes?", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Conclusion", "text": "We illustrated through this study that the security of legacy systems, especially that of PLCs, lags behind other sectors. Our findings show that usable security such systems matters and requires special attention from security researchers and practitioners. Particularly, there is a need to consider the specific design and deployment contexts in this regard-systems often lack the computational capability and graphical interfaces that are the norm in IT environments while operators need to contend with terminology and configuration processes that may be counter intuitive to what they typically encounter and \"learn\" in IT settings. Future studies should, therefore, aim to understand these nuances with regards to terminologies, idiosyncrasies of the industrial environment as well as constraints such as inability to update the systems due to their longstanding nature and need for uninterrupted operation and up-time. Designs for usable security will need to consider the interplay between such constraints and best practice HCI principles and guidelines. Our study and design recommendations are a stepping stone in this regard. • Where would you first look?\n• Why would you look in there?\n• What words are you searching for?\n• Would you use the function?\n• How do you know its connected?\n• How would you test it?\n• (If participant did not Flash LED) Would you flashing the LED lights make you confident that the PLC and PC are connected?\n• That concludes this study, how did you find it? and what did you find difficult and easy?\nTask 2: Configuring Access Levels\nIn the second task you are going to have to protect this PLC using a password. I need you to go to access level and set up four passwords for the four accesses. These are Read access, HMI access, no protection and complete protection. Where would you first look? I would need you to setup a password for each level. Please remember your passwords as this will be used to test if the configuration was a success. I can make note on your passwords or you may use the suggestions on the piece of paper in front of you. Your choice.\n• Where would you get the access level?\n• Why do you think its greyed out?\n• Is it because you are online? Why do you not think that is the case?    ", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "A Practical Study Script", "text": "We present our study guide and interview questions below.\nIntroduction: I have assumed you have read the participants information sheet? If not, don't worry I will give you a bit more detailed brief. So in front of you is a Siemens PLC. This study is about completing a practical series of PLCs configuration tasks. You will be guided if you found yourself stuck; and this is not in any form a test of your abilities or capabilities. We asked you to use a think aloud protocol whilst completing this study. So please, just talk about what you see on the screen and what your thoughts are. There are four practical studies and a short interview after. This • Why do you think its not allowing you to enter the password?\n• Could you now try adding the passwords please?\n• How would you test that the configuration has been a success?\n• That concludes this study, how did you find it? and what did you find difficult and easy?\nTask 3:HMI simulation/User Administration • So where would you add its function?\n• Right, so you added a login button to your HMI, can you create yourself a user login and password to test this?\n• Do you think its because you are not a user administrator?\n• Whats the difference between user group and individual?\n• Could you start the simulation?\n• Where do you think is the start simulation?\n• That concludes this study, how did you find it? and what did you find difficult and easy?", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "B Post Study Interview Script", "text": "This is the last part of the study, so in this short interview I want you to reflect on your whole experience in this study.\n• Can you tell me what your perception of the user interface was?\n• How did you find completing the tasks?\n• What task was easy and why?\n• And what are the challenges you found when trying to complete the task?\n• Why did you find it difficult? (would you say the interface was difficult due to a lack of dialogue?)\n• How would you improve the interface?\n• What would you change to the PLC configuration design?\n• Did you understand the information flow between the PLC and PC? ?\n• How do you feel about this overall study and do you have any questions? • Use clear and modern interface terminologies and cues.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Lack of Guidance", "text": "Participants struggling to find features and/or properties.\n-Right Click on PLC -Configure the Ethernet Address -Click Go Online\n• Provide suitable cues to help users complete tasks.\n• Use clear and modern interface terminologies and cues.\n• Provide updated documentation as soon as it is available.\nParticipants not knowing how to proceed.\n-Right Click on the PLC • Reduce cognitive load and complexity by reducing the number of steps to complete tasks. • Provide suitable cues to help users complete tasks.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Lack of confirmation dialog and buttons", "text": "Lack of usable methods to verify setup -Configure the Ethernet Address • Improve primary actions such as saving changes. Include and make a 'save' button standout. • Add confirmation dialogs to help users confirm changes.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Confusing use of familiar words", "text": "Participants struggled with the use of some terminologies.\n-Click \"Go Online\" button • Use clear and modern interface terminologies and cues.\nFlash LED feature Lack of instruction on how to test connectivity.\n-Flash LED feature.\n• Introduce testing mechanisms with clear instructions.\nUnfamiliar cues and poor signal Participants struggled to interpret signals and errors.\n-Online Mode • Use clear and modern interface terminologies and cues.\n• Provide suitable cues to help users complete tasks.\nTask 2", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Lack of Guidance and Lack of confirmation dialog and buttons", "text": "Participants not understanding that they needed to go offline before continuing with the configuration.\n-Go Offline • Provide suitable cues to help users complete tasks.\nParticipants not knowing that they should download the configuration file to the device -Click \"Download to device\" • Provide suitable cues to help users complete tasks.\n• Introduce testing mechanisms with clear instructions.\n• Provide concise instructions on how a task can be completed.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Crammed interface", "text": "Participants struggling to find items on the screen, e.g., Access Level Control mechanisms.\n-Click Access Level -Click \"Download to device\" -Click Load -Create Block\n• Provide suitable cues to help users complete tasks.\n• Reduce cognitive load and complexity by reducing the number of steps to complete tasks. • Use clear and modern interface terminologies and cues.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Unusual ordering, Complex operations", "text": "Participants found the access level control mechanism layout confusing.\n-Click Full Protection -Type password in each level\n• Use clear and modern interface terminologies and cues.\n• Provide concise instructions on how a task can be completed.\n• Provide a better help mechanisms such an inline help box.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Task 3", "text": "Lack of guidance, Crammed interface Participants struggling to find items and features on the screen.\n-Create Username -Create Password -Click User Administration -Click \"run simulation\"\n• Provide suitable cues to help users complete tasks.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Complex operation", "text": "Participants struggling to distinguish the difference between the process of creating individual user accounts and creating groups.\n-Click create new device -Click Toolbox -Click User Administration -Create Username & Password.\n• Reduce cognitive load and complexity by reducing the number of steps to complete tasks. • Provide concise instructions on how a task can be completed.\n• Provide a better help mechanisms such an inline help box.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Lack of confirmation dialog and buttons", "text": "Participants failing to notice that they have logged in -Enter Login details • Provide suitable cues to help users complete tasks.\n• Add confirmation dialogs to help users confirm changes.\nTable 3: Challenges, Hotspots and Potential Solutions Summary: Mapping between challenges, hot spots and the ways in which they can be addressed.", "publication_ref": [], "figure_ref": [], "table_ref": []}], "references": [{"ref_id": "b0", "title": "Industrial control systems: Cyberattack trends and countermeasures", "journal": "Computer Communications", "year": "2020", "authors": "T Alladi; V Chamola; S Zeadally"}, {"ref_id": "b1", "title": "On the usability of https deployment", "journal": "", "year": "2019", "authors": "M Bernhard; J Sharman; C Z Acemyan; P Kortum; D S Wallach; J A Halderman"}, {"ref_id": "b2", "title": "Cognitive walkthrough for the web", "journal": "", "year": "2002", "authors": "M H Blackmon; P G Polson; M Kitajima; C Lewis"}, {"ref_id": "b3", "title": "Using thematic analysis in psychology", "journal": "Qualitative research in psychology", "year": "2006", "authors": "V Braun; V Clarke"}, {"ref_id": "b4", "title": "Demonstrating rigor using thematic analysis: A hybrid approach of inductive and deductive coding and theme development", "journal": "International journal of qualitative methods", "year": "2006", "authors": "J Fereday; E Muir-Cochrane"}, {"ref_id": "b5", "title": "Statistical methods for rates and proportions", "journal": "john wiley & sons", "year": "2013", "authors": "J L Fleiss; B Levin; M C Paik"}, {"ref_id": "b6", "title": "Getting security objectives wrong: A cautionary tale of an industrial control system", "journal": "Springer International Publishing", "year": "2017", "authors": "S N Foley"}, {"ref_id": "b7", "title": "Oops i did it again: further adventures in the land of ics security testbeds", "journal": "", "year": "2019", "authors": "J Gardiner; B Craggs; B Green; A Rashid"}, {"ref_id": "b8", "title": "Passive scanning in modbus networks", "journal": "Springer", "year": "2007", "authors": "J Gonzalez; M Papa"}, {"ref_id": "b9", "title": "Snowball sampling. The annals of mathematical statistics", "journal": "", "year": "1961", "authors": "L A Goodman"}, {"ref_id": "b10", "title": "Socio-technical security analysis of industrial control systems (ics)", "journal": "", "year": "2014", "authors": "B Green; D Prince; U Roedig; J Busby; D Hutchison"}, {"ref_id": "b11", "title": "Through the eye of the plc: semantic security monitoring for industrial processes", "journal": "", "year": "2014", "authors": "D Hadžiosmanović; R Sommer; E Zambon; P H Hartel"}, {"ref_id": "b12", "title": "Developing usable interface for internet of things (iot) security analysis software", "journal": "Springer", "year": "2017", "authors": "S Hong; Y Kim; G J Kim"}, {"ref_id": "b13", "title": "Global PLC market share as of 2017", "journal": "", "year": "2021-09-19", "authors": ""}, {"ref_id": "b14", "title": "Senami: Selective non-invasive active monitoring for ics intrusion detection", "journal": "", "year": "2016", "authors": "W Jardine; S Frey; B Green; A Rashid"}, {"ref_id": "b15", "title": "Usability meets security-the identitymanager as your personal security assistant for the internet", "journal": "IEEE", "year": "2000", "authors": "U Jendricke; D G Tom Markotten"}, {"ref_id": "b16", "title": "Discourse analysis", "journal": "John Wiley & Sons", "year": "2017", "authors": "B Johnstone"}, {"ref_id": "b17", "title": "i have no idea what i'm doing\": On the usability of deploying https", "journal": "USENIX Association", "year": "2017", "authors": "K Krombholz; W Mayer; M Schmiedecker; E Weippl"}, {"ref_id": "b18", "title": "Securing the internet, one http 200 ok at a time", "journal": "", "year": "2017", "authors": "W Mayer; K Krombholz; M Schmiedecker; E Weippl"}, {"ref_id": "b19", "title": "Mechanism to secure computer output from software attack using isolated execution", "journal": "US Patent", "year": "2008-06-17", "authors": "F X Mckeen; K Reneris; D W Grawrock"}, {"ref_id": "b20", "title": "The cybersecurity landscape in industrial control systems", "journal": "", "year": "2016", "authors": "S Mclaughlin; C Konstantinou; X Wang; L Davi; A.-R Sadeghi; M Maniatakos; R Karri"}, {"ref_id": "b21", "title": "Reconfiguring governance: How cyber security regulations are reconfiguring water governance", "journal": "", "year": "2021", "authors": "O Michalec; S Milyaeva; A Rashid"}, {"ref_id": "b22", "title": "Industry responses to the european directive on security of network and information systems (N IS)): Understanding policy implementation practices across critical infrastructures", "journal": "", "year": "2020", "authors": "O A Michalec; D Van Der Linden; S Milyaeva; A Rashid"}, {"ref_id": "b23", "title": "Guide to Industrial Control Systems (ICS) Security", "journal": "", "year": "2008-02-14", "authors": ""}, {"ref_id": "b24", "title": "What do usability evaluators do in practice? an explorative study of think-aloud testing", "journal": "", "year": "2006", "authors": "M Nørgaard; K Hornbaek"}, {"ref_id": "b25", "title": "Thinkaloud protocols: a comparison of three think-aloud protocols for use in testing data-dissemination web sites for usability", "journal": "", "year": "2010", "authors": "E L Olmsted-Hawala; E D Murphy; S Hawala; K T Ashenfelter"}, {"ref_id": "b26", "title": "Global PLC market share as of 2017, by manufacturer", "journal": "", "year": "2018-02-19", "authors": "D B Research"}, {"ref_id": "b27", "title": "Human-computer Interaction", "journal": "IOS Press", "year": "1999-09-03", "authors": "M A Sasse; C Johnson; C W Johnson"}, {"ref_id": "b28", "title": "The impact of test duration on user fatigue and reliability of subjective quality ratings", "journal": "Journal of the Audio Engineering Society", "year": "2012", "authors": "R Schatz; S Egger; K Masuch"}, {"ref_id": "b29", "title": "The loss of women from science, mathematics, and engineering undergraduate majors: An explanatory account", "journal": "Science education", "year": "1995", "authors": "E Seymour"}, {"ref_id": "b30", "title": "Cognitive walk-through method (cwm)", "journal": "CRC Press", "year": "2004", "authors": "T L Smith-Jackson"}, {"ref_id": "b31", "title": "Intrusion detection for airborne communication using phy-layer information", "journal": "Springer", "year": "2015", "authors": "M Strohmeier; V Lenders; I Martinovic"}, {"ref_id": "b32", "title": "Designing Interfaces", "journal": "O'Reilly Media, Inc", "year": "2005", "authors": "J Tidwell"}, {"ref_id": "b33", "title": "A usability evaluation of let's encrypt and certbot: Usable security done right", "journal": "", "year": "2019", "authors": "C Tiefenau; E Zezschwitz; M Häring; K Krombholz; M Smith"}, {"ref_id": "b34", "title": "Technologies catalog to support the identification of user behavior during usability tests", "journal": "Springer", "year": "2018", "authors": "T L H Tito; A G Lopes; D Scherer"}, {"ref_id": "b35", "title": "Why johnny the developer can't work with public key certificates", "journal": "Springer", "year": "2018", "authors": "M Ukrop; V Matyas"}, {"ref_id": "b36", "title": "Do users' perceptions of password security match reality", "journal": "", "year": "2016", "authors": "B Ur; J Bees; S M Segreti; L Bauer; N Christin; L F Cranor"}, {"ref_id": "b37", "title": "i added'!'at the end to make it secure\": Observing password creation in the lab", "journal": "", "year": "2015", "authors": "B Ur; F Noma; J Bees; S M Segreti; R Shay; L Bauer; N Christin; L F Cranor"}, {"ref_id": "b38", "title": "Folk models of home computer security", "journal": "", "year": "2010", "authors": "R Wash"}, {"ref_id": "b39", "title": "Why johnny can't encrypt: A usability evaluation of pgp 5.0", "journal": "", "year": "1999", "authors": "A Whitten; J D Tygar"}, {"ref_id": "b40", "title": "On the usability of firewall configuration", "journal": "", "year": "2008", "authors": "T Wong"}, {"ref_id": "b41", "title": "Overshadow plc to detect remote control-logic injection attacks", "journal": "Springer", "year": "2019", "authors": "H Yoo; S Kalle; J Smith; I Ahmed"}], "figures": [{"figure_label": "2", "figure_type": "figure", "figure_id": "fig_0", "figure_caption": "•Figure 2 :2Figure2:The key findings from our study can be summarized into four high-level concepts, Communications, Navigation, Visuals, and Features.", "figure_data": ""}, {"figure_label": "3", "figure_type": "figure", "figure_id": "fig_1", "figure_caption": "Figure 3 :3Figure 3: Mapping between the steps and the complexities that pose various challenges to users while configuring security mechanisms in Siemens PLC.", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "fig_2", "figure_caption": "should take roughly 40 to 50 minutes of your time. Do you have any questions before we start? Task 1: Configuring PLC to PC To get started, please open TIA portal and create a new project. You can call it whatever you wish. You have created a new project with the right PLC. But it needs to be connected. The first task is to link this PLC to the computer you are on. I have written down the IP address in front of you. You may use this or configure it as a direct Ethernet cable. Your choice.", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "fig_3", "figure_caption": "•Can you tell me what the pink message box is saying? • Have you tried double clicking the box? C Challenges, Hotspots and Potential solutions Refer in Table3below -where these challenges have occurred the most, and the possible ways of addressing them.", "figure_data": ""}, {"figure_label": "45", "figure_type": "figure", "figure_id": "fig_4", "figure_caption": "Figure 4 :Figure 5 :45Figure 4: Task 1: Connecting PLC to PC steps comparison", "figure_data": ""}, {"figure_label": "4", "figure_type": "figure", "figure_id": "fig_5", "figure_caption": "Figure 44Figure 4 to 6 shows the tasks steps and what participants found challenging.", "figure_data": ""}, {"figure_label": "6", "figure_type": "figure", "figure_id": "fig_6", "figure_caption": "Figure 6 :6Figure 6: Task 3: User Administration steps comparison", "figure_data": ""}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Summary: Demographics of the participants. A total of 19 participants took part in our study. Sixteen (", "figure_data": "CategoryExperiencedInexperiencedAGE21 -250 326 -302 230 -353 136 -402 041 -452 046 -503 050 +1 0EmploymentUnemployed/Retired1 0Full time7 2Apprentice1 1Student2 3Self employed2 0SectorComputer Eng.0 2Software Eng.0 2Electrical/Electronic Eng.4 2Research & Development3 0Mechatronics/Robotics Eng.4 0Civil/Structural Eng.2 0Configured Control SystemYes11 2No2 4Experience BrandSiemens6 1Schnieders Electrics3 1Rockwell Automation4 1ABB3 0Omoron2 0Others13 6GenderMale12 4Female1 213 6"}], "formulas": [], "doi": ""}
