{"title": "P, T -odd effects in YbCu, YbAg and YbAu", "authors": "Johan David Polet; Yuly Chamorro; Lukáš F Pašteka; Steven Hoekstra; Micha L Tomza; Anastasia Borschevsky; I Agustín Aucar", "pub_date": "2024-08-28", "abstract": "In this work, the molecular enhancement factors of the P, T -odd interactions involving the electron electric dipole moment (W d ) and the scalar-pseudoscalar nucleon-electron couplings (W s ) are computed for the ground state of the bimetallic molecules YbCu, YbAg and YbAu. These systems offer a promising venue for creating cold molecules by associating laser cooled atoms. The relativistic coupled-cluster approach is used in the calculations and a thorough uncertainty analysis is performed to give accurate and reliable uncertainties to the obtained values. Furthermore, an in-depth investigation of the different electronic structure effects that determine the magnitude of the calculated enhancement factors is carried out, and two different schemes for computing W d are compared. The recommended values for the enhancement factors are (13.24 ± 0.03) × 10 24 h Hz e cm , (12.15 ± 0.08) × 10 24 h Hz e cm and (2.13 ± 0.28) × 10 24 h Hz e cm for W d , and (-48.36 ± 0.18) h kHz, (-45.51 ± 0.43) h kHz and (5.31 ± 1.80) h kHz for W s , for YbCu, YbAg and YbAu, respectively.", "sections": [{"heading": "I. INTRODUCTION", "text": "The current best description of elementary particles and their interactions is given by the Standard Model (SM) of particle physics 1 . This model is capable of explaining almost all experimental observations and of accurately predicting a wide range of diverse phenomena, which is why over time it has been consolidated as a well-tested physical theory. However, it does not address some important observed effects, such as the matterantimatter asymmetry in the universe, the neutrino oscillations, and the existence and nature of dark matter and dark energy 2,3 . Over the past decades, many new theories and extensions of the SM have been proposed to explain these phenomena 3,4 . Testing and restricting these theories is important for advancing our understanding of the fundamental laws of physics.\nA promising way to test some of these theories is to search for effects due to the simultaneous nonconservation of spatial (P) and time-reversal (T ) parities in atoms and molecules, such as those arising from the electric dipole moments (EDM) of electrons 5 . Interactions between these EDMs and electromagnetic fields violate both temporal and spatial invariance 6 . Within a CPT -invariant theory (C refers to charge-conjugation symmetry), if T symmetry is violated, then the combined CP symmetry must also be non conserved, so that clearly a) Author to whom correspondence should be addressed. Electronic mail: agustin.aucar@conicet.gov.ar P, T violation implies CP non conservation 2 .\nThe sources of CP violation described by the SM lead to the prediction of a free-electron EDM d e of approximately 5.8 × 10 -40 e cm 7 . However, more sources of CP violation beyond those predicted by the SM are needed to explain, for example, the observed matter-antimatter asymmetry. The additional sources of CP violation would in turn lead to an increase in the magnitude of the electron EDM (eEDM), even bringing it into the reach of present day precision experiments 2 . Experimental searches for these phenomena are currently being carried out in atoms and molecules, taking advantage of the enhancement of the atomic and molecular EDMs. These arise from P, T -violating interactions, mainly those taking place between the eEDMs and the large internal atomic or molecular electric fields, and also other CP-odd nucleon-electron and nucleon-nucleon interactions 2,[8][9][10] . Currently, the lowest upper limit of the eEDM is set at |d e | < 2.1×10 -29 e cm. This upper limit was reported after measurements conducted by the National Institute of Science and Technology (NIST) on the HfF + molecular ion 11 , and combining these results with those obtained by the ACME Collaboration in their analysis of the ThO molecule 12 . It is important to stress that if CP violation is assumed to arise exclusively from d e in the NIST experiment (i.e., if the scalar-pseudoscalar nucleon-electron couplings are neglected), then the upper limit would be |d e | < 4.1 × 10 -30 e cm. This lowest upper limit has already put considerable constraints on some of the theories beyond the SM 13,14 .\nIn the ground state of a molecule with zero nuclear arXiv:2408.15029v1 [physics.chem-ph] 27 Aug 2024 spins and a single unpaired electron there are two main contributions to its energy arising from P, T -violating interactions. These arise from the interactions between the EDMs of the electrons and the electromagnetic fields, and from the P, T -odd scalar-pseudoscalar nucleon-electron (S-PS-ne) neutral-current interactions 9,15 . Since the effects of the eEDM and the S-PS-ne interactions are enhanced by the molecular electronic structure, the two corresponding molecular enhancement factors W d (related to d e ) and W s (which enhances the S-PS-ne interactions) are of particular interest.\nThe choice of molecule for the measurements has a significant impact on the sensitivity due to, among others, the system-dependent enhancement of the P, T -odd effects. Since in paramagnetic molecules containing only one heavy element this enhancement scales roughly as the cube of the atomic number of the heavier nucleus to which the unpaired electron is strongly linked to 16,17 , some heavy-element-containing molecules have an advantage over other systems. Furthermore, practical experimental considerations play a crucial role in selecting a candidate for experiments. For example, the use of ultracold molecules increases interaction times and hence the experimental precision 18 . Therefore, laser-coolability of the selected molecule provides a clear advantage. Various molecular properties relevant for precision measurements (e.g., laser coolability and sensitivity to the measured phenomena, but also many others) can be determined theoretically before experimental investigations in support of such experiments. In particular, the enhancement factors cannot be measured and must be provided based on accurate electronic structure calculations.\nIn this work, we investigate the sensitivity of the YbCu, YbAg and YbAu paramagnetic molecules to P, Tviolating phenomena. These systems are of particular interest, since they contain two metal atoms. Theoretically, this means that these atoms can be laser-cooled separately and then associated into a molecule afterwards, eliminating the need to laser-cool the molecule as a whole 19,20 . So far, laser-cooling of Yb and Ag atoms has been demonstrated 21,22 . Laser-cooling of Cu and Au has not been demonstrated yet, but cooling schemes have been proposed 23 . Furthermore, these polar molecules have large molecular-frame electric dipole moments, due to the large electronegativity of the coinage-metal atoms, allowing for their easy polarization. In particular, YbAg is considered as a promising candidate for a next generation clock-transition eEDM measurement 20 .\nNo experiments have been performed so far on YbCu, YbAg or YbAu, but several experimental groups pursue ultracold formation of other Ag-containing molecules [24][25][26][27] . However, high-accuracy calculations of the potential energy curves, molecular-frame electric dipole moments, electric quadrupole moments, and static electric dipole polarizabilities of the present systems were recently performed 28 . Here we employ the fourcomponent (4C) relativistic coupled-cluster (CC) approach to calculate the enhancement factors of the P, Tviolating interactions between the eEDMs and the electric fields in the systems, W d , and of the P, T -odd S-PS-ne interactions, W s . The enhancement factors are determined for the ground states,\nX 2 Σ + 1 2\n, of the three molecules. We also carry out an extensive computational study to assign uncertainties on the calculated values.\nIn paramagnetic systems containing at least one nonzero nuclear spin I, some internal nuclear interactions lead to nuclear spin-dependent molecular P, T -violating effects, such as magnetic interactions between the electrons and the nuclear magnetic quadrupole moment (NMQM), which appears for nuclear spin I ≥ 1 29,30 . These effects are, however, outside the scope of this work.\nSection II covers the main theoretical aspects of this work, detailing how both enhancement factors can be obtained from effective Hamiltonians. Then, Section III contains a description of the methods employed to calculate these factors, as well as the scheme use for geometry optimization. Next, Section IV presents the obtained enhancement factors and their dependence on effects such as the choice of the nuclear charge density model, the method for treatment of electron correlation, the choice of the basis set, and the internuclear distances. Finally, Section V contains a concise summary of our findings.", "publication_ref": ["b1", "b2", "b2", "b3", "b4", "b5", "b6", "b1", "b1", "b7", "b8", "b9", "b10", "b11", "b12", "b13", "b8", "b14", "b16", "b17", "b18", "b19", "b20", "b21", "b22", "b23", "b20", "b24", "b25", "b26", "b27", "b28", "b29", "b30"], "figure_ref": [], "table_ref": []}, {"heading": "II. THEORY", "text": "The P, T -violating interactions involving the EDMs of atoms or molecules produce non-zero linear Stark shifts in the limit of vanishingly small applied electric fields. These interactions originate from many different sources, but mainly from the EDMs of electrons and nucleons, as well as from the P, T -violating nucleon-nucleon current interactions and the P, T -odd electron-quark interactions 31 . In particular, for paramagnetic linear molecules in X 2 Σ 1 2 ground states, such as the systems treated in this paper, the interactions between eEDMs and electromagnetic fields and the P, T -odd S-PS-ne neutral-current interactions dominate 32 . In these cases, the effective spin-rotation Hamiltonian that includes only nuclearspin-independent P, T -odd interactions (i.e., neglecting the interactions between electrons and NMQMs) can be written as 9,33 ĤP,T -odd\nsr = K W s,K k s,K + W d d e Ω,(1)\nwhere the P, T -odd dimensionless operator Ω = ℏ -1 J e •n is the projection of the reduced total electronic angular momentum operator J e /ℏ along the direction of the molecular-frame electric dipole moment, which is given by the unit vector n (for a linear molecule, it points from the negatively charged region of the system to the positive one, along the internuclear axis). Here, ℏ = h/(2π) is the reduced Planck constant. The sum in Eq. ( 1) runs over all the nuclei K in the system. In systems where one nucleus is significantly heavier that the other (and where the unpaired electron is mostly located on that heavy nucleus), this sum typically reduces to a single term. We also note that k s,K is specific to each nucleus K, i.e., it depends on both the proton and the neutron numbers. Both these points will become important later and are discussed in Section II B.\nTo compute the enhancement factors, the effects of the eEDM and the S-PS-ne interactions are taken as perturbations on the 4C relativistic Dirac-Coulomb (DC) Hamiltonian. Since d e and k s,K are small quantities, the effects arising from both interactions are minute. Therefore, first-order perturbation treatment will already yield highly accurate results.\nWithin the Born-Oppenheimer approximation, the 4C DC (clamped-nuclei) Hamiltonian is given by\nĤ(0) = i cα i • pi + β i m e c 2 - K eV K (r i ) - 1 2 i̸ =j eV j (r i ) + 1 2 K̸ =L eZ K V L (R K ),(2)\nwhere\nV K (r i ) = 1 4πε 0 ρ K (r ′ ) |r i -r ′ | d 3 r ′ V j (r i ) = - 1 4πε 0 e |r i -r j |(3)\nV L (R K ) = 1 4πε 0 Z L e |R K -R L | .\nIn Eq. ( 2), as well as in all this work, the SI system of units was used. Here, the operator V K (r i ) refers to the electrostatic potential produced by the nucleus K at the position of the i-th electron, V j (r i ) is the potential created by electron j at the position r i , and V L (R K ) is the electrostatic potential produced by nucleus L at the position of nucleus K. c is the speed of light in vacuum, m e is the electron rest mass, e is the elementary charge, ε 0 is the permittivity of free space, ρ K (r ′ ) is the charge density distribution of nucleus K at an arbitrary position r ′ , Z K and Z L are the atomic numbers of nucleus K and L, respectively, and r i , r j , R K and R L are the position vectors of the electrons i and j, and nuclei K and L, respectively. Here and in what follows, the sums over i and j run over all the electrons in a molecule, whereas the sums over K and L run over its nuclei. pi is the linear momentum operator of electron i, while α i and β i are the 4 × 4 Dirac matrices for this electron, and are expressed in the Dirac standard representation as\nα = ∅ 2×2 σ σ ∅ 2×2 , β = 1 2×2 ∅ 2×2 ∅ 2×2 -1 2×2 .(4)\nHere, σ = σ x î + σ y ȷ + σ z k is the Pauli vector, whereas 1 2×2 and ∅ 2×2 are the 2 × 2 identity and null matrices, respectively. The Pauli matrices σ x , σ y , and σ z are given by\nσ x = 0 1 1 0 , σ y = 0 -i i 0 , σ z = 1 0 0 -1 ,(5)\nwith i = √ -1 being the imaginary unit.\nA. eEDM enhancement factor W d\nThe effects on hydrogenic atoms arising from a P, Todd interaction between the permanent EDM of a single electron, parallel to its spin, and an electromagnetic field has been studied for the first time by Salpeter in 1958 34 . In his seminal work, he introduced a P, T -odd perturbation term corresponding to a permanent eEDM into the one-electron Dirac equation in a Lorentz-covariant formulation. This term is analogous to the so-called \"Pauli moment\" interaction term (representing a QED interaction of the lowest order, for non-relativistic energies, between the electromagnetic field and the Pauli anomalous electric and magnetic dipole moments of the electron), but pre-multiplied by the pseudoscalar Dirac operator γ 5 (see pp. 47-51 of Ref. 35).\nIn atoms or molecules with at least one electron whose spin is unpaired, the effects arising from these P, Tviolating interactions produce atomic or molecular (permanent) P, T -violating electric dipole moments that may be significantly larger than that of a free electron. In the past it has been shown that the P, T -violating EDM of these many-electron systems is mainly influenced by the electrostatic interactions between the eEDM of the unpaired electron and the internal electric fields 36 . Therefore, when calculating the molecular enhancement parameter W d (see Eq. ( 1)) it is possible to ignore effects such as the interactions between the eEDM and the magnetic fields, and also the electron-electron Breit interactions.\nWhen neglecting both, the interactions of the eEDMs with internal and external magnetic fields and the Breit interactions, the mean value of the Salpeter Hamiltonian can be equated to the expectation value of two different operators. One of these two effective Hamiltonians is the sum of only one-electron operators, while the other one also contains two-body operators. These two-electron contributions, however, have been shown to be considerably smaller than the one-electron ones in that particular effective Hamiltonian, and as such they can usually be safely neglected 8,36 .\nTherefore, by employing any of these two effective Hamiltonians (denoted henceforth as scheme 1 and scheme 2) to make theoretical predictions, one avoids having to treat the two-electron interactions of the Salpeter Hamiltonian, which are not negligible. The first of these effective Hamiltonians (i.e., within scheme 1) has the form\nĤeEDM eff-1 = -d e i (β i -1)Σ i • E(r i ),(6)\nwhere the operator vectors Σ i are related to the Pauli matrices by the expression\nΣ = σ ∅ 2×2 ∅ 2×2 σ ,(7)\nand E(r i ) is the total electrostatic electric field at the position of electron i, given by\nE(r i ) = -∇ i   K V K (r i ) + V ext (r i ) + j̸ =i V j (r i )   .\n(8) Here, V ext (r i ) is the electrostatic potential produced by an external electric field at the position of electron i, and V K (r i ) and V j (r i ) are the electrostatic potentials given in Eq. (3).\nIn what follows, we neglect in Eq. ( 6) the effects arising from the external electric fields and from the electric field produced by the electrons, as their contributions to the molecular enhancement factors have been shown to be small 8,16,36 . In this way, the effective Hamiltonian of scheme 1 can be expressed as\nĤeEDM eff-1 ≈ -d e K,i (β i -1)Σ i • [-∇ i V K (r i )] ,(9)\nand if the nuclear charges are modelled using point-type density distributions, then this effective Hamiltonian reduces to the operator used throughout this work,\nĤeEDM eff-1 ≈ -d e K,i Z K e 4πε 0 (β i -1)Σ i • r i -R K |r i -R K | 3 ,(10)\nwhere its dependence with the atomic number of the nuclei in the system is explicit.\nThe second effective eEDM Hamiltonian, within scheme 2, is given by 36,37 \nĤeEDM eff-2 = i d e 2c eℏ i β i γ 5 i p2 i ,(11)\nwith γ 5 being the well-known 4 × 4 Dirac matrix defined as γ 5 = i γ 0 γ 1 γ 2 γ 3 , where γ 0 = β and γ = βα = γ 1 î + γ 2 ȷ+γ 3 k (in terms of the Pauli matrices, γ 0 = σ z ⊗1 2×2 and γ 1,2,3 = i σ y ⊗ σ x,y,z , so that γ 5 = σ x ⊗ 1 2×2 , with ⊗ implying a Kronecker product). Therefore, in the Dirac standard representation,\nγ 5 = ∅ 2×2 1 2×2 1 2×2 ∅ 2×2 . (12\n)\nScheme 2 contains only one-electron operators within an approximation in which both the magnetic interactions and the electron-electron Breit interactions are neglected, reducing the computational complexity. However, a drawback of this effective Hamiltonian is in the fact that the non-relativistic limit of its mean value is not zero, while that of the Salpeter Hamiltonian vanishes 38 . Furthermore, scheme 2 does not allow analysis of the separate nuclear contributions to the calculated W d parameters. Within scheme 1, on the other hand, the the non-relativistic limit of W d is zero. While scheme 1 includes two-electron contributions (see Eq. ( 6)), these are much smaller than the corresponding one-electron counterparts 16,36 and can usually be neglected. Therefore, scheme 1 allows us to study the effective contributions to W d arising from each nucleus of the system, keeping the correct non-relativistic behavior, and using only oneelectron operators.\nThe interactions of the eEDMs with the internal electric fields can be taken as a perturbation on the DC Hamiltonian Ĥ(0) of Eq. ( 2), and in such case the total (perturbed) electronic Hamiltonian is written as\nĤd = Ĥ(0) + λ ĤeEDM , (13\n)\nwhere λ is the strength of the perturbation, and ĤeEDM can be either ĤeEDM\neff-1\nor ĤeEDM eff-2 . The corrections to the molecular electronic energy arising from the perturbed Hamiltonian can be obtained by using Rayleigh-Schrödinger perturbation theory. A series expansion of the ground-state energy solution of Eq. ( 13), E d Ω (λ), can be written around λ = 0 as\nE d Ω (λ) = E (0) Ω +λ E d(1) Ω λ=0 + λ 2 2 E d(2) Ω λ=0 +O(λ 3 ), (14\n)\nwhere the subindices Ω indicate that the ground-state solutions |0⟩ of the unperturbed Hamiltonian Ĥ(0) in a given fixed molecular frame and spin state fulfil the condition ⟨0| Ω|0⟩ = Ω. For YbCu, YbAg and YbAu, it can be seen that |Ω| = 1/2 28 . Furthermore, the energy\nE (0) Ω = ⟨0| Ĥ(0)\n|0⟩ is the eigenvalue of the unperturbed Hamiltonian Ĥ(0) in the same molecular frame. When only the leading-order corrections are retained, and taking into account the relation between the effective spinrotation Hamiltonian and the eEDM enhancement factor W d given in Eq. ( 1), it can be shown that this parameter is given as\nW d = 1 Ω d e dE d Ω dλ λ=0 = 1 Ω d e d dλ 0 d Ĥd 0 d λ=0 ,(15)\nwhere 0 d is the ground-state solution of the total (perturbed) Hamiltonian Ĥd .", "publication_ref": ["b31", "b32", "b8", "b33", "b34", "b36", "b7", "b36", "b7", "b16", "b36", "b36", "b37", "b16", "b36", "b28"], "figure_ref": [], "table_ref": []}, {"heading": "B. S-PS-ne enhancement factor Ws", "text": "A second source contributing to the P, T -violating interactions involving the electric dipole moment of a polar paramagnetic molecule in a 2 Σ 1 2 ground state are the P, T -odd S-PS-ne neutral-current interactions. Assuming that in each nucleus K the proton and neutron density distributions are equal to each other and also equal to the nuclear density distribution ϱ K (r), the effective Hamiltonian that accounts for the four-fermion semileptonic interactions in the electron-nucleon sector (in the limit of infinitely heavy nuclei) can be written in terms of the proton-electron and neutron-electron interaction constants k p s and k n s , respectively, as 9,15,31\nĤS-PS-ne = i G F √ 2 i,K (Z K k p s + N K k n s ) β i γ 5 i ϱ K (r i ), (16\n)\nwhere\nN K is the number of neutrons in nucleus K, G F is the Fermi coupling constant (whose most recent value is G F /(ℏ c) 3 = 1.1663787 × 10 -5 GeV -2 , or equiva- lently G F ≃ 2.222516 × 10 -14 E h a 3 0 39\n), and ϱ K (r i ) = ρ K (r i )/(Z K e) is the nuclear density distribution of nucleus K at the position of the i-th electron, satisfying ϱ K (r) d 3 r = 1. Besides, E h and a 0 are the Hartree energy and Bohr radius, respectively. By defining a factor k s,K = k p s + (N K /Z K ) k n s , we can rewrite Eq. ( 16) as ĤS-PS-ne = K ĤS-PS-ne\nK = i G F √ 2 i,K Z K k s,K β i γ 5 i ϱ K (r i ). (17\n)\nMaking a treatment analogous to the one applied to the eEDM Hamiltonian, it is easy to see that the S-PSne Hamiltonian can also be taken as a perturbation (with field strength λ) to the 4C DC Hamiltonian, so that\nĤs = Ĥ(0) + λ ĤS-PS-ne . (18\n)\nBy expanding the solution energy around λ = 0, the enhancement factor W s can be obtained as\nW s = 1 Ω K 1 k s,K dE s,K Ω dλ λ=0 . (19\n)\nIII. COMPUTATIONAL DETAILS\nThe calculations were performed using the DIRAC-19.0 program package 40,41 , in the framework of the 4C DC Hamiltonian. The multi-reference Fock-space coupled-cluster (FSCC) method with single and double excitations was used to treat electron correlation effects 42 . A multi-reference method is required due to the challenging character of the ytterbium-containing molecules 43,44 . This method was employed previously to study the enhancement factors of the P, T -violating interactions in YbOH 45 and YbCH 3 46 . Additionally, we also used the FSCC implementation within the EXP-T program 47,48 to investigate the effects of including triple excitations.\nThe uncontracted Dyall's valence-only basis sets of double-ζ (v2z), triple-ζ (v3z) and quadruple-ζ (v4z) quality were employed [49][50][51][52][53] . Furthermore, the core-valence basis sets (cvXz, X = 2, 3, 4) were also used in order to examine the effect of correlating the core electrons 54 . These particular basis sets add tight functions with large exponents. The augmented basis sets (s-aug-vXz) were employed to investigate how accurately the outer regions of the systems were described. These basis sets add a single diffuse function to each symmetry block.", "publication_ref": ["b40", "b41", "b42", "b43", "b44", "b45", "b46", "b47", "b48", "b49", "b50", "b51", "b52", "b53", "b54"], "figure_ref": [], "table_ref": []}, {"heading": "A. Finite-field method", "text": "The molecular enhancement factors W d and W s were calculated by employing the finite-field method. In particular, by combining Eqs. ( 14), ( 15) and ( 19) it can be seen that they can be obtained by applying the two-point finite-field method, where\nW d ≈ 1 Ω d e E d Ω (λ) -E d Ω (-λ) 2λ ,(20)\nand\nW s ≈ 1 Ω K 1 k s,K E s,K Ω (λ) -E s,K Ω (-λ) 2λ .(21)\nA field strength λ = 10 -6 was set when studying both parameters W d and W s in YbCu and YbAg, whereas λ = 10 -7 was used for the calculations involving YbAu.\nAtomic units (i.e., e = 1, a 0 = 1, ℏ = 1, and 4πε 0 = 1) were used in all the calculations. For W d , the values obtained following Eq. ( 20) were converted to the units used throughout this work by means of a conversion factor equal to the atomic unit (a.u.) of electric field E h /(e a 0 ) = 1.243380059 × 10 24 h Hz e cm . To calculate W s following Eq. ( 21), the energies E s,K Ω (±λ)/k s,K were obtained in a.u. as mean values of the Hamiltonian\nĤ(0) ± λ k s,K √ 2 G F Z K ĤS-PS-ne K ,(22)\nand then the factor \nG F Z K /( √ 2 a 3 0 ) = Z K 0.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "B. Geometry optimization", "text": "The enhancement factors were computed for the equilibrium geometries of the systems. The bond lengths were determined using the exact two component (X2C) Hamiltonian 55 , the single-reference CCSD method, and s-aug-v4z basis sets. By employing the X2C Hamiltonian, the Dirac equation is transformed decoupling the large and small components of the Dirac spinors. This method only takes positive energy solutions into account. The active space energy cut-offs for the virtual (unoccupied) and occupied orbitals were set to ±20 E h , ±10 E h and ±10 E h for YbCu, YbAg and YbAu, respectively. A smaller active space was used for the heavier molecules since computing their bond distances is computationally more intensive. The results of these geometry optimizations can be found in Table I along with the values obtained previously in Ref. 28.\nThe general trend observed for both sets of results is that the bond length increases from YbCu to YbAg and then decreases from YbAg to YbAu, likely due to the relativistic contraction of the 6s orbital of gold. A nonrelativistic treatment would show longer bonds for heavier systems 56 .\nThe discrepancy between the present and the previous values is likely due to the use of pseudopotentials (especially a large-core one with a core polarization potential for Yb) in the latter. ECPs are limited to scalarrelativistic effects, while the X2C procedure employed here also accounts for the spin-orbit coupling. The fact that the largest discrepancy is found for the heavier system supports this assumption.", "publication_ref": ["b55", "b56"], "figure_ref": [], "table_ref": ["tab_0"]}, {"heading": "IV. RESULTS AND DISCUSSION", "text": "To obtain accurate enhancement factors accompanied by well-defined uncertainties, multiple computational aspects will be addressed. For all the calculations discussed in this section, the 4C DC Hamiltonian was employed. First, the baseline results will be presented in Section IV A. Then, the effect of selecting two different nuclear charge density distribution models is examined for both factors in Section IV B. Furthermore, the two schemes employed for computing W d will be compared in Section IV C. Next, the influence of the basis set will be determined in Section IV D. Thereafter, different computational approaches will be compared in Section IV E. Finally, the effect of the geometry of the system on W d and W s will be discussed in Section IV F. This extensive investigation allows us to set uncertainties on the recommended values. The justification for the final results and their uncertainties will be given in Section IV G.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "A. Baseline calculations", "text": "All the reference values for W d and W s were computed on the v3z/FSCCSD level. For YbCu and YbAg, a virtual space cut-off of 500 E h was employed, and 2 and 4 electrons were frozen, respectively. For YbAu, the virtual space cut-off was set to 40 E h , and 56 electrons were frozen. The selection of these correlation parameters is justified in the Supplementary Material.\nThe calculated enhancement factors for the three systems are given in Table II. We can observe that both parameters are very similar for YbCu and YbAg, while much lower absolute values are obtained for YbAu. This finding will be elucidated in the following sections. Furthermore, multiple corrections to these baseline values will be determined. The final obtained values will be given in Section IV G.", "publication_ref": [], "figure_ref": [], "table_ref": ["tab_1"]}, {"heading": "B. Nuclear size effects", "text": "The effect of the nuclear model on both molecular enhancement factors was investigated. For all three molecules, W d and W s were calculated by employing both a point-like and a spherically symmetric Gaussiantype function to model the nuclear charge densities of each nucleus K, ρ K (r), as well as the normalized densities ϱ K (r) = ρ K (r)/(Z K e) appearing in ĤS-PS-ne (see Eq. ( 16)). The two type of charge densities (point nucleus, PN, and Gaussian-type nucleus, GN) employed in this work can be expressed as\nρ P N K (r) = Z K e δ(r -R K ) ρ GN K (r) = Z K e ζ K π 3/2 e -ζ K |r-R K | 2 , (23\n)\nwhere δ(r) is the Dirac delta distribution and ζ K = 3/(2⟨R 2 nuc,K ⟩), with ⟨R 2 nuc,K ⟩ being the root-meansquare radius of the nucleus K, which can be obtained using the empirical relation ⟨R 2 nuc,K ⟩ = (0.836 57 , where A K is the mass number of the isotope of interest.\nA 1/3 K + 0.570) fm\nFor this analysis, all calculations were performed on the FSCCSD/v2z level of theory, correlating all electrons and using a virtual space cut-off of 3000 E h for all three systems.\nFigure 1 shows the effect of the nuclear model on W d . For YbCu and YbAg, the results using GN are ∼ 1.1% smaller than those obtained employing PN, while for YbAu the GN result is ∼ 9.2% larger than the one using a PN. The results were obtained on the FSCCSD/v2z level of theory with all electrons correlated and a symmetric virtual space cut-off and using Gaussian-type and point-like nuclear models (GN and PN, respectively). The hatched blocks correspond to the sum W s,Yb + Ws,X (X = Cu, Ag, Au).\nthe gradients of the nuclear densities have opposite directions. For YbAu, the two contributions almost cancel each other out, leading to a very small total value of W s .\nIn all three cases, the contribution of the ytterbium nucleus is reduced by ∼ 13% when going from PN to GN, while for copper, silver, and gold the reduction is ∼ 0.16%, ∼ 3.5%, and ∼ 20%, respectively. Thus, the effect of using a finite nucleus model becomes more significant for the heavier elements, as can be expected. The total absolute W s is also lower for the calculations performed using the GN model. It is well known that when only the electric field produced by the nuclei is taken into account in scheme 1, the two schemes described in Section II A should yield similar results for W d 36 . While the use of scheme 2 is computationally less demanding, since it requires just a single calculation per system instead of the two that are required for each diatomic molecule, scheme 1 allows us to examine the effective contributions arising from each nucleus. In order to study those individual contributions, in this work we present (to the best of our knowledge) the first four-component results of W d using the approximate effective Hamiltonian of Eq. ( 10), corresponding to the use of scheme 1.\nThe enhancement factors W d were computed using both schemes for the three systems considered in this work, on the FSCCSD/v2z level of theory, with symmetric cut-offs of 500 E h , 500 E h , and 40 E h , freezing 2, 4, and 56 electrons of YbCu, YbAg and YbAu, respectively. The calculations were only performed using a PN model (and not a GN nucleus), since some integrals required for scheme 1 for finite nuclear models, despite having been studied using two-component methods 16 , are currently not implemented in DIRAC.\nFigure 3 shows the difference in W d when computed with the two schemes for the three systems. The total YbCu W d calculated using scheme 2 is ∼ 1.5% smaller than the scheme 1 result. For YbAg, this difference is ∼ 1.4%. For YbAu, the reduction is ∼ 4.7%.\nUsing scheme 1, it can be seen that the contributions to W d from the Yb nucleus remain almost constant for all three systems. Moreover, the contributions from the coinage metals all have opposite signs to those coming from Yb, as is the case for the W s factors. This is expected, since the electric fields due to the two nuclei in the internuclear region have opposite directions, and according to Eqs. ( 9) and (10), this generates opposite contributions to this enhancement parameter. The decreasing total W d factor from YbCu to YbAu is due to the increasing contribution from the second nucleus (opposite to that of the first).", "publication_ref": ["b57", "b36", "b16"], "figure_ref": [], "table_ref": []}, {"heading": "D. Basis set effects", "text": "To observe how the size of the basis set influences the enhancement factors, W d and W s were computed with double-ζ, triple-ζ and quadruple-ζ quality basis sets. These calculations were done using the FSCCSD method, and the (occupied and virtual) active space cut-offs were set to ±20 E h , ±10 E h and ±10 E h , freezing 38, 64 and 82 electrons of YbCu, YbAg and YbAu, respectively. The plot in Figure 4 shows the effect of increasing the basis set cardinality on W d . Converging behavior can be observed for parameter values with increasing basis set quality for YbCu and YbAg. While no apparent convergence can be observed for the total W s values of YbAu, S1 S2 S1 S2 S1 S2 ", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "YbCu", "text": "YbAg YbAu __________ __________ __________ FIG. 3. Graphical representation of the behavior of W d of YbCu, YbAg and YbAu computed using scheme 1 (S1) and scheme 2 (S2). For S1, the contributions from both nuclei are shown as well as their sums (hatched blocks). These results were obtained on the FSCCSD/v3z level with a symmetric virtual space cut-off.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "YbCu", "text": "YbAg this convergence can be seen by looking at the individual contributions in Figure 5. A similar trend is expected for\nW d .\nApart from adding contributing functions to all orbitals, it is also possible to add only tight or diffuse functions. Tight functions should increase the accuracy of the description of the core region of the system, while diffuse functions should improve the accuracy of the description of the valence region of the system. The cvXz basis sets contain higher angular momentum tight functions, and the s-aug-vXz basis sets augment a diffuse function to the vXz basis set. These computations were done using the same computational settings as the ones above.\nThe effects of increasing the accuracy on the description of the core and valence regions of the systems is small for both enhancement factors. Adding tight functions has a negligible effect on all three systems for W d (with the largest change of 0.005 × 10 24 h Hz e cm ) and W s (with the largest change of 0.024 h kHz). On the other hand, adding diffuse functions reduces the parameter values slightly (with the largest changes of 0.033 × 10 24 h Hz e cm and 0.143 h kHz for W d and W s , respectively). Furthermore, the enhancement factors of the YbAg system are more affected than those of YbCu. For YbAu, the addition of diffuse functions increases the calculated W d and decreases the W s . Still, the relative effects remain within 3% of the total value, as can be seen in the Supplementary Material.\nFor the final calculations, the v3z basis set was used. For all the calculated enhancement factors, the differences between the use of v4z and v3z basis sets is small compared to the electron correlation effects. The incompleteness of the basis set will be taken into account in the uncertainty.", "publication_ref": [], "figure_ref": ["fig_4"], "table_ref": []}, {"heading": "E. Computational methods", "text": "The method used so far throughout this work for calculations of the enhancement factors is 4C Dirac-Coulomb FSCC.\nIn Table III and Figures 6 and7, different approaches are compared: DHF, Møller-Plesset up to second order (MP2), FSCCSD and FSCCSDT. These calculations were performed employing the dyall.v2z basis set, and the active space cut-offs for the post-DHF computations were set to ±2 E h , freezing 66, 84 and 116 electrons of YbCu, YbAg and YbAu, respectively. This small active space was chosen because inclusion of triple excitations (using the EXP-T program) is computationally expensive. The   factor of two and reverses the sign of W s .\nIncluding the triple excitations in the FSCC calculations has only a minor effect on the enhancement factors of YbCu and YbAg, but increases the W d and decreases the W s of YbAu significantly, in line with enhanced sensitivity of this systems to the other computational parameters. The differences between the FSCCSD and FSCCSDT methods will be used to estimate the uncertainty due to neglect of the higher excitations in Section IV G. The equilibrium bond lengths used in the calculations of the enhancement factors are given in Section III B. The accuracy of these theoretically predicted values compared to experiments is unknown, since no experimental bond lengths are available for the systems considered in this work. Since the bond length has a significant impact on the studied enhancement factors, the uncertainty associated to the bond length should be taken into account. The difference between the calculated equilibrium bond lengths obtained within the FSCCSD approach and the experimental values is usually on the order of 0.01 Å58 .\nAll enhancement factors were computed at the calculated equilibrium bond distances, as well as at 0.01 Å larger and smaller internuclear distances. These computations were performed on the FSCCSD/v2z level of theory, and the (occupied and virtual) active space cutoffs were set to ±100 E h , ±100 E h and ±95 E h , freezing 12, 20 and 28 electrons of YbCu, YbAg and YbAu, respectively. The results are given in Table IV.\nFor both enhancement factors of YbCu and YbAg, the result decreases by only 0.1 -0.2% for the larger internuclear distance and increases only by 0.1 -0.2% for the smaller internuclear distance. For YbAu, the deviation is significantly larger, at 5.0 -7.0%. ", "publication_ref": [], "figure_ref": ["fig_5"], "table_ref": ["tab_4", "tab_14"]}, {"heading": "Vibrational corrections", "text": "The anharmonicity of the potential energy curve for the electronic ground state implies that the effective equilibrium bond distance is shifted slightly compared to the minimum of the potential energy curve. This slight difference in bond length results in small changes in the enhancement factors.\nTo compute the vibrational correction, calculations of the enhancement factors and the potential energies for different bond lengths were performed. The results for W s , split up into the contribution arising from each nucleus, can be found in Figure 8. These values are given as a function of the difference between the internuclear distances and the equilibrium bond length of the corresponding molecule (in Angstroms). The resulting W s values are given as a percentage compared to the results found at the equilibrium bond length. It can be seen that the coinage metal contribution is significantly more sensitive to the bond length effect compared to the Yb contribution. This is also in accordance to the sensitivity of the respective atoms to the description of the electronic structure, as can be seen in Figure 7.\nThe correction values were computed using the VIB-CAL module in DIRAC-19.0, using a fourth-order polynomial for the energy fitting. The vibrational corrections are listed in Table V for both enhancement factors.\nThe vibrational corrections alter the original values (obtained at R e ) at most by ∼ 1%. These differences will also be taken into account when computing the final values in Section IV G.", "publication_ref": [], "figure_ref": ["fig_5"], "table_ref": ["tab_13"]}, {"heading": "G. Final recommended values and uncertainties", "text": "The baseline results given in Section IV A can now be corrected to obtain the final recommended values of W d and W s . The contributions resulting from using a larger basis set (dyall.v4z), correlating all electrons, increasing the virtual space cut-offs, including triple excitations, and taking into account vibrational corrections were added to the reference baseline values. Table VI presents these different contributions and also the final recommended values.\nIn particular, the basis set corrections were calculated as differences between FSCCSD calculations with active space cut-offs of ±20 E h for YbCu and ±10 E h for YbAg and YbAu, employing the dyall.v4z and dyall.v3z basis sets (see Table VI of the Supplementary Material).\nThe effects arising from correlating all electrons were taken as the differences between freezing 2, 4 and 56 electrons for YbCu, YbAg and YbAu respectively and correlating all the electrons and simultaneously increasing the virtual cutoff to 6000 E h at the FSCCSD/dyall.v2z level of theory. A detailed analysis of the effects of the active correlation space size is available in the Supplementary Material.\nThe effects due to the inclusion of higher excitations were taken as the differences between FSCCSDT and FSCCSD calculations, employing v2z basis sets and cutoffs of ±2 E h . Finally, the vibrational effects were extracted from Table V.\nTo estimate conservative and reliable uncertainties for these values, a similar treatment to that given in Refs. 59 and 46 will be employed. The individual uncertainties obtained from the considerations discussed in the previous sections are given in Table VII, graphically displayed in Figure 9, and analyzed in the following subsections.", "publication_ref": [], "figure_ref": ["fig_6"], "table_ref": ["tab_7"]}, {"heading": "Basis set", "text": "The uncertainty due to the basis set has three different sources: (i) the general quality of the basis set, (ii) the quality of the treatment of tight functions, and (iii) the quality of the treatment of diffuse functions.\nThe uncertainties in the general quality of the basis sets are due to the fact that the values possibly have not converged yet at the v4z level. The baseline values are corrected by adding the difference between the v4z and v3z results, as found in Section IV D. For all parameters, the uncertainties in basis set quality are taken as a half of the differences between v4z and v3z results, to account for the unconsidered effects arising from the use of larger basis sets. The uncertainties due to the possible insufficient amount of tight functions are given by the differences between the cv3z and the v3z results. Finally, the differences between the s-aug-v3z and v3z results determine the uncertainties in the quality of diffuse function treatment.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Electron correlation", "text": "Electron correlation is affected by the chosen (occupied and virtual) active space cut-offs, along with the excitations taken into account.\nTo account for the frozen orbitals in the baseline calculation, the results provided in the Supplementary Material are used. The difference in enhancement factors between correlating all electrons, and freezing 2, 4 and 56 electrons for YbCu, YbAg and YbAu, respectively, was used to correct the baseline values.\nThe correction from the employed virtual space cut-off is given by the differences between the obtained values at a virtual space cut-off of 6000 E h , and the values found using an active space cut-off of ±3000 E h . To account for the effect of higher lying virtual orbitals, half of this difference is taken as an additional uncertainty.\nThe baseline values do not take into account CC triple excitations. The differences between the results obtained using the FSCCSDT and the FSCCSD methods, as given in Section IV E, were used to correct for this omission. Since these results may not be fully converged yet, the effect of including triple excitations is used to estimate the uncertainty arising from not including quadruple and higher excitations. The obtained differences between the FSCCSDT and FSCCSD results is multiplied one half to account for the uncertainty due to excitations involving more than three electrons.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Geometry", "text": "The bond length uncertainty contributes to the enhancement factor uncertainty due to the geometry of the systems. To estimate the uncertainty due to the bond length, the enhancement factors were computed for internuclear distances 0.01 Å larger and smaller than the calculated R e . The largest deviations from the parameters at equilibrium bond lengths were taken as their uncertainties.\nYbCu W d YbCu W s YbAg W d YbAg W s YbAu W d YbAu W s", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Source of Uncertainty", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Basis set Electron correlation Geometry", "text": "The vibrational corrections obtained in Section IV F 2 are applied to the baseline values, as can be seen in Table VI.", "publication_ref": [], "figure_ref": [], "table_ref": ["tab_6"]}, {"heading": "Sum of atomic Ws approximation", "text": "Due to the fact that the interaction constants k s,K in Eq. ( 17) are specific to each nucleus, calculating the total W s value as a sum of the atomic contribution is only approximate and introduces an associated error. We analyze this error in detail in an upcoming publication 60 . Here, we provide the resulting uncertainties of 0.059, 0.308 and 1.318 h kHz for YbCu, YbAg and YbAu, respectively. We note that the specific errors differ for each isotopologue. Therefore, here we use the isotopic average weighted by the natural abundances of all constituting elements.", "publication_ref": ["b60"], "figure_ref": [], "table_ref": []}, {"heading": "Total uncertainty", "text": "To compute the total uncertainties for the reference values of the enhancement factors of YbCu, YbAg and YbAu, the Euclidean norm of the individual uncertainties is taken. These total uncertainties are obtained on the assumption that the different contributions are largely independent, since they concern high order effects.\nThe relative uncertainties of W s (0.33%, 0.63% and 22.74%, for YbCu, YbAg and YbAu, respectively) are larger than those found for W d (0.13%, 0.61% and 13.12%, for YbCu, YbAg and YbAu, respectively). For these systems, the enhancement factors are dominated by the uncertainty due to missing higher CC excitations and, to a smaller degree, by the basis set incompleteness, as illustrated in Figure 9.\nThe results for YbAu have significantly higher relative uncertainty than the other two systems. Both enhancement factors of this system are relatively small, due to a cancellation of similar sized contributions from the two constituent atoms, rendering them unstable and very sensitive to the computational settings and leading to a large relative uncertainty. The calculated W s and W d of YbCu and YbAg have remarkably small uncertainties of less than a single percent. For comparison, similar computational approach yielded uncertainties of 3 -7% for the enhancement factors of BaF 59 , YbCH 3 46 , and LuO 61 . The lower uncertainty in the current case is partly due to the fact that we have corrected our results for the triple excitations, in contrast to the earlier works, where the missing excitations beyond doubles are a major source of uncertainty.", "publication_ref": ["b46"], "figure_ref": ["fig_6"], "table_ref": []}, {"heading": "H. Comparison to other systems", "text": "The calculated enhancement factors are compared to those found for other ytterbium-containing molecules in Table VIII. Additionally, some of the systems currently used in experiments aiming to restrict the upper limit on the eEDM were added. The W d and W s factors of YbCu and YbAg are of similar magnitude to those found for YbOH, YbCH 3 and YbF. Both enhancement factors of YbAu are significantly smaller than those found for any other ytterbium-containing system.\nSince both the interactions of the eEDMs with electromagnetic fields and the S-PS-ne neutral-current interactions may contribute to an eventual experimental de- tection of P, T -violating effects in molecules, these two type of interactions should be decoupled from each other. This can be done by performing measurements on systems with different enhancement factor ratios 16 . For the systems studied in this work, and some other molecules currently and previously under investigation, these ratios can be calculated from the values of enhancement factors reported in Table VIII.", "publication_ref": ["b16"], "figure_ref": [], "table_ref": ["tab_8", "tab_8"]}, {"heading": "V. CONCLUSION", "text": "In order to extract information about the P, Tviolating effects arising from both the interactions between eEDMs and electromagnetic fields and the S-PS-ne neutral-current interactions from precision experiments in paramagnetic polar molecules containing only non-zero nuclear spins, the enhancement factors W d and W s have to be obtained through molecular electronic structure computations. In this work, these parameters were computed for the YbCu, YbAg and YbAu systems, selected due to their possible experimental advantages. The enhancement factors W d were calculated using two different schemes, and here we report (to the best of our knowledge) the first 4C computations using scheme 1. Besides, a thorough uncertainty analysis was performed to assign a conservative error on the obtained results.\nThe recommended values were calculated using the FSCC method and the 4C DC Hamiltonian in conjunction with relativistic basis sets. The main contributing sources of uncertainty are due to the limited basis set sizes and the neglect of CC excitations beyond triples.\nThe obtained enhancement factors of YbCu and YbAg are of very similar size to other Yb-containing compounds investigated in the literature. In case of YbAu, the cellation of the contributions arising from the two nuclei in the system leads to vanishingly small total W d and W s values. For YbCu and YbAg, the results are also of similar size as for other systems currently investigated experimentally to search for signs of P, T -violating effects. Compared to YbF and YbOH, the alternate method of producing and cooling these systems provides an alternative route for future experiments setting a lowest upper limit on the eEDM.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "SUPPLEMENTARY MATERIAL", "text": "In the Supplementary Material we analyze the influence of the active space (in particular, of the energy of occupied and virtual correlated orbitals) on the calculation of W d and W s . We also present a set of tables where we report the values of these parameters using different nuclear models, different schemes corresponding to the use of the two effective Hamiltonians described in this work (for the case of W d ), and a few different basis sets. In addition, tables are provided showing the dependence of the molecular enhancement factors on the use of different methods to treat electron correlation, on vibrational effects, and also the contributions to W d and W s associated with each nucleus of the studied molecular systems. nucleus is small, as can be observed in Figure 1 and Figure 2. Because of the cancellation of contributions, the trend is more chaotic for YbAu, in particular for W s .\nThe final results will be computed with 2, 4 and 56 electrons frozen for YbCu, YbAg and YbAu, respectively. For YbCu and YbAg, both parameters are only underestimated by ∼ 0.9% at this level. For YbAu, correlating more electrons with a larger basis set is currently not computationally possible due to the large size of these systems. Any under-representation will be dealt with by correcting the baseline values.  The enhancement factor is given as a percentage of the result obtained when correlating all electrons. These results were obtained on the FSCCSD/v2z level with a symmetric virtual space cut-off.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Correlated virtual orbitals", "text": "Including more virtual orbitals has a noticeable impact on the computed enhancement factors. Figure 3 shows the behavior of W d for increasing virtual space cut-off. The W d results are given as a percentage of the result found with a virtual space cut-off at 6000 E h . It is assumed that at this virtual space cut-off, the enhancement factor has converged. The computations were performed with all electrons correlated on the FSCCSD/v2z level. It should be noted that lower lying virtual orbitals lie closer together than higher lying virtual orbitals. For YbCu, for example, only 14 orbitals are present between the 3000 E h cut-off and the 6000 E h cut-off, while between 10 E h and 30 E h there are 62 orbitals.\nAgain, the behavior for YbCu and YbAg is similar, with W d decreasing when reducing the number of included virtual orbitals. Only when the virtual orbital cut-off is set below 500 E h does W d drop below ∼ 1% of its value at 6000 E h for both systems. The behavior of YbAu is again significantly different because of the partial cancellation of individual contributions.\nThe results for W s with a virtual orbital cut-off of 3000 E h and 6000 E h are comparable in percentage to those found for W d , as can be seen in Table II. Since these are the only relevant values for the uncertainty determination, computations with lower virtual space cut-offs were not performed for W s .\nFor the baseline computations, symmetric virtual orbital cut-offs were selected. These were ±500 E h , ±500 E h and ±40 E h for YbCu, YbAg and YbAu, respectively. The effect of excluded higher lying virtual orbitals will be accounted for in the calculation of the final values.        ", "publication_ref": [], "figure_ref": [], "table_ref": ["tab_1"]}, {"heading": "", "text": "Supplementary Material -P, T -odd effects in YbCu, YbAg and YbAu Johan David Polet, 1 Yuly Chamorro, 1, 2 Lukáš F. Pašteka, 1,2,3 Steven Hoekstra, 1,2 Micha l Tomza, 4 Anastasia Borschevsky, 1, 2 and I. Agustín Aucar To reduce computational effort and make these calculations tractable, we have reduced both the amount of correlated electrons and the size of the correlated virtual space. In the following, we examine the effect of these measures on the calculated enhancement factors.", "publication_ref": ["b0", "b0", "b1", "b2", "b0", "b1", "b3"], "figure_ref": [], "table_ref": []}, {"heading": "Correlated occupied orbitals", "text": "Table I, Figure 1, and Figure 2 show the behavior of the enhancement factors with increasing number of correlated electrons. The virtual space cut-off -which dictates the number of virtual orbitals to include-was set to be symmetric in terms of energy with the active space cut-off. The results were obtained using the FSCCSD method and the v2z basis set.\nWhen halving the number of correlated electrons, all enhancement factors remain within 23% of the results found when correlating all electrons. Freezing further electrons has a more significant effect on the parameters. The behavior of both parameters is similar for YbCu and YbAg, where the contribution from the secondary TABLE X: The various sources of uncertainty for W s,Yb and W s,X of YbCu, YbAg and YbAu (X = Cu, Ag, Au). The uncertainties are assumed to be independent, and the total uncertainty of the final results are given accordingly. ", "publication_ref": [], "figure_ref": [], "table_ref": []}], "references": [{"ref_id": "b0", "title": "The standard model of particle physics", "journal": "Rev. Mod. Phys", "year": "1999", "authors": "M K Gaillard; P D Grannis; F J Sciulli"}, {"ref_id": "b1", "title": "Search for new physics with atoms and molecules", "journal": "Rev. Mod. Phys", "year": "2018", "authors": "M S Safronova; D Budker; D Demille; D F J Kimball; A Derevianko; C W Clark"}, {"ref_id": "b2", "title": "Beyond the standard model of particle physics", "journal": "Phil. Trans. R. Soc. A", "year": "2016", "authors": "T S Virdee"}, {"ref_id": "b3", "title": "Beyond the Standard Model Cocktail: A Modern and Comprehensive Review of the Major Open Puzzles in Theoretical Particle Physics and Cosmology with a Focus on Heavy Dark Matter", "journal": "Springer Cham", "year": "2023", "authors": "Y Gouttenoire"}, {"ref_id": "b4", "title": "Violations of fundamental symmetries in atoms and tests of unification theories of elementary particles", "journal": "Phys. Rep", "year": "2004", "authors": "J Ginges; V Flambaum"}, {"ref_id": "b5", "title": "Enhancement factor for the electric dipole moment of the valence electron in an alkali atom", "journal": "Phys. Lett", "year": "1966", "authors": "P Sandars"}, {"ref_id": "b6", "title": "Large Long-Distance Contributions to the Electric Dipole Moments of Charged Leptons in the Standard Model", "journal": "Phys. Rev. Lett", "year": "2020", "authors": "Y Yamaguchi; N Yamanaka"}, {"ref_id": "b7", "title": "The electric dipole moment of an atom", "journal": "Phys. Lett", "year": "1965", "authors": "P Sandars"}, {"ref_id": "b8", "title": "Semiempirical Calculations of P-and P, T-odd Effects in Diatomic Molecules-Radicals", "journal": "Zh. Eksp. Teor. Fiz", "year": "1985", "authors": "M G Kozlov"}, {"ref_id": "b9", "title": "Parity breaking effects in diatomic molecules", "journal": "Zh. Eksp. Teor. Fiz", "year": "1978", "authors": "O P Sushkov; V V Flambaum"}, {"ref_id": "b10", "title": "An improved bound on the electron's electric dipole moment", "journal": "Science", "year": "2023", "authors": "T S Roussy; L Caldwell; T Wright; W B Cairncross; Y Shagam; K B Ng; N Schlossberger; S Y Park; A Wang; J Ye"}, {"ref_id": "b11", "title": "Improved limit on the electric dipole moment of the electron", "journal": "Nature", "year": "2018", "authors": " "}, {"ref_id": "b12", "title": "Surprising upper limit on the electron's electric dipole moment", "journal": "Phys. Today", "year": "2014", "authors": "B M Schwarzschild"}, {"ref_id": "b13", "title": "Does the Electron EDM Preclude Electroweak Baryogenesis?", "journal": "", "year": "2024", "authors": "Y.-Z Li; M J Ramsey-Musolf; J.-H Yu"}, {"ref_id": "b14", "title": "Effects of nonconservation of spatial and temporal parities in spectra of diatomic molecules", "journal": "Zh. Eksp. Teor. Fiz", "year": "1979", "authors": "V G Gorshkov; L N Labzovski; A N Moskalev"}, {"ref_id": "b15", "title": "", "journal": "Sov. Phys. JETP", "year": "1979", "authors": ""}, {"ref_id": "b16", "title": "Systematic study of relativistic and chemical enhancements of P, T -odd effects in polar diatomic radicals", "journal": "Phys. Rev. A", "year": "2019", "authors": "K Gaul; S Marquardt; T Isaev; R Berger"}, {"ref_id": "b17", "title": "The electric dipole moment of the electron: An intuitive explanation for the evasion of Schiff's theorem", "journal": "Am. J. Phys", "year": "2007", "authors": "E D Commins; J D Jackson; D P Demille"}, {"ref_id": "b18", "title": "Cold and ultracold molecules: science, technology and applications", "journal": "New J. Phys", "year": "2009", "authors": "L D Carr; D Demille; R V Krems; J Ye"}, {"ref_id": "b19", "title": "Ultracold Molecular Assembly", "journal": "", "year": "2017", "authors": "L R Liu; J T Zhang; Y Yu; N R Hutzler; Y Liu; T Rosenband; K.-K Ni"}, {"ref_id": "b20", "title": "Electron Electric Dipole Moment Searches Using Clock Transitions in Ultracold Molecules", "journal": "Phys. Rev. Lett", "year": "2020", "authors": "M Verma; A M Jayich; A C Vutha"}, {"ref_id": "b21", "title": "Magneto-optical trapping of silver atoms", "journal": "Phys. Rev. A", "year": "2000", "authors": "G Uhlenberg; J Dirscherl; H Walther"}, {"ref_id": "b22", "title": "Magneto-optical trapping of Yb atoms and a limit on the branching ratio of the 1 P 1 state", "journal": "Phys. Rev. A", "year": "1999", "authors": "K Honda; Y Takahashi; T Kuwamoto; M Fujimoto; K Toyoda; K Ishikawa; T Yabuzaki"}, {"ref_id": "b23", "title": "Time keeping and searching for new physics using metastable states of Cu, Ag, and Au", "journal": "Phys. Rev. A", "year": "2021", "authors": "V A Dzuba; S O Allehabi; V V Flambaum; J Li; S Schiller"}, {"ref_id": "b24", "title": "Highly polar molecules consisting of a copper or silver atom interacting with an alkali-metal or alkaline-earth-metal atom", "journal": "Phys. Rev. A", "year": "2021", "authors": "M Śmia; M Tomza"}, {"ref_id": "b25", "title": "Theoretical aspects of radiumcontaining molecules amenable to assembly from laser-cooled atoms for new physics searches", "journal": "New J. Phys", "year": "2021", "authors": "T Fleig; D Demille"}, {"ref_id": "b26", "title": "Prospects for assembling ultracold radioactive molecules from laser-cooled atoms", "journal": "New J. Phys", "year": "2022", "authors": "J ; H Li; E Tiesinga; S Kotochigova"}, {"ref_id": "b27", "title": "Candidate molecules for next-generation searches of hadronic charge-parity violation", "journal": "Phys. Rev. A", "year": "2023", "authors": "A Marc; M Hubert; T Fleig"}, {"ref_id": "b28", "title": "Interaction potentials, electric moments, polarizabilities, and chemical reactions of YbCu, YbAg, and YbAu molecules", "journal": "New J. Phys", "year": "2021", "authors": "M Tomza"}, {"ref_id": "b29", "title": "Possibility of investigating P-and T-odd nuclear forces in atomic and molecular experiments", "journal": "Zh. Eksp. Teor. Fiz", "year": "1984", "authors": "O Sushkov; V Flambaum; I Khriplovich"}, {"ref_id": "b30", "title": "Spin hedgehog and collective magnetic quadrupole moments induced by parity and time invariance violating interaction", "journal": "Phys. Lett. B", "year": "1994", "authors": "V Flambaum"}, {"ref_id": "b31", "title": "Electric dipole moments of nucleons, nuclei, and atoms: The Standard Model and beyond", "journal": "Prog. Part. Nucl. Phys", "year": "2013", "authors": "J Engel; M J Ramsey-Musolf; U Van Kolck"}, {"ref_id": "b32", "title": "Electric dipole moments: A global analysis", "journal": "Phys. Rev. C", "year": "2015", "authors": "T Chupp; M Ramsey-Musolf"}, {"ref_id": "b33", "title": "Parity violation effects in diatomics", "journal": "J. Phys. B", "year": "1995", "authors": "M G Kozlov; L N Labzowsky"}, {"ref_id": "b34", "title": "Some atomic effects of an electronic electric dipole moment", "journal": "Phys. Rev", "year": "1958", "authors": "E E Salpeter"}, {"ref_id": "b35", "title": "Quantum Mechanics of Oneand Two-Electron Atoms", "journal": "Springer", "year": "1957", "authors": "H A Bethe; E E Salpeter"}, {"ref_id": "b36", "title": "Order α 2 theory of the atomic electric dipole moment due to an electric dipole moment on the electron", "journal": "J. Phys. B", "year": "1989", "authors": "E Lindroth; B W Lynn; P G H Sandars"}, {"ref_id": "b37", "title": "Calculations of Atomic Electric Dipole Moments", "journal": "Phys. Scr", "year": "1987", "authors": "A.-M Mårtensson-Pendrill; P Öster"}, {"ref_id": "b38", "title": "Measurability of nuclear electric dipole moments", "journal": "Phys. Rev", "year": "1963", "authors": "L I Schiff"}, {"ref_id": "b39", "title": "The 2018 CODATA Recommended Values of the Fundamental Physical Constants", "journal": "", "year": "2018", "authors": "E Tiesinga; P J Mohr; D B Newell; B N Taylor"}, {"ref_id": "b40", "title": "a relativistic ab initio electronic structure program, Release DIRAC19", "journal": "", "year": "2019", "authors": "L Dirac ; . Saue; H J Visscher;  Aa; R Jensen; ; Bast; T Faßhauer; O Fleig; L Fossgaard; E D Halbert; B Hedegård; T Heimlich-Paris; J Helgaker; M Henriksson; Ch R Iliaš; S Jacob; S Knecht; O Komorovský; J K Kullie; C V Laerdahl; Y S Larsen; H S Lee; M K Nataraj; P Nayak; G Norman; J Olejniczak; J M H Olsen; Y C Olsen; J K Park; M Pedersen; R Pernpointner; K Di Remigio; P Ruud; B Sa Lek; B Schimmelpfennig; A Senjean; J Shee; A J Sikkema; J Thorvaldsen; J Thyssen; M L Van Stralen; S Vidal; O Villaume; T Visser; S Winther;  Yamamoto"}, {"ref_id": "b41", "title": "The DIRAC Code for Relativistic Molecular Calculations", "journal": "J. Chem. Phys", "year": "2020", "authors": "T Saue; R Bast; A S P Gomes; H J A Jensen; L Visscher; I A Aucar; R Di Remigio; K G Dyall; E Eliav; E Faßhauer; T Fleig; L Halbert; E D Hedegård; B Helmich-Paris; M Iliaš; C R Jacob; S Knecht; J K Laerdahl; M Lopez Vidal; M K Nayak; G Olejniczak; J M H Olsen; M Pernpointner; B Senjean; A Shee; A Sunaga; J N P Van Stralen"}, {"ref_id": "b42", "title": "Formulation and implementation of the relativistic Fock-space coupled cluster method for molecules", "journal": "J. Chem. Phys", "year": "2001", "authors": "L Visscher; E Eliav; U Kaldor"}, {"ref_id": "b43", "title": "Enhanced P,Tviolating nuclear magnetic quadrupole moment effects in lasercoolable molecules", "journal": "J. Chem. Phys", "year": "2020", "authors": "M Denis; Y Hao; E Eliav; N R Hutzler; M K Nayak; R G E Timmermans; A Borschesvky"}, {"ref_id": "b44", "title": "Inner-shell excitation in the YbF molecule and its impact on laser cooling", "journal": "J. Mol. Spectrosc", "year": "2022", "authors": "C Zhang; C Zhang; L Cheng; T C Steimle; M R Tarbutt"}, {"ref_id": "b45", "title": "Enhancement factor for the electric dipole moment of the electron in the BaOH and YbOH molecules", "journal": "Phys. Rev. A", "year": "2019", "authors": "M Denis; P A B Haase; R G E Timmermans; E Eliav; N R Hutzler; A Borschevsky"}, {"ref_id": "b46", "title": "Molecular enhancement factors for the P, T -violating electric dipole moment of the electron in BaCH 3 and YbCH 3 symmetric top molecules", "journal": "Phys. Rev. A", "year": "2022", "authors": "Y Chamorro; A Borschevsky; E Eliav; N R Hutzler; S Hoekstra; L F Pašteka"}, {"ref_id": "b47", "title": "EXP-T, An Extensible Code for Fock Space Relativistic Coupled Cluster Calculations", "journal": "", "year": "2020", "authors": "A V Oleynichenko; A Zaitsevskii; E Eliav"}, {"ref_id": "b48", "title": "Towards High Performance Relativistic Electronic Structure Modelling: The EXP-T Program Package", "journal": "Commun. Comput. Inf. Sci", "year": "2020", "authors": "A V Oleynichenko; A Zaitsevskii; E Eliav"}, {"ref_id": "b49", "title": "Relativistic double-zeta, triple-zeta, and quadruple-zeta basis sets for the 5d elements Hf-Hg", "journal": "Theor. Chem. Acc", "year": "2004", "authors": "K G Dyall"}, {"ref_id": "b50", "title": "Relativistic double-zeta, triple-zeta, and quadruple-zeta basis sets for the 4d elements Y-Cd", "journal": "Theor. Chem. Acc", "year": "2007", "authors": "K G Dyall"}, {"ref_id": "b51", "title": "Revised relativistic basis sets for the 5d elements Hf-Hg", "journal": "Theor. Chem. Acc", "year": "2009", "authors": "K Dyall; A Severo"}, {"ref_id": "b52", "title": "Relativistic double-zeta, triple-zeta, and quadruple-zeta basis sets for the lanthanides La-Lu", "journal": "Theor. Chem. Acc", "year": "2010", "authors": "A S P Gomes; K G Dyall; L Visscher"}, {"ref_id": "b53", "title": "Diffuse basis functions for relativistic s and d block gaussian basis sets", "journal": "J. Chem. Theory Comput", "year": "2022", "authors": "K G Dyall; P Tecmer; A Sunaga"}, {"ref_id": "b54", "title": "Relativistic double-zeta, triple-zeta, and quadruple-zeta basis sets for the 6d elements Rf-Cn", "journal": "Theor. Chem. Acc", "year": "2011", "authors": "K G Dyall"}, {"ref_id": "b55", "title": "An infinite-order two-component relativistic hamiltonian by a simple one-step transformation", "journal": "J. Chem. Phys", "year": "2007", "authors": "M Iliaš; T Saue"}, {"ref_id": "b56", "title": "Relativistic effects in structural chemistry", "journal": "Chem. Rev", "year": "1988", "authors": "P Pyykko"}, {"ref_id": "b57", "title": "Finite Nuclear Charge Density Distributions in Electronic Structure Calculations for Atoms and Molecules", "journal": "Phys. Rep", "year": "2000", "authors": "D Andrae"}, {"ref_id": "b58", "title": "Diatomic molecules of alkali-metal and alkaline-earth-metal atoms: Interaction potentials, dipole moments, and polarizabilities", "journal": "Phys. Rev. A", "year": "2024", "authors": "H Ladjimi; M Tomza"}, {"ref_id": "b59", "title": "Systematic study and uncertainty evaluation of P,T -odd molecular enhancement factors in BaF", "journal": "J. Chem. Phys", "year": "2021", "authors": "P A B Haase; D J Doeglas; A Boeschoten; E Eliav; M Iliaš; P Aggarwal; H L Bethlem; A Borschevsky; K Esajas; Y Hao; S Hoekstra; V R Marshall; T B Meijknecht; M C Mooij; K Steinebach; R G E Timmermans; A P Touwen; W Ubachs; L Willmann; Y Yin"}, {"ref_id": "b60", "title": "Error analysis of the P, T -odd nucleon-electron interaction in diatomic molecules", "journal": "", "year": "2024", "authors": "L F Pašteka; I A Aucar; S Hoekstra; R Timmermans; A Borschevsky"}, {"ref_id": "b61", "title": "Parity and time-reversal symmetry violation in diatomic molecules: LaO, LaS and LuO", "journal": "", "year": "2024", "authors": "Y Chamorro; V Flambaum; R F G Ruiz; A Borschevsky; L F Pašteka"}, {"ref_id": "b62", "title": "Re-appraisal of the P,Todd interaction constant W d in YbF: Relativistic configuration interaction approach", "journal": "Pramana", "year": "2009", "authors": "M K Nayak; R K Chaudhuri"}, {"ref_id": "b63", "title": "Ab initio calculation of the electron-nucleus scalar-pseudoscalar interaction constant W S in heavy polar molecules", "journal": "Phys. Rev. A", "year": "2007", "authors": "M K Nayak; R K Chaudhuri; B P Das"}, {"ref_id": "b64", "title": "Application of relativistic coupled-cluster theory to the effective electric field in YbF", "journal": "Phys. Rev. A", "year": "2014", "authors": "M Abe; G Gopakumar; M Hada; B P Das; H Tatewaki; D Mukherjee"}, {"ref_id": "b65", "title": "Relativistic coupled-cluster calculation of the electron-nucleus scalarpseudoscalar interaction constant Ws in YbF", "journal": "Phys. Rev. A", "year": "2016", "authors": "A Sunaga; M Abe; M Hada; B P Das"}, {"ref_id": "b66", "title": "P, T -odd and magnetic hyperfine-interaction constants and excited-state lifetime for HfF +", "journal": "Phys. Rev. A", "year": "2017", "authors": "T Fleig"}, {"ref_id": "b67", "title": "Communication: Theoretical study of ThO for the electron electric dipole moment search", "journal": "J. Chem. Phys", "year": "2013", "authors": "L V Skripnikov; A N Petrov; A V Titov"}, {"ref_id": "b68", "title": "Relativistic coupled-cluster study of BaF in search of CP violation", "journal": "J. Phys. B", "year": "2020", "authors": "K Talukdar; M K Nayak; N Vaval; S Pal"}], "figures": [{"figure_label": "", "figure_type": "figure", "figure_id": "fig_0", "figure_caption": "103403426 h kHz was used to convert the values of W s (K) to h kHz. All values of the fundamental constants were taken from Ref.39.   ", "figure_data": ""}, {"figure_label": "212", "figure_type": "figure", "figure_id": "fig_1", "figure_caption": "Figure 2 FIG. 1 .FIG. 2 .212Figure2shows the nuclear size effects on W s . The contributions from each of the nuclei are shown, as well as the total values of W s , represented by hatched blocks. The contributions associated with the nuclei of the coinage metals become increasingly important as their atomic number increases. Moreover, as expected, these contributions are of opposite sign to those of ytterbium, because in the region between the two nuclei", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "fig_2", "figure_caption": "C. W d : Comparison of schemes 1 and 2", "figure_data": ""}, {"figure_label": "5", "figure_type": "figure", "figure_id": "fig_4", "figure_caption": "FIG. 5 .5FIG.5. The Ws enhancement factor of YbCu, YbAg and YbAu, for v2z, v3z and v4z basis sets, individual contributions from each nucleus. Computations were performed at the FSCCSD level. The hatched blocks correspond to the sum of the contributions from both elements.", "figure_data": ""}, {"figure_label": "7", "figure_type": "figure", "figure_id": "fig_5", "figure_caption": "FIG. 7 .7FIG.7. The Ws enhancement factor of YbCu, YbAg and YbAu computed at the level of DHF, MP2, and FSCC approaches. Results from each nucleus are given separately. The combined values are indicated by the hatched blocks. These computations were performed using the same basis set and active space cut-offs as in Fig.6.", "figure_data": ""}, {"figure_label": "9", "figure_type": "figure", "figure_id": "fig_6", "figure_caption": "FIG. 9 .9FIG. 9. The distribution of all sources of uncertainty, given as a percentage of the total uncertainty of W d and Ws for YbCu, YbAg and YbAu. The outer donut charts show the main uncertainty sources, while the inner donut charts show the individual sources of uncertainty.", "figure_data": ""}, {"figure_label": "I", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Equilibrium bond distances, Re, of YbCu, YbAg and YbAu ( Å) computed at the X2C/CCSD/s-aug-v4z level of theory. Including comparison to previous results obtained using energy-consistent pseudopotentials (ECP).", "figure_data": "Re [ Å]SourceMethodRelativityYbCu YbAg YbAuThis work CCSDX2C2.7543 2.8589 2.6524Ref. 28CCSD(T) ECP2.910 3.063 2.939"}, {"figure_label": "II", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "Reference values of W d and Ws for YbCu, YbAg and YbAu. These results were obtained on the FSCCSD/v3z level of theory, while freezing 2, 4 and 56 electrons, respectively.", "figure_data": "MoleculeW d 10 24 h Hz e cmWs [h kHz]YbCu13.122-47.647YbAg11.869-44.361YbAu1.3266.979"}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_3", "figure_caption": "DHF results differ the most from the FSCC values, while the MP2 values are close to the CC results for YbCu and YbAg. On the other hand, going from MP2 to FSCC reduced the value of W d for YbAu by a", "figure_data": "DHF MP2FSCCSD FSCCSDT10W d [ 10 24 h Hz e cm ]2 4 6 80YbCuYbAgYbAuFIG. 6. The W d enhancement factor of YbCu, YbAg andYbAu computed at DHF, MP2, and FSCC levels of approach.These computations were performed using the v2z basis set,and the active space cut-offs were set to ±2 E h , freezing 66, 84 and 116 electrons of YbCu, YbAg and YbAu, respectively."}, {"figure_label": "III", "figure_type": "table", "figure_id": "tab_4", "figure_caption": "The enhancement factors W d and Ws of YbCu, YbAg and YbAu computed at the DHF, MP2, and two different FSCC levels of approach. Computations were performed using v2z basis set.", "figure_data": "W d 10 24 h Hz e cmWs [h kHz]MethodYbCu YbAg YbAuYbCu YbAg YbAuDHF9.652 7.044 3.770 -33.081 -32.547 -22.275MP211.174 9.188 2.314 -38.670 -37.696 -15.822FSCCSD11.323 10.415 1.072 -39.162 -36.897 7.385FSCCSDT 11.310 10.555 1.567 -39.210 -37.406 5.268TABLE IV. The enhancement factors W d and Ws of YbCu,YbAg and YbAu, computed at three different displacements(δR) with respect to the equilibrium bond length. Computa-tions were performed on the FSCCSD/v2z level of approach.W d 10 24 h Hz e cmWs [h kHz]δR [ Å]YbCu YbAg YbAuYbCu YbAg YbAu-0.0112.536 11.494 1.541-43.476 -40.881 6.5810.0012.512 11.477 1.619-43.390 -40.813 6.2190.0112.487 11.460 1.695-43.303 -40.742 5.866F. Influence of molecular geometry1. Uncertainty associated to the bond length"}, {"figure_label": "VI", "figure_type": "table", "figure_id": "tab_6", "figure_caption": "Final recommended values of W d and Ws for YbCu, YbAg and YbAu. The various corrections to the baseline values are shown. W d 10 24 h Hz", "figure_data": "e cmWs [h kHz]YbCu YbAg YbAuYbCu YbAg YbAuBaseline values13.122 11.869 1.326-47.647 -44.361 6.979CorrectionsBasis set (v4z vs v3z)0.020 0.035 0.193-0.269 -0.238 -0.983Active space (all-electron/+6000 E h vs baseline)0.149 0.135 0.105-0.517 -0.483 1.478Higher excitations (FSCCSDT vs FSCCSD)-0.013 0.139 0.495-0.047 -0.509 -2.117Vibrational effects-0.032 -0.024 0.0130.115 0.086 -0.048Recommended values13.245 12.154 2.131-48.365 -45.505 5.309"}, {"figure_label": "VII", "figure_type": "table", "figure_id": "tab_7", "figure_caption": "The various sources of uncertainty for W d and Ws of YbCu, YbAg and YbAu. The uncertainties are assumed to be independent, and the total uncertainty of the final results are given accordingly.", "figure_data": "δW d 10 24 h Hz e cmδWs h kHzUncertainty sourceYbCu YbAg YbAuYbCu YbAg YbAuBasis setBasis set quality0.010 0.018 0.0970.135 0.120 0.492Diffuse functions0.002 0.005 0.0330.003 0.013 0.143Tight functions0.001 0.002 0.0060.001 0.006 0.024Electron correlationVirtual space cut-off0.019 0.016 0.0050.059 0.054 0.003Higher excitations0.007 0.070 0.2480.024 0.255 1.059Geometry0.013 0.017 0.0810.087 0.070 0.358Sum of Ws approx.---0.059 0.308 1.313Total uncertaintyAbsolute uncertainty0.026 0.076 0.2800.182 0.426 1.799Relative uncertainty [%]0.19 0.62 13.130.38 0.94 33.94"}, {"figure_label": "VIII", "figure_type": "table", "figure_id": "tab_8", "figure_caption": "Reference values of W d and Ws for YbCu, YbAg and YbAu compared to other Ytterbium-containing molecules and systems currently or previously investigated to determine the lowest upper limits on de and ks.", "figure_data": "SystemSourceW d 10 24 h Hz e cmWs [h kHz]YbCuThis work13.24(3)-48.36(18)YbAgThis work12.15(8)-45.5(4)YbAuThis work2.13(28)5.3(18)YbOHRef. 4511.32(48)YbCH3Ref. 4613.80(35)-50.16(127)YbFRef. 6211.64Ref. 63-41.2Ref. 6411.17(89)Ref. 6511.23-40.52(324)RaAgRef. 2530.9-175.1HfF +Ref. 6610.9820.0ThORef. 6720116BaFRef. 593.13(12)8.29(12)Ref. 683.15(30)8.35(70)Ref. 63-9.7"}, {"figure_label": "I", "figure_type": "table", "figure_id": "tab_10", "figure_caption": "The enhancement factors of YbCu, YbAg and YbAu computed with different numbers of correlated electrons, N co el . The factors were computed at the FSCCSD/v2z level.", "figure_data": "N co elFrozen orbitalsCut-offsW dWsYbCu[E h ]10 24 h Hz e cm[%]h kHz[%]27[Xe][Ar]19.890 -22.75-34.443 -22.4643[Kr]4d 10 [Ne]611.629 -9.16-40.278 -9.3261[Ar]3d 10 [Ne]2012.169 -4.95-42.239 -4.9187[Ne][He]10012.512 -2.27-43.390 -2.3197[He]-50012.691 -0.87-44.019 -0.9099--300012.803--44.418-N co elYbAg27[Xe][Kr]0.89.063 -22.78-32.395 -22.4353[Kr][Ar]3d 101010.966 -6.57-38.974 -6.6879[Ar]3d 10 [Ne]3011.268 -3.99-40.112 -3.9597[Ne][Ne]10011.477 -2.21-40.813 -2.28113[He][He]50011.634 -0.87-41.387 -0.90117--300011.737--41.763-N co elYbAu35[Kr]3d 10 [Xe]3f 142.681.071 -34.187.683 18.3467[Kr][Kr]4d 10101.595 -1.915.704 -12.1593[Ar]3d 10 [Ar]3d 10401.532 -5.815.019 -22.69121[Ne][Ne]951.620 -0.386.219 -4.22149--30001.626-6.493-120s (All electrons) % W80 90 100 110YbCu YbAg YbAu0.20.4 Fraction of correlated electrons 0.6 0.81.0FIG. 2: Graphical representation of the behavior of W sof YbCu, YbAg and YbAu for varying numbers of corre-lated electrons."}, {"figure_label": "II", "figure_type": "table", "figure_id": "tab_11", "figure_caption": "The enhancement factors of YbCu, YbAg and YbAu computed with different virtual orbital cut-offs. The factors were computed at the FSCCSD/v2z level, correlating all the electrons.", "figure_data": "W dWsSystem Cut-off [E h ]10 24 h Hz e cm[%]h kHz [%]YbCu300012.803-0.29-44.418 -0.26600012.840--44.539 -YbAg300011.737-0.27-41.763 -0.26600011.769--41.870 -YbAu30001.626-0.616.493 -0.0860001.636-6.498 -100.097.5% (6000 a.u.)85.0 87.5 90.0 92.5 95.010 110 2 Virtual space cut-off [a.u.] 10 3YbCu YbAg YbAuFIG. 3: The d enhancement factor of YbCu, YbAgand YbAu, for various virtual space cut-offs, comparedto the result with a virtual space cut-off at 6000 E h .Computations were performed correlating all electronsat the FSCCSD/v2z level."}, {"figure_label": "III", "figure_type": "table", "figure_id": "tab_12", "figure_caption": "Tabular representation of the behavior of W d for YbCu, YbAg and YbAu using Gaussian-type and point-type nuclear models (GN and PN, respectively). These results were obtained on the FSCCSD/v2z level, correlating all the electrons, and with a virtual space cutoff at 3000 E h .", "figure_data": "W d 10 24 h Hz e cmMoleculePNGNYbCu12.93912.803YbAg11.87011.737YbAu1.4881.626"}, {"figure_label": "V", "figure_type": "table", "figure_id": "tab_13", "figure_caption": "Tabular representation of the behavior of W d of YbCu, YbAg and YbAu computed using scheme 1 (S1) and scheme 2 (S2). For S1, the contributions from both nuclei are shown (Yb and X = Cu, Ag, Au). These results were obtained on the FSCCSD/v3z level, with symmetric space cut-offs of ±500 E h for YbCu and YbAg, and ±40 E h for YbAu. Point-like nuclear models were used in all cases.", "figure_data": "e cmMoleculeS1 (Yb)S1 (X)S1 (Total)S2YbCu13.807-0.16613.64013.435YbAg13.489-1.14112.34812.172YbAu13.330-12.1431.1881.131W d W sv3z cv3z s-aug-v3zW d [ 10 24 h Hz e cm ]2.5 5.0 7.5 10.0 12.510 40 20 30 |W s | [h kHz]YbCuYbAgYbAu"}, {"figure_label": "IV", "figure_type": "table", "figure_id": "tab_14", "figure_caption": "Contributions to W s for YbCu, YbAg and YbAu, arising from each individual nucleus. The results were obtained on the FSCCSD/v2z level of theory with all electrons correlated and a virtual space cut-off of 3000 E h . A Gaussian-type and a point-like nuclear models (GN and PN, respectively) were used. The sum of individual contributions W s,Yb + W s,X (X = Cu, Ag, Au) is also given.W s,Yb 10 24 h Hz e cm Ws,X 10 24 h Hz e cm W s,Yb + Ws,X 10 24 h Hz", "figure_data": "e cmMoleculePNGNPNGNPNGNYbCu-51.563-44.6560.2380.238-51.325-44.418YbAg-50.690-43.9002.2172.137-48.473-41.763YbAu-51.966-45.00264.09451.49512.1286.493"}, {"figure_label": "VI", "figure_type": "table", "figure_id": "tab_15", "figure_caption": "Enhancement factors of YbCu, YbAg and YbAu, for v2z, v3z, v4z, cv3z and s-aug-v3z basis sets. Computations were performed at the FSCCSD level, with active space cut-offs set to ±20 E h for YbCu and ±10 E h for YbAg and YbAu. For W s , the individual contributions and the sum W s,Yb + W s,X (X = Cu, Ag, Au) are given. .966 1.595 -42.457 -40.930 -41.780 0.218 1.955 47.484 -42.239 -38.974 5.704 v3z 12.594 11.158 1.122 -46.011 -44.041 -44.770 0.256 2.341 52.264 -45.755 -41.700 7.494 v4z 12.614 11.193 1.314 -46.292 -44.398 -45.076 0.268 2.459 51.587 -46.024 -41.939 6.511 cv3z 12.594 11.159 1.127 -46.011 -44.048 -44.763 0.256 2.342 52.233 -45.755 -41.706 7.470 s-aug-v3z 12.593 11.153 1.089 -46.010 -44.033 -44.735 0.257 2.345 52.371 -45.753 -41.688 7.637", "figure_data": "W d 10 24 h Hz e cmW s,Yb [h kHz]Ws,X [h kHz]W s,Yb + Ws,X [h kHz]MethodYbCu YbAg YbAu YbCu YbAg YbAuYbCu YbAg YbAuYbCu YbAg YbAuv2z12.169 10"}, {"figure_label": "VII", "figure_type": "table", "figure_id": "tab_16", "figure_caption": "Enhancement factors W d and W s of YbCu, YbAg and YbAu computed at the HF, MP2, FSCC-SD and FSCC-SDT levels of approach. Computations were done at v2z level, and the active space cut-off was set to ±2 E h for the three systems. For W s , the individual contributions and the sums W s,Yb + W s,X (X = Cu, Ag, Au) are given.W d 1024 h Hz e cm W s,Yb [h kHz] Ws,X [h kHz] W s,Yb + Ws,X [h kHz] Method YbCu YbAg YbAu YbCu YbAg YbAu YbCu YbAg YbAu YbCu YbAg YbAu HF 9.652 7.044 3.770 -33.118 -32.900 -34.894 0.037 0.353 12.619 -33.081 -32.547 -22.275 MP2 11.174 9.188 2.314 -38.745 -38.401 -38.674 0.075 0.705 22.852 -38.670 -37.696 -15.822 FSCCSD 11.323 10.415 1.072 -39.365 -38.696 -40.187 0.203 1.798 47.572 -39.162 -36.897 7.385 FSCCSDT 11.310 10.555 1.567 -39.435 -39.167 -40.710 0.225 1.761 45.978 -39.210 -37.406 5.268", "figure_data": ""}, {"figure_label": "VIII", "figure_type": "table", "figure_id": "tab_17", "figure_caption": "Enhancement factors W d and W s of YbCu, YbAg and YbAu, computed at different displacements (δ R ) with respect to the calculated equilibrium bond lengths (R e,YbCu = 2.7543 Å, R e,YbAg = 2.8589 Å, and R e,YbAu = 2.6524 Å). Computations were performed on the FSCCSD/v2z level of approach, with active space cut-offs set to ±100 E h for YbCu and YbAg, and ±95E h for YbAu.", "figure_data": "δR [ Å]YbCu YbAg YbAuYbCu YbAg YbAuYbCu YbAg YbAu-0.10-44.447 -43.714 -44.3090.262 2.290 54.502-44.186 -41.423 10.193-0.05-44.051 -43.317 -44.1450.247 2.178 52.251-43.805 -41.138 8.106-0.01-43.711 -42.974 -43.9980.235 2.093 50.579-43.476 -40.881 6.5810.00-43.623 -42.885 -43.9590.232 2.073 50.178-43.390 -40.813 6.2190.01-43.533 -42.795 -43.9190.230 2.052 49.785-43.303 -40.742 5.8660.05-43.159 -42.418 -43.7490.219 1.973 48.282-42.940 -40.445 4.5320.10-42.657 -41.914 -43.5130.206 1.879 46.553-42.451 -40.036 3.041"}, {"figure_label": "IX", "figure_type": "table", "figure_id": "tab_18", "figure_caption": "Final recommended values of W s,Yb and W s,X for YbCu, YbAg and YbAu (X = Cu, Ag, Au). The various corrections to the baseline values are shown.", "figure_data": "W s,Yb [h kHz]Ws,X [h kHz]YbCu YbAg YbAuYbCu YbAg YbAuBaseline values-47.920 -46.845 -46.3000.273 2.484 53.278CorrectionsBasis set (v4z vs v3z)-0.281 -0.357 -0.3070.013 0.118 -0.677Active space (all-electron/+6000 E h vs baseline)-0.521 -0.511 -1.9120.004 0.028 3.391Higher excitations (FSCCSDT vs FSCCSD)-0.070 -0.472 -0.5230.022 -0.038 -1.594Vibrational effects0.118 0.096 0.029-0.002 -0.010 -0.077Recommended values-48.674 -48.089 -49.0130.310 2.582 54.321"}], "formulas": [{"formula_id": "formula_0", "formula_text": "X 2 Σ + 1 2", "formula_coordinates": [2.0, 472.62, 63.85, 28.49, 17.2]}, {"formula_id": "formula_1", "formula_text": "sr = K W s,K k s,K + W d d e Ω,(1)", "formula_coordinates": [2.0, 357.6, 575.06, 204.61, 23.65]}, {"formula_id": "formula_2", "formula_text": "Ĥ(0) = i cα i • pi + β i m e c 2 - K eV K (r i ) - 1 2 i̸ =j eV j (r i ) + 1 2 K̸ =L eZ K V L (R K ),(2)", "formula_coordinates": [3.0, 75.96, 218.84, 223.12, 53.79]}, {"formula_id": "formula_3", "formula_text": "V K (r i ) = 1 4πε 0 ρ K (r ′ ) |r i -r ′ | d 3 r ′ V j (r i ) = - 1 4πε 0 e |r i -r j |(3)", "formula_coordinates": [3.0, 109.97, 300.51, 189.11, 58.7]}, {"formula_id": "formula_4", "formula_text": "V L (R K ) = 1 4πε 0 Z L e |R K -R L | .", "formula_coordinates": [3.0, 103.9, 355.82, 132.08, 30.62]}, {"formula_id": "formula_5", "formula_text": "α = ∅ 2×2 σ σ ∅ 2×2 , β = 1 2×2 ∅ 2×2 ∅ 2×2 -1 2×2 .(4)", "formula_coordinates": [3.0, 80.29, 616.56, 218.79, 30.02]}, {"formula_id": "formula_6", "formula_text": "σ x = 0 1 1 0 , σ y = 0 -i i 0 , σ z = 1 0 0 -1 ,(5)", "formula_coordinates": [3.0, 68.37, 709.41, 230.71, 28.76]}, {"formula_id": "formula_7", "formula_text": "ĤeEDM eff-1 = -d e i (β i -1)Σ i • E(r i ),(6)", "formula_coordinates": [3.0, 363.03, 634.7, 199.19, 23.5]}, {"formula_id": "formula_8", "formula_text": "Σ = σ ∅ 2×2 ∅ 2×2 σ ,(7)", "formula_coordinates": [3.0, 398.71, 700.5, 163.51, 28.76]}, {"formula_id": "formula_9", "formula_text": "E(r i ) = -∇ i   K V K (r i ) + V ext (r i ) + j̸ =i V j (r i )   .", "formula_coordinates": [4.0, 63.16, 66.73, 226.64, 41.46]}, {"formula_id": "formula_10", "formula_text": "ĤeEDM eff-1 ≈ -d e K,i (β i -1)Σ i • [-∇ i V K (r i )] ,(9)", "formula_coordinates": [4.0, 83.54, 250.6, 215.54, 23.65]}, {"formula_id": "formula_11", "formula_text": "ĤeEDM eff-1 ≈ -d e K,i Z K e 4πε 0 (β i -1)Σ i • r i -R K |r i -R K | 3 ,(10)", "formula_coordinates": [4.0, 66.64, 326.17, 232.44, 30.87]}, {"formula_id": "formula_12", "formula_text": "ĤeEDM eff-2 = i d e 2c eℏ i β i γ 5 i p2 i ,(11)", "formula_coordinates": [4.0, 118.68, 422.49, 180.4, 27.72]}, {"formula_id": "formula_13", "formula_text": "γ 5 = ∅ 2×2 1 2×2 1 2×2 ∅ 2×2 . (12", "formula_coordinates": [4.0, 133.51, 536.77, 161.14, 30.02]}, {"formula_id": "formula_14", "formula_text": ")", "formula_coordinates": [4.0, 294.65, 544.22, 4.43, 9.97]}, {"formula_id": "formula_15", "formula_text": "Ĥd = Ĥ(0) + λ ĤeEDM , (13", "formula_coordinates": [4.0, 391.64, 135.53, 166.14, 12.49]}, {"formula_id": "formula_16", "formula_text": ")", "formula_coordinates": [4.0, 557.78, 138.05, 4.43, 9.97]}, {"formula_id": "formula_17", "formula_text": "eff-1", "formula_coordinates": [4.0, 385.41, 175.94, 15.89, 6.98]}, {"formula_id": "formula_18", "formula_text": "E d Ω (λ) = E (0) Ω +λ E d(1) Ω λ=0 + λ 2 2 E d(2) Ω λ=0 +O(λ 3 ), (14", "formula_coordinates": [4.0, 322.0, 252.07, 235.78, 24.92]}, {"formula_id": "formula_19", "formula_text": ")", "formula_coordinates": [4.0, 557.78, 260.19, 4.43, 9.97]}, {"formula_id": "formula_20", "formula_text": "E (0) Ω = ⟨0| Ĥ(0)", "formula_coordinates": [4.0, 317.02, 340.32, 66.15, 19.98]}, {"formula_id": "formula_21", "formula_text": "W d = 1 Ω d e dE d Ω dλ λ=0 = 1 Ω d e d dλ 0 d Ĥd 0 d λ=0 ,(15)", "formula_coordinates": [4.0, 323.25, 432.38, 238.96, 36.52]}, {"formula_id": "formula_22", "formula_text": "ĤS-PS-ne = i G F √ 2 i,K (Z K k p s + N K k n s ) β i γ 5 i ϱ K (r i ), (16", "formula_coordinates": [4.0, 324.63, 698.92, 233.15, 27.87]}, {"formula_id": "formula_23", "formula_text": ")", "formula_coordinates": [4.0, 557.78, 705.66, 4.43, 9.97]}, {"formula_id": "formula_24", "formula_text": "N K is the number of neutrons in nucleus K, G F is the Fermi coupling constant (whose most recent value is G F /(ℏ c) 3 = 1.1663787 × 10 -5 GeV -2 , or equiva- lently G F ≃ 2.222516 × 10 -14 E h a 3 0 39", "formula_coordinates": [4.0, 317.02, 736.27, 245.2, 21.43]}, {"formula_id": "formula_25", "formula_text": "K = i G F √ 2 i,K Z K k s,K β i γ 5 i ϱ K (r i ). (17", "formula_coordinates": [5.0, 132.86, 149.88, 161.79, 46.41]}, {"formula_id": "formula_26", "formula_text": ")", "formula_coordinates": [5.0, 294.65, 175.16, 4.43, 9.97]}, {"formula_id": "formula_27", "formula_text": "Ĥs = Ĥ(0) + λ ĤS-PS-ne . (18", "formula_coordinates": [5.0, 122.88, 261.55, 171.77, 12.49]}, {"formula_id": "formula_28", "formula_text": ")", "formula_coordinates": [5.0, 294.65, 264.07, 4.43, 9.97]}, {"formula_id": "formula_29", "formula_text": "W s = 1 Ω K 1 k s,K dE s,K Ω dλ λ=0 . (19", "formula_coordinates": [5.0, 111.92, 311.99, 182.72, 31.54]}, {"formula_id": "formula_30", "formula_text": ")", "formula_coordinates": [5.0, 294.65, 321.36, 4.43, 9.97]}, {"formula_id": "formula_31", "formula_text": "W d ≈ 1 Ω d e E d Ω (λ) -E d Ω (-λ) 2λ ,(20)", "formula_coordinates": [5.0, 368.99, 85.86, 193.22, 25.67]}, {"formula_id": "formula_32", "formula_text": "W s ≈ 1 Ω K 1 k s,K E s,K Ω (λ) -E s,K Ω (-λ) 2λ .(21)", "formula_coordinates": [5.0, 338.8, 140.37, 223.42, 30.5]}, {"formula_id": "formula_33", "formula_text": "Ĥ(0) ± λ k s,K √ 2 G F Z K ĤS-PS-ne K ,(22)", "formula_coordinates": [5.0, 375.87, 320.35, 186.34, 32.79]}, {"formula_id": "formula_34", "formula_text": "G F Z K /( √ 2 a 3 0 ) = Z K 0.", "formula_coordinates": [5.0, 317.02, 356.79, 245.19, 30.67]}, {"formula_id": "formula_35", "formula_text": "ρ P N K (r) = Z K e δ(r -R K ) ρ GN K (r) = Z K e ζ K π 3/2 e -ζ K |r-R K | 2 , (23", "formula_coordinates": [6.0, 352.04, 411.56, 205.74, 42.38]}, {"formula_id": "formula_36", "formula_text": ")", "formula_coordinates": [6.0, 557.78, 437.13, 4.43, 9.97]}, {"formula_id": "formula_37", "formula_text": "A 1/3 K + 0.570) fm", "formula_coordinates": [6.0, 317.02, 506.43, 245.2, 28.71]}, {"formula_id": "formula_38", "formula_text": "W d .", "formula_coordinates": [8.0, 53.88, 573.94, 17.08, 10.72]}, {"formula_id": "formula_39", "formula_text": "YbCu W d YbCu W s YbAg W d YbAg W s YbAu W d YbAu W s", "formula_coordinates": [12.0, 107.49, 189.55, 137.98, 256.73]}], "doi": "10.5281/zenodo.3572669"}
