{"title": "Debiased) Contrastive Learning Loss for Recommendation (Technical Report", "authors": "Ruoming Jin; Dong Li", "pub_date": "", "abstract": "In this paper 1 , we perform a systemic examination of the recommendation losses, including listwise (softmax), pairwise(BPR), and pointwise (mean-squared error, MSE, and Cosine Contrastive Loss, CCL) losses through the lens of contrastive learning. We introduce and study both debiased InfoNCE and mutual information neural estimator (MINE), for the first time, under the recommendation setting. We also relate and differentiate these two losses with the BPR loss through the lower bound analysis. Furthermore, we present the debiased pointwise loss (for both MSE and CCL) and theoretically certify both iALS and EASE, two of the most popular linear models, are inherently debiased. The empirical experimental results demonstrate the effectiveness of the debiased losses and newly introduced mutual-information losses outperform the existing (biased) ones.", "sections": [{"heading": "INTRODUCTION", "text": "Machine learning, including recommender systems [1,27], has played a pivotal role in transforming the way humans interact with and explore information on the internet [57], which has been ongoing for several years and continues to evolve with the integration of AI-generated content [32], significantly impacting the lives of individuals [59]. As recommendation algorithms continue to boom [1,61], largely thanks to deep learning models, many models' real effectiveness and claimed superiority has been called into question, such as various deep learning models vs. simple linear and heuristic methods [13], and the potential \"inconsistent\" issue of using itemsampling based evaluation [24,26,[28][29][30], among others. A major problem in existing recommendation research is their \"hyper-focus\" on evaluation metrics with often weak or not-fully-tuned baselines to demonstrate the progress of their newly proposed model [13]. However, recent research has shown that properly evaluating (simple) baselines is indeed not an easy task [47].\nTo deal with the aforementioned challenges, aside from standardized benchmarks and evaluation criteria, research communities have devoted efforts to developing and optimizing simple and stronger baseline models, such as the latest effort on finetuning iALS [45,46] and SimpleX (CCL) [37]. In the meantime, researchers [23] have started to theoretically analyze and compare different models, such as matrix factorization (iALS) vs. low-rank regression (EASE). By simplifying and unifying different models under a similar closed form, they observe how different approaches \"shrink\" singular values differently and thus provide a deep understanding and explain how and why the models behave differently, and the exact factor leads to a performance gap. However, the above work is limited only to linear models, and their regularization landscapes [31].\nTaking the cue from the aforementioned research, this paper aims to rigorously analyze and compare the loss functions, which play a key role in designing recommendation models [37]. This paper is also particularly driven by the emergence of contrastive learning loss [7,9,40] has shown great success in various learning tasks, such as computer vision and NLP, etc. Even though there are a few research works [55,63] in adopting contrastive learning paradigms into individual recommendation models, a systematic understanding of the recommendation loss function from the lens of contrastive learning is still lacking. For instance, how recommendation models can take advantage of (debiased) contrastive loss [9] (including mutual information-based losses [3]? How pairwise BPR [43] (Bayesian Pairwise Ranking) loss relate to these recent contrastive losses [3,9,40]? How can we debias the 𝐿2 (mean-squared-error, MSE) or 𝐿1 (mean-absolute-error, MAE) loss function with respect to the contrastive learning loss? Following this, does the well-known linear models, such as iALS [20,45,46] and EASE [51], needs to be debiased with respect to contrastive learning losses?\nTo answer these questions, we made the following contribution to this paper:\n• (Section 2) We revisit the softmax loss (and BPR loss) using the latest debiased contrastive loss [9], which provides a natural debias approach instead of typically rather sophisticated debias methods through propensity score [64]. We also introduce a mutual information neural estimator (MINE) loss [3] to the recommendation setting. To the best of our knowledge, this is the first study to study MINE for recommendation models. Experimental results demonstrate its (surprising) performance compared with other known losses. Finally, through the lower bound analysis, we are able to relate the contrastive learning losses and BPR loss. • (Section 3) We generalize the debiased contrastive loss [9] to the pointwise loss (MSE [20] and CCL [37]) in recommendation models and design the new debiased pointwise loss. We then examine the well-known linear models with pointwise loss, including iALS and EASE; rather surprisingly, our theoretical analysis reveals that both are inherently debiased under the reasonable assumption with respect to the contrastive learning losses. • (Section 4) We experimentally validate the debiased InfoNCE and point-wise losses indeed perform better than the biased (commonly used) alternatives. We also show the surprising performance of the newly introduced mutual informationbased recommendation loss and its refinement (MINE and MINE+). Finally, Section 5 reviews the related work, and Section 6 concludes. This paper towards to build a loss function theory for a recommendation based on contrastive learning.", "publication_ref": ["b0", "b26", "b56", "b31", "b58", "b0", "b60", "b12", "b23", "b25", "b27", "b28", "b29", "b12", "b46", "b44", "b45", "b36", "b22", "b30", "b36", "b6", "b8", "b39", "b54", "b62", "b8", "b2", "b42", "b2", "b8", "b39", "b19", "b44", "b45", "b50", "b8", "b63", "b2", "b8", "b19", "b36"], "figure_ref": [], "table_ref": []}, {"heading": "CONTRASTIVE RECOMMENDATION LOSS", "text": "In this section, we introduce Debiased InfoNCE [40] and Mutual-Information based Loss (MINE) [3] to the recommendation settings. Note that, the study in this section, is not to claim those losses are new (they stem from the latest contrastive learning research [2,9]), but to bring them into the recommendation community. Indeed, to our surprise, those losses from contrastive learning have not been fully explored and leveraged by the recommendation models. To reemphasize, our goals are two folds in this section: 1) demonstrating the benefits of these contrastive learning inspired losses are useful for recommendation models; 2) utilizing the lens of contrastive learning to carefully reexamine the losses recommendation community have designed before towards better understanding and unifying them. Notation: We use U and I to denote the user and item sets, respectively. For an individual user 𝑢 ∈ U, we use I + 𝑢 to denote the set of items that have been interacted (such as Clicked/Viewed or Purchased) by the user 𝑢, and I\\ I + 𝑢 to represent the remaining set of items that have not been interacted by user 𝑢. Similarly, U + 𝑖 consists of users interacting with item 𝑖, and U \\ U + 𝑖 includes remaining users. Often, we denoted 𝑟 𝑢𝑖 = 1 if item 𝑢 is known to interact with of item 𝑖 and 𝑟 𝑢𝑖 = 0 if such interaction is unknown.\nGiven this, most of the recommendation systems utilize either matrix factorization (shallow encoder) or deep neural architecture to produce a latent user vector 𝑣 𝑢 and a latent item vector 𝑣 𝑖 , then use their inner product (< 𝑣 𝑢 , 𝑣 𝑖 >) or cosine (< 𝑣 𝑢 /||𝑣 𝑢 ||, 𝑣 𝑖 /||𝑣 𝑖 || >) to produce a similarity measure ŷ𝑢𝑖 . The loss function is then used to produce a (differentiable) measure to quantify and encapsulate all such ŷ𝑢𝑖 .", "publication_ref": ["b39", "b2", "b1", "b8"], "figure_ref": [], "table_ref": []}, {"heading": "Basic (Sampled) Softmax and InfoNCE loss", "text": "Softmax Loss: In recommendation models, a softmax function is often utilized to transform the similarity measure into a probability measure [11,63]:\n𝑝 (𝑖 |𝑢) = exp( ŷ𝑢𝑖 )\n𝑗 ∈I exp( ŷ𝑢 𝑗 ) . Given this, the maximal likelihood estimation (MLE) can be utilized to model the fit of the data through the likelihood (Π 𝑢 ∈ U,𝑖 ∈ I + 𝑢 𝑝 (𝑖 |𝑢)), and the negative log-likelihood serves as the loss function:\nL 𝑠𝑜 𝑓 𝑡 = -E 𝑢 log ∑︁ 𝑖 ∈ I + 𝑢 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) 𝑗 ∈ I 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 )(1)\nNote that in the earlier research, the sigmoid function has also adopted for transforming similarity measure to probability: 𝑝 (𝑖 |𝑢) = 𝜎 ( ŷ𝑢𝑖 ). However, it has shown to be less effective [44]. Furthermore, the loss function is a binary cross-entropy where the negative sample part is eliminated as being treated as 0. Finally, the main challenge here is that the denominator in the loss sums over all possible items in I, which is often impossible in practice and thus requires approximation. In the past, the sampled softmax approaches typically utilized the important sampling for estimation [22]:\nL 𝑠𝑠𝑜 𝑓 𝑡 = -E 𝑢 log ∑︁ 𝑖 ∈ I + 𝑢 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) + 𝑁 𝑗=1;𝑗∼𝑝 - 𝑢 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 )/𝑝 - 𝑢 ( 𝑗)(2)\nwhere, 𝑝 - 𝑢 is a predefined negative sampling distribution and often is implemented as 𝑝, which is proportional to the item popularity. It has been shown that sampled softmax performs better than NCE [15] and negative sampling ones [8,43] when the item number is large [63].", "publication_ref": ["b10", "b62", "b43", "b21", "b14", "b7", "b42", "b62"], "figure_ref": [], "table_ref": []}, {"heading": "Contrastive Learning Loss (InfoNCE):", "text": "The key idea of contrastive learning is to contrast semantically similar (positive) and dissimilar (negative) pairs of data points, thus pulling the similar points closer and pushing the dissimilar points apart. There are several contrastive learning losses have been proposed [2,7,40], and among them, InfoNCE loss is one of the most well-known and has been adopted in the recommendation as follows:\nL 𝑖𝑛𝑓 𝑜 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 log 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) + 𝑁 𝑗=1;𝑗∼𝑝 - 𝑢 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 )(3)\nwhere 𝑝 + 𝑢 (𝑝 - 𝑢 ) is the positive (negative) item distribution for user 𝑢. Note that unlike the sampled softmax, the correction from the sampling distribution is not present in the InfoNCE loss. In fact, this loss does not actually approximate the softmax probability measure 𝑝 (𝑖 |𝑢) while it corresponds to the probability that item 𝑖 is the positive item, and the remaining points are noise, and 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) measures the density ration (𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) ∝ 𝑝 (𝑖 |𝑢)/𝑝 (𝑖)) [40]. Again, the overall InfoNCE loss is the cross-entropy of identifying the positive items correctly, and it also shows maximize the mutual information between user 𝑢 and item 𝑖 (𝐼 (𝑖, 𝑢)) and minimize 𝐼 ( 𝑗, 𝑢) for item 𝑗 and 𝑢 being unrelated [40].\nIn practice, as the true negative labels (so does all true positive labels) are not available, negative items 𝑗 are typically drawn uniformly (or proportional to their popularity) from the entire item set I or I\\ I + 𝑢 , i.e, 𝑗 ∼ 𝑝 𝑢 :\nL 𝑖𝑛𝑓 𝑜 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 log 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) + 𝑁 𝑗=1;𝑗∼𝑝 𝑢 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 )(4)\nNote that this loss L 𝑖𝑛𝑓 𝑜 in practice is sometimes treated as a softmax estimation, despite is not a proper estimator for the softmax loss [11,40]. In addition, the L 𝑖𝑛𝑓 𝑜 approximation easily leads to sampling bias: when sampling a large number of supposed negative items, they would include some positive items i.e., those top 𝐾 items in recommendation setting. It has been known such sampling bias can empirically lead to a significant performance drop for machine learning tasks [6,8].", "publication_ref": ["b1", "b6", "b39", "b39", "b39", "b10", "b39", "b5", "b7"], "figure_ref": [], "table_ref": []}, {"heading": "Leveraging Debiased Contrastive InfoNCE", "text": "Can we reduce the gap between the approximation L 𝑖𝑛𝑓 𝑜 and ideal InfoNCE loss L 𝑖𝑛𝑓 𝑜 and mitigate sampling bias? In [9], a novel debiased estimator is proposed while only accessing positive items and unlabeled training data. Below, we demonstrate how this approach can be adopted in the recommendation setting.\nGiven user 𝑢, let us consider the implicit (binary) preference probability (class distribution) of 𝑢: 𝜌 𝑢 (𝑐), where 𝜌 𝑢 (𝑐 = +) = 𝜏 + 𝑢 represents the probability of user 𝑢 likes an item, and 𝜌 𝑢 (𝑐 = -) = 𝜏 - 𝑢 = 1-𝜏 + 𝑢 corresponds to being not interested. In the recommendation setting, we may consider 𝜌 𝑢 (+) as the fraction of positive items, i.e., those top 𝐾 items, and 𝜌 𝑢 (-) are the fraction of true negative items. Let the item class joint distribution be 𝑝 𝑢 (𝑖, 𝑐) = 𝑝 𝑢 (𝑖 |𝑐)𝜌 𝑢 (𝑐). Then 𝑝 + 𝑢 (𝑖) = 𝑝 𝑢 (𝑖 |𝑐 = +) is the probability of observing 𝑖 as a positive item for user 𝑢 and 𝑝 - 𝑢 ( 𝑗) = 𝑝 𝑢 ( 𝑗 |𝑐 = -) the probability of a negative example. Given this, the distribution of an individual item of user 𝑢 is:\n𝑝 𝑢 (𝑖) = 𝜏 + 𝑢 • 𝑝 + 𝑢 (𝑖) + 𝜏 - 𝑢 • 𝑝 - 𝑢 (𝑖)(5)\nFor implicit recommendation, we can assume the known positive items I + 𝑢 are being uniformly sampled according to 𝑝 + 𝑢 . For 𝜏 + 𝑢 , we can count all the existing positive items (𝑟 𝑢𝑖 = 1), and the unknown top 𝐾 items as being positive, thus, 𝜏 + 𝑢 = (| I + 𝑢 | + 𝐾)/|I|. Alternatively, we can assume the number of total positive items for 𝑢 is proportional to the number of existing (known) positive items, i.e, 𝜏 + 𝑢 = (1 + 𝛼)| I + 𝑢 |/|I|, where 𝛼 ≥ 0. As mentioned earlier, the typical assumption of 𝑝 𝑢 (the probability distribution of selection an item is also uniform). Then, we can represent 𝑝 - 𝑢 using the total and positive sampling as: 𝑝 - 𝑢 (𝑖) = 1/𝜏 - 𝑢 (𝑝 𝑢 (𝑖) -𝜏 + 𝑢 • 𝑝 + 𝑢 (𝑖)). Given this, let us consider the following ideal (debiased) InfoNCE loss:\nL 𝐼𝑛𝑓 𝑜 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 log exp( ŷ𝑢𝑖 ) exp( ŷ𝑢𝑖 ) + 𝜆 E 𝑗 ∼𝑝 - 𝑢 exp( ŷ𝑢 𝑗 ) = -E 𝑢 E 𝑖∼𝑝 + 𝑢 log exp( ŷ𝑢𝑖 ) exp( ŷ𝑢𝑖 ) + 𝜆 1 𝜏 -E 𝑡 ∼𝑝𝑢 [exp( ŷ𝑢𝑡 ) ] -𝜏 + E 𝑗 ∼𝑝 + 𝑢 [exp( ŷ𝑢 𝑗 ) ](6)\nNote that when 𝜆 = 𝑁 , the typical InfoNCE loss L 𝐼𝑛𝑓 𝑜 (Eq. ( 3)) converges into L 𝐼𝑛𝑓 𝑜 when 𝑁 → ∞. Now, we can use 𝑁 samples from 𝑝 𝑢 (not negative samples), an 𝑀 positive samples from 𝑝 + 𝑢 to empirically estimate L 𝐼𝑛𝑓 𝑜 following [9]:\nL 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝐼𝑛𝑓 𝑜 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 ;𝑗 ∼𝑝𝑢 ;𝑘∼𝑝 + 𝑢 log exp( ŷ𝑢𝑖 ) exp( ŷ𝑢𝑖 ) + 𝜆𝑓 ( { 𝑗 } 𝑁 1 , {𝑘 } 𝑀 1 )\n, 𝑤ℎ𝑒𝑟𝑒\n𝑓 ( { 𝑗 } 𝑁 1 , {𝑘 } 𝑀 1 ) = max 1 𝜏 - 𝑢 1 𝑁 𝑁 ∑︁ 𝑗 =1;𝑗 ∼𝑝𝑢 𝑒𝑥𝑝 (𝑓 𝑢 𝑗 ) -𝜏 + 𝑢 1 𝑀 𝑀 ∑︁ 𝑘=1;𝑘∼𝑝 + 𝑢 𝑒𝑥𝑝 (𝑓 𝑢𝑘 ) , 𝑒 1/𝑡 (7)\nHere 𝑓 is constrained to be greater than its theoretical minimum 𝑒 -1/𝑡 to prevent the negative number inside log. We will experimentally study this debiased InfoNCE in Section 4.", "publication_ref": ["b8", "b8"], "figure_ref": [], "table_ref": []}, {"heading": "Connection with MINE and BPR", "text": "In the following, we first introduce Mutual Information Neural Estimator (MINE) loss and then discuss some common lower bounds for InfoNCE and MINE, BPR as well as their relationship. Later in the Section 4, we evaluate MINE against existing losses for recommendation and show it performs surprisingly well. To the best of our knowledge, this work is the first to study and apply MINE [3] to the recommendation setting.\nThe Mutual Information Neural Estimator (MINE) loss is introduced in [3], which can directly measure the mutual information between user and item:\n𝐼 (𝑢, 𝑖) = 𝑠𝑢𝑝 (𝑣 𝑢 ;𝑣 𝑖 ) E 𝑝 𝑢,𝑖 [ ŷ𝑢𝑖 ] -log E 𝑝 𝑢 ⊗𝑝 𝑖 [𝑒 ŷ𝑢𝑖 ](8)\nHere, the positive ŷ𝑢𝑖 items sampled 𝑛 times according to the joint user-item distribution 𝑝 𝑢,𝑖 . The negative items are sampled according to the empirical marginal item distribution of 𝑝 𝑖 , which are proportional to their popularity (or in practice, sampled uniformly).\nA simple adaption of MINE to the recommendation setting can simply exclude the positive item 𝑖 from the denominator of In-foNCE [40]:\nL 𝑚𝑖𝑛𝑒 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 ŷ𝑢𝑖 -log E 𝑗∼𝑝 𝑖 [exp ŷ𝑢 𝑗 ](9)\nIts empirical loss can be written as (the factor of 1/𝑁 will not affect the optimization):\nL 𝑚𝑖𝑛𝑒 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 ŷ𝑢𝑖 -log 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 [exp ŷ𝑢 𝑗 ](10)\nLower Bounds: Given this, we can easily observe (based on Jensen's inequality):\nL 𝑖𝑛𝑓 𝑜 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 log 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) + 𝑁 𝑗=1;𝑗∼𝑝 𝑢 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 ) ≥ L 𝑚𝑖𝑛𝑒 = E 𝑢 E 𝑖∼𝑝 + 𝑢 log( 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≈ E 𝑢 E 𝑖∼𝑝 + 𝑢 log 𝑁 E 𝑗∼𝑝 𝑖 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖 + log 𝑁 ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖(11)\nAlternative, by using LogSumExp lower-bound [2], we also observe:\nE 𝑢 E 𝑖∼𝑝 + 𝑢 𝑁 max 𝑗=1;𝑗∼𝑝 𝑖 0, ŷ𝑢 𝑗 -ŷ𝑢𝑖 + log(𝑁 + 1) ≥ L 𝑖𝑛𝑓 𝑜 ≥ L 𝑚𝑖𝑛𝑒 = E 𝑢 E 𝑖∼𝑝 + 𝑢 log( 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 𝑁 max 𝑗=1;𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖(12)\nNote that the second lower bound is tighter than the first one. We also observe the looser bound is also shared by the well-known pairwise BPR loss, which can be written as:\nL 𝑏𝑝𝑟 = E 𝑢 E 𝑖∼𝑝 + 𝑢 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 -log 𝜎 ( ŷ𝑢𝑖 -ŷ𝑢 𝑗 ) = E 𝑢 E 𝑖∼𝑝 + 𝑢 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 log(1 + 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 ))(13)\nFollowing above analysis, we observe:\nL 𝑖𝑛𝑓 𝑜 = E 𝑢 E 𝑖∼𝑝 + 𝑢 log(1 + 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≈ E 𝑢 E 𝑖∼𝑝 + 𝑢 log(1 + 𝑁 E 𝑗∼𝑝 𝑖 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 log(1 + 𝑁 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 log(1/𝑁 + 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) + log 𝑁 ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖 ) + log 𝑁 ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖 )(14)\nThus, the BPR loss shares the same lower bound 𝐸 𝑢 𝐸 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖 ) as the InfoNCE and MINE, which aims to maximize the average difference between a positive item score ( ŷ𝑢𝑖 ) and a negative item score ( ŷ𝑢 𝑗 ).\nHowever, the tighter lower bound of BPR diverges from the InfoNCE and MINE loss using the LogSumExp lower bound:\nL 𝑏𝑝𝑟 = E 𝑢 E 𝑖∼𝑝 + 𝑢 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 log(1 + 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 𝑚𝑎𝑥 (0, ŷ𝑢 𝑗 -ŷ𝑢𝑖 ) ∝ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 𝑚𝑎𝑥 (0, ŷ𝑢 𝑗 -ŷ𝑢𝑖 ) (15)\nNote that the bound in Eq. ( 15) only sightly improves over the one in Eq. ( 14) and cannot reflect the bounds shared by InfoNCE and MINE, which aims to minimize the largest gain of a negative item (random) over a positive item (max 𝑁 𝑗=1;𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖 ). We also experimentally validate using the first bound E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖 leads to poor performance, indicating this can be a potentially underlying factor the relatively inferior performance of BRP comparing with other losses, such as softmax, InfoNCE, and MINE (Section 4). MINE+ loss for Recommendation: Utimately, we consider the following refined MINE loss format for recommendation which as we will show in Section 4, can provide an additional boost comparing with the Vanilla formula (Eq. ( 10)):\nL 𝑚𝑖𝑛𝑒+ = -E 𝑢 E 𝑖∼𝑝 + 𝑢 ŷ𝑢𝑖 /𝑡 -𝜆 log 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 [exp( ŷ𝑢 𝑗 /𝑡](16)\nHere, ŷ𝑢𝑖 uses the cosine similarity between user and item latent vectors, 𝑡 serves as the temperature (similar to other contrastive learning loss), and finally, 𝜆 helps balance the weight between positive scores and negative scores.", "publication_ref": ["b2", "b2", "b39", "b1"], "figure_ref": [], "table_ref": []}, {"heading": "DEBIASED POINTWISE LOSS", "text": "Besides the typical listwise (softmax, InfoNCE) and pairwise (BPR) losses, another type of recommendation loss is the pointwise loss. Most of the linear (non-deep) models are based on pointwise losses, including the well-known iALS [20,46], EASE [51], and latest CCL [37]. Here, these loss functions aim to pull the estimated score ŷ𝑢𝑖 closer to its default score 𝑟 𝑢𝑖 . In all the existing losses, when the interaction is known, 𝑖 ∈ I + 𝑢 , 𝑟 𝑢𝑖 = 1; otherwise, the unlabeled (interaction unknown) items are treated as 𝑟 𝑢𝑖 = 0.\nFollowing the analysis of debiased contrastive learning, clearly, some of the positive items are unlabeled, and making them closer to 0 is not the ideal option. In fact, if the optimization indeed reaches the targeted score, we actually do not learn any useful recommendations. A natural question is whether we can improve the pointwise losses following the debiased contrastive learning paradigm [9]. In addition, we will investigate if the popular linear methods, such as iALS and EASE, are debiased or not.", "publication_ref": ["b19", "b45", "b50", "b36", "b8"], "figure_ref": [], "table_ref": []}, {"heading": "Debiased MSE and CCL", "text": "Let us denote the generic single pointwise loss function 𝑙 + ( ŷ𝑢𝑖 ) and 𝑙 -( ŷ𝑢𝑖 ), which measure how close the individual positive (negative) item score to their ideal target value. MSE single pointwise loss: Mean-Squared-Error (MSE) is one of the most widely used recommendation loss functions. Indeed, all the earlier collaborative filtering (Matrix factorization) models and pointwise losses were based on MSE (with different regularization). Some recent linear models, such as SLIM [39] and EASE [51], are also based on MSE. Its single pointwise loss function is denoted as:\n𝑙 + 𝑚𝑠𝑒 ( ŷ𝑢𝑖 ) = (1 -ŷ𝑢𝑖 ) 2 𝑙 - 𝑚𝑠𝑒 ( ŷ𝑢𝑖 ) = ( ŷ𝑢𝑖 ) 2(17)\nCCL single pointwise loss: The cosine contrastive loss (CCL) is recently proposed loss and has shown to be very effective for recommendation []. The original Contrastive Cosine Loss (CCL) [37] can be written as:\nL 𝐶𝐶𝐿 = E 𝑢 ∑︁ 𝑖 ∈ I + 𝑢 (1 -ŷ𝑢𝑖 ) + 𝑤 𝑁 𝑁 ∑︁ 𝑗 ∈ I 𝑅𝑒𝐿𝑈 ( ŷ𝑢 𝑗 -𝜖)(18)\nwhere ŷ𝑢 𝑗 is cosine similarity, 𝑅𝑒𝐿𝑈 (𝑥) = 𝑚𝑎𝑥 (0, 𝑥) is the activation function, 𝑤 is the negative weight, 𝑁 is the number of negative samples and 𝜖 is margin. Its single pointwise loss thus can be written as:\n𝑙 + 𝑐𝑐𝑙 ( ŷ𝑢𝑖 ) = 1 -ŷ𝑢𝑖 𝑙 - 𝑐𝑐𝑙 ( ŷ𝑢𝑖 ) = 𝑅𝑒𝐿𝑈 ( ŷ𝑢𝑖 -𝜖)(19)\nGiven this, we introduce the ideal pointwise loss for recommendation models (following the basic idea of (debiased) contrastive learning) : Definition 1. (Ideal Pointwise Loss) The ideal pointwise loss function for recommendation models is the expected single pointwise loss for all positive items (sampled from 𝜌 𝑢 (+) = 𝜏 + ) and for negative items (sampled from 𝜌 𝑢 (-) = 𝜏 -):\nL 𝑝𝑜𝑖𝑛𝑡 = E 𝑢 𝜏 + 𝑢 E 𝑖∼𝑝 + 𝑢 𝑙 + ( ŷ𝑢𝑖 ) + 𝜆𝜏 - 𝑢 E 𝑗 ∼𝑝 - 𝑢 𝑙 -( ŷ𝑢 𝑗 )(20)\nWhy this is ideal? When the optimization reaches the potential minimal, we have for all positive items 𝑖 and all the negative items 𝑗 reaching all the minimum of individual loss (𝑙 + and 𝑙 -). Here, 𝜆 help adjusts the balance between the positive and negative losses, similar to iALS [20,46] and CCL [37]. However, since 𝑝 + 𝑢 and 𝑝 - 𝑢 is unknown, we utilize the same debiasing approach as InfoNCE [40], also in Section 2.2, for the debiased MSE: Definition 2. (Debiased Ideal pointwise loss)\nL 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑝𝑜𝑖𝑛𝑡 = E 𝑢 𝜏 + 𝑢 E 𝑖∼𝑝 + 𝑢 𝑙 + ( ŷ𝑢𝑖 ) + 𝜏 - 𝑢 𝜆 • E 𝑗∼𝑝 - 𝑢 𝑙 -( ŷ𝑢𝑖 ) = E 𝑢 𝜏 + 𝑢 E 𝑖∼𝑝 + 𝑢 𝑙 + ( ŷ𝑢𝑖 ) + 𝜆 E 𝑗∼𝑝 𝑢 𝑙 -( ŷ𝑢𝑖 ) -𝜏 + 𝑢 E 𝑘∼𝑘 + 𝑢 𝑙 -( ŷ𝑢 𝑗 )(21)\nIn practice, assuming for each positive item, we sample 𝑁 positive items and 𝑀 negative items, then the empirical loss can be written as:\nL 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑝𝑜𝑖𝑛𝑡 = E 𝑢 𝐸 𝑖∼𝑝 + 𝑢 𝜏 + 𝑢 𝑙 + ( ŷ𝑢𝑖 )+ 𝜆 1 𝑁 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑢 𝑙 -( ŷ𝑢 𝑗 ) -𝜏 + 𝑢 1 𝑀 𝑀 ∑︁ 𝑘=1;𝑘∼𝑝 + 𝑢 𝑙 -( ŷ𝑢𝑘 )(22)\nAs an example, we have the ideal L 𝐶𝐶𝐿 , debiased L 𝑑𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝐶𝐶𝐿 , empirical debiased CCL L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑐𝑐𝑙 losses as follows:\n                                     L 𝐶𝐶𝐿 = E 𝑢 𝜏 + 𝑢 E 𝑖∼𝑝 + 𝑢 (1 -ŷ𝑢𝑖 ) + 𝜆𝜏 - 𝑢 E 𝑗∼𝑝 - 𝑢 [𝑅𝑒𝐿𝑈 ( ŷ𝑢 𝑗 -𝜖)] L 𝑑𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝐶𝐶𝐿 = E 𝑢 𝜏 + 𝑢 E 𝑖∼𝑝 + 𝑢 (1 -ŷ𝑢𝑖 ) +𝜆 E 𝑗∼𝑝 𝑢 [𝑅𝑒𝐿𝑈 ( ŷ𝑢 𝑗 -𝜖)] -𝜏 + 𝑢 E 𝑘∼𝑝 + 𝑢 [𝑅𝑒𝐿𝑈 ( ŷ𝑢𝑘 -𝜖)] L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑐𝑐𝑙 = E 𝑢 𝐸 𝑖∼𝑝 + 𝑢 𝜏 + 𝑢 (1 -ŷ𝑢𝑖 )+ 𝜆 1 𝑁 𝑁 𝑗=1;𝑗∼𝑝 𝑢 𝑅𝑒𝐿𝑈 ( f 𝑢 𝑗 -𝜖) -𝜏 + 𝑢 1 𝑀 𝑀 𝑘=1;𝑘∼𝑝 + 𝑢 𝑅𝑒𝐿𝑈 ( f 𝑢 𝑗 -𝜖)\nWe will study how (empirical) debiased MSE and CCL in the experimental result section.", "publication_ref": ["b38", "b50", "b36", "b19", "b45", "b36", "b39"], "figure_ref": [], "table_ref": []}, {"heading": "iALS, EASE and their Debiasness", "text": "Here, we investigate how the debiased MSE loss will impact the solution of two (arguably) most popular linear recommendation models, iALS [20,46] and EASE [51]. Rather surprisingly, we found the solvers of both models can absorb the debiased loss under their existing framework with reasonable conditions (details below). In other words, both iALS and EASE can be considered to be inherently debiased.\nTo obtain the aforementioned insights, we first transform the debiased loss into the summation form being used in iALS and EASE.\nL 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑚𝑠𝑒 ≈ E 𝑢 𝜏 + 𝑢 | I + 𝑢 | ∑︁ 𝑖 ∈I + 𝑢 ( ŷ𝑢𝑖 -1) 2 + 𝜆 1 | I | ∑︁ 𝑡 ∈I ŷ2 𝑢𝑡 - 𝜏 + 𝑢 | I + 𝑢 | ∑︁ 𝑞 ∈I + 𝑢 ŷ2 𝑢𝑞 = ∑︁ 𝑢 1 | I | 𝑐 𝑢 ∑︁ 𝑖 ∈I + 𝑢 ( ŷ𝑢𝑖 -1) 2 where, 𝑐 𝑢 = | I | | I + 𝑢 | 𝜏 + 𝑢 + 𝜆 1 | I | ∑︁ 𝑡 ∈I ŷ2 𝑢𝑡 - 1 | I | 𝑐 𝑢 ∑︁ 𝑞 ∈I + 𝑢 ŷ2 𝑢𝑞 ∝ ∑︁ 𝑢 𝑐 𝑢 ∑︁ 𝑖 ∈I + 𝑢 ( ŷ𝑢𝑖 -1) 2 + 𝜆 ∑︁ 𝑡 ∈I ŷ2 𝑢𝑡 -𝑐 𝑢 ∑︁ 𝑞 ∈I + 𝑢 ŷ2 𝑢𝑞 = ∑︁ 𝑢 ∑︁ 𝑖 ∈I + 𝑢 [𝑐 𝑢 ( ŷ𝑢𝑖 -1) 2 -𝑐 𝑢 𝜆 ŷ2 𝑢𝑞 ] + 𝜆 ∑︁ 𝑡 ∈I ŷ2 𝑢𝑡\nDebiased iALS: Following the original iALS paper [21], and the latest revised iALS [45,46], the objective of iALS is given by [46]:\nL 𝑖𝐴𝐿𝑆 = ∑︁ (𝑢,𝑖 ) ∈𝑆 ( ŷ (𝑢, 𝑖) -1) 2 + 𝛼 0 ∑︁ 𝑢 ∈𝑈 ∑︁ 𝑖 ∈𝐼 ŷ (𝑢, 𝑖) 2 + 𝜆 ∑︁ 𝑢 ∈𝑈 (|I + 𝑢 | + 𝛼 0 |I|) 𝜈 ||w 𝑢 || 2 + ∑︁ 𝑖 ∈𝐼 (|𝑈 + 𝑖 | + 𝛼 0 |U|) 𝜈 ||h 𝑖 || 2(23)\nwhere 𝜆 is global regularization weight (hyperparameter) and 𝛼 0 is unobserved weight (hyperparameter). 𝜇 is generally set to be 1. Also, w 𝑢 and h 𝑖 are user and item vectors for user 𝑢 and item 𝑖, respectively. Now, we consider applying the debiased MSE loss to replace the original MSE loss (the first line in L 𝑖𝐴𝐿𝑆 ) with the second line unchanged:\nL 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑖𝐴𝐿𝑆 = ∑︁ 𝑢 ∈𝑈 ∑︁ 𝑖 ∈I + 𝑢 [𝑐 𝑢 ( ŷ𝑢𝑖 -1) 2 -𝑐 𝑢 • 𝛼 0 • ŷ2 𝑢𝑖 ] + 𝛼 0 ∑︁ 𝑡 ∈𝐼 ŷ2 𝑢𝑡 + 𝜆 ∑︁ 𝑢 ∈𝑈 ( | I + 𝑢 | + 𝛼 0 | I | ) 𝜈 | |w 𝑢 | | 2 + ∑︁ 𝑖 ∈𝐼 ( | U + 𝑖 | + 𝛼 0 | U | ) 𝜈 | |h 𝑖 | | 2\nThen we have the following conclusion:\nTheorem 1. For any debiased iALS loss L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑖𝐴𝐿𝑆 with parameters 𝛼 0 and 𝜆 with constant 𝑐 𝑢 for all users, there are original iALS loss with parameters 𝛼 ′ 0 and 𝜆 ′ , which have the same closed form solutions (up to a constant factor) for fixing item vectors and user vectors, respectively. (proof in Appendix B) Debiased EASE: EASE [51] has shown to be a simple yet effective recommendation model and evaluation bases (for a small number of items), and it aims to minimize:\nL 𝑒𝑎𝑠𝑒 = ||𝑋 -𝑋𝑊 || 2 𝐹 + 𝜆||𝑊 || 2 𝐹 𝑠.𝑡 . 𝑑𝑖𝑎𝑔(𝑊 ) = 0\nIt has a closed-form solution [51]:\n𝑃 = (𝑋 𝑇 𝑋 + 𝜆𝐼 ) -1 𝑊 * = 𝐼 -𝑃 • 𝑑𝑀𝑎𝑡 (𝑑𝑖𝑎𝑔(1 ⊘ 𝑃))(24)\nwhere ⊘ denotes the elementwise division, and 𝑑𝑖𝑎𝑔 vectorize the diagonal and 𝑑𝑀𝑎𝑡 transforms a vector to a diagonal matrix.\nTo apply the debiased MSE loss into the EASE objective, let us first further transform L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑚𝑠𝑒 into parts of known positive items and parts of unknown items:\nL 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑚𝑠𝑒 = ∑︁ 𝑢 ∑︁ 𝑖 ∈ I + 𝑢 [𝑐 𝑢 ( ŷ𝑢𝑖 -1) 2 -𝑐 𝑢 𝜆 ŷ2 𝑢𝑞 ] + 𝜆 ∑︁ 𝑡 ∈ I ŷ2 𝑢𝑡 = ∑︁ 𝑢 ∑︁ 𝑖 ∈ I + 𝑢 [𝑐 𝑢 ( ŷ𝑢𝑖 -1) 2 -𝑐 𝑢 𝜆 ŷ2 𝑢𝑖 ] + 𝜆 ∑︁ 𝑡 ∈ I + 𝑢 ŷ2 𝑢𝑡 + 𝜆 ∑︁ 𝑝 ∈ I\\I + 𝑢 ŷ2 𝑢𝑡 = ∑︁ 𝑢 ∑︁ 𝑖 ∈ I + 𝑢 [𝑐 𝑢 ( ŷ𝑢𝑖 -1) 2 + 𝑐 𝑢 ∑︁ 𝑝 ∈ I\\I + 𝑢 ŷ2 𝑢𝑡 + 𝜆(1 -𝑐 𝑢 ) ∑︁ 𝑢 ∑︁ 𝑖 ∈ I + 𝑢 ŷ2 𝑢𝑖 + (𝜆 -𝑐 𝑢 ) ∑︁ 𝑝 ∈ I\\I + 𝑢 ŷ2 𝑢𝑡 = || √︁ 𝐶 𝑢 (𝑋 -𝑋𝑊 )|| 2 𝐹 -𝜆||𝑋 ⊙ √︁ 𝐶 𝑢 -𝐼𝑋𝑊 || 2 𝐹 -||(1 -𝑋 ) ⊙ √︁ 𝐶 𝑢 -𝜆𝐼𝑋𝑊 || 2 𝐹 Note that ∑︁ 𝑢 ∑︁ 𝑖 ∈ I ŷ2 𝑢𝑖 = ||𝑋𝑊 || 2 𝐹 (25\n)\nTo find the closed-form solution, we further restrict 𝜆 = 1 and consider 𝑐 𝑢 as a constant (always > 1), thus, we have the following simplified format:\nL 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑚𝑠𝑒 =|| √︁ 𝐶 𝑢 (𝑋 -𝑋𝑊 )|| 2 𝐹 -|| √︁ 𝐶 𝑢 -𝐼𝑋𝑊 || 2 𝐹 = ||𝑋 -𝑋𝑊 || 2 𝐹 -𝛼 ||𝑋𝑊 || 2 𝐹(26)\nwhere, 𝛼 = 𝑐 𝑢 -1. Note that if we only minimize this objective function L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑚𝑠𝑒 , we have the closed form:\n𝑊 = ((1 -𝜆)𝑋 𝑇 𝑋 ) -1 𝑋 𝑇 𝑋 .", "publication_ref": ["b19", "b45", "b50", "b20", "b44", "b45", "b45", "b50"], "figure_ref": [], "table_ref": []}, {"heading": "Now, considering the debiased version of EASE:", "text": "L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑒𝑎𝑠𝑒 = ||𝑋 -𝑋𝑊 || 2 𝐹 -𝛼 ||𝑋𝑊 || 2 𝐹 + 𝜆||𝑊 || 2 𝐹 𝑠.𝑡 . 𝑑𝑖𝑎𝑔(𝑊 ) = 0\nIt has the following closed-form solution (by similar inference as EASE [51]):\n𝑊 = 1 1 -𝛼 (𝐼 -P • 𝑑𝑀𝑎𝑡 ( ì 1 ⊘ 𝑑𝑖𝑎𝑔( P)), 𝑤ℎ𝑒𝑟𝑒 P = (𝑋 𝑇 𝑋 + 𝜆 1 -𝛼 𝐼 ) -1 (27)\nNow, we can make the following observation: Theorem 2. For any debiased EASE loss L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑒𝑎𝑠𝑒 with parameters 𝛼 and 𝜆 with constant 𝑐 𝑢 > 1 for all users, there are original EASE loss with parameter, 𝜆 ′ , which have the same closed form solutions EASE (up to constant factor).\nProof Sketch: Following above analysis and let 𝜆 ′ = 𝜆 (1-𝛼 )𝑐 𝑢 . □ These results also indicate the sampling based approach to optimize the debiased 𝑀𝑆𝐸 loss may also be rather limited. In the experimental results, we will further validate this conjecture on debiased MSE loss. ", "publication_ref": ["b50"], "figure_ref": [], "table_ref": []}, {"heading": "EXPERIMENT", "text": "In this section, we experimentally study the most widely used loss functions in the existing recommendation models and their corresponding debiased loss as well as newly proposed MINE loss under recommendation settings. This could help better understand and compare the resemblance and discrepancy between different loss functions, and understand their debiasing benefits. Specifically, we would like to answer the following questions:\n• Q1. How does the bias introduced by the existing negative sampling impact model performance and how do our proposed debiased losses perform compared to traditional biased ones? • Q2. How does our proposed MINE objective function in Section 2 compare to widely used ones? • Q3. What is the effect of different hyperparameters on the various debiased loss functions?", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Experimental Setup", "text": "4.1.1 Datasets. We use three datasets, Amazon-Books, Yelp2018 and Gowalla commonly used by a number of recent studies [16,37,56,58]. We obtain the publicly available processed data and follow the same setting as [16,37,56].", "publication_ref": ["b15", "b36", "b55", "b57", "b15", "b36", "b55"], "figure_ref": [], "table_ref": []}, {"heading": "Evaluation Metrics.", "text": "Consistent with benchmarks [16,37,56], we evaluate the performance by 𝑅𝑒𝑐𝑎𝑙𝑙@20 and 𝑁 𝐷𝐶𝐺@20 over all items [25].\n4.1.3 Models. This paper focuses on the study of loss functions, which is architecture agnostic. Thus, we evaluate our loss functions on top of the simplest one -Matrix Factorization (MF) in this study. By eliminating the influence of the architecture, we can compare the power of various loss functions fairly. Meantime, we compare the performance of the proposed methods with a few classical machine learning models as well as advanced deep learning models, including, iALS [46], MF-BPR [43], MF-CCL [37], YouTubeNet [11], NeuMF [17], LightGCN [16], NGCF [56], CML [19], PinSage [60], GAT [54], MultiVAE [35], SGL-ED [58]. Those comparison can help establish that the loss functions with basic MF can produce strong and robust baselines for recommendation community to evaluate more advanced and sophisticated models.", "publication_ref": ["b15", "b36", "b55", "b24", "b45", "b42", "b36", "b10", "b16", "b15", "b55", "b18", "b59", "b53", "b34", "b57"], "figure_ref": [], "table_ref": []}, {"heading": "Loss functions.", "text": "As the core of this paper, we focus on some most widely used loss functions and their debiased counterparts, including InfoNCE [40], MSE [21,46], and state-of-the-art CCL [37], as well as new proposed MINE [3].  and reduced by 0.5 on the plateau, early stopped until it arrives at 1𝑒 -6. For the cases where negative samples get involved, we would set it as 800 by default. We search the global regularization weight between 1𝑒 -9 to 1𝑒 -5 with an increased ratio of 10.\n4\nFor the exact hyperparameter settings of the model, we would present it in Appendix A and our anonymous code is available at https://anonymous.4open.science/r/KDD-2023-Anonymous-5F83/ README.md ", "publication_ref": ["b39", "b20", "b45", "b36", "b2"], "figure_ref": [], "table_ref": []}, {"heading": "Q1. (Biased) Loss vs Debiased Loss", "text": "Here, we seek to examine the negative impact of bias introduced by negative sampling and assess the effectiveness of our proposed debiased loss functions. We utilize Matrix Factorization (MF) as the backbone and compare the performance of the original (biased) version and the debiased version for the loss functions of 𝐶𝐶𝐿 [37], 𝑀𝑆𝐸 [21,46], and 𝐼𝑛𝑓 𝑜𝑁𝐶𝐸 [40]. Table 2 shows the biased loss vs debiased loss (on top of the MF) results.\nThe results show that the debiased methods consistently outperform the biased ones for the CCL and InfoNCE loss functions in all cases. In particular, the debiased method exhibits remarkable improvements of up to over 4% for the CCL loss function on the 𝐴𝑚𝑎𝑧𝑜𝑛 -𝐵𝑜𝑜𝑘𝑠 dataset. This highlights the adverse effect of bias in recommendation quality and demonstrates the success of applying contrastive learning based debiasing methods in addressing this issue. In addition, despite the robustness with respect to the biased MSE loss for iALS and EASE (as being proof in Section 3, the debiased MSE still provides slight gain over the existing MSE loss. Finally, we note that the performance gained by the debiasing losses is also consistent with the results over other machine learning tasks as shown in [9].", "publication_ref": ["b36", "b20", "b45", "b39", "b8"], "figure_ref": [], "table_ref": ["tab_2"]}, {"heading": "Q2. Performance of MINE \\ MINE+", "text": "Next, we delve into the examination of the newly proposed Mutual Information Neural Estimator (MINE) loss function. As we mentioned before, to our best knowledge, this is the first study utilizing and evaluating MINE loss in recommendation settings. We compare MINE with other loss functions, all set MF as the backbone, as displayed in Table 2,. Our results show the surprising effectiveness of MINE-type losses. In particular, the basic MINE is shown close to 5% average lifts over the (biased) InfoNCE loss, a rather stand loss in recommendation models. MINE+ demonstrates comparable or superior performance compared to the state-of-the-art CCL loss function. Furthermore, MINE+ consistently achieves better results than InfoNCE with a maximum improvement of 14% (with an average improvement over 11%.\nThese findings highlight the potential of MINE as an effective objective function for recommendation models and systems. Noting that our MINE+ loss is model agnostic, which can be applied to any representation-based model. But using it with the basic MF already provides strong and robust baselines for evaluating recommendation models (and systems).\nFurthermore, we compare MF-MINE+ as well as our debiased MF-CCL model with some advanced machine learning and deep learning models in Table 3. We can find these two methods perform best or second best in most cases, affirming the superiority of the MINE+ loss and debiased CCL.", "publication_ref": [], "figure_ref": [], "table_ref": ["tab_2"]}, {"heading": "Q3. Hyperparameter analysis", "text": "Here, we analyze the impacts of three key hyperparameters in the debiased framework: negative weight 𝜆, number of negative samples, and number of positive samples as shown in Figs. 1 and2.\nThe left side of Fig. 1 reveals that, in general, increasing the number of negative samples leads to better performance in models. The MSE loss requires fewer negative samples to reach a stable Table 3: Perfomance comparison to widely used models. We highlight the top-3 best models in each column. Results of models marked with * are duplicated from [37] for consistency. For a fair comparison of the MF-based models marked with * * are reproduced by ourselves with thorough parameter searching detailed in Appendix A.", "publication_ref": ["b36"], "figure_ref": ["fig_0", "fig_0"], "table_ref": []}, {"heading": "Model Yelp", "text": "Gowalla Amazon-Books Recall@20 NDCG@20 Recall@20 NDCG@20 Recall@20 NDCG@20 Deep Learning Based YouTubeNet* [11] 6  plateau but performs worse when the number of negative samples increases. The right side of Fig. 1 shows that the number of positive samples in the debiased formula has a minor impact on performance compared to negative samples. In Fig. 2, we illustrate how the negative weight affects the performance of the debiased CCL, MSE, and InfoNCE losses. In general, we would expect the ∩ shaped curve for quality metric (𝑅𝑒𝑐𝑎𝑙𝑙@20 here) for the parameters, which is consistent with our curves. The optimal negative weight for these loss functions locates at different orders of magnitude due to their intrinsic differences of loss functions. In general, the negative weights of MSE and CCLE are relatively small and the negative weights of InfoNCE are in the order of hundreds and related to the number of negative samples (Appendix A).\nIn Fig. 3, we investigate how temperature can affect the performance of 𝑀𝐼 𝑁 𝐸+ loss function. In general, it would achieve optimal around 0.5 for all datasets (see Appendix A). to optimize user and item embeddings alternatively. Due to its effectiveness and efficiency, there is a large number of works that take the MSE or its variants as their objectives, spanning from Matrix Factorization (MF) based models [18,45,46], to regression-based models, including SLIM [39], EASE [51,52], etc. He et al. treat collaborative filtering as a binary classification task and apply the pointwise objective -Binary Cross-Entropy Loss (BCE) onto it [17]. CML utilized the pairwise hinge loss onto the collaborative filtering scenario [19]. MultiVAE [35] utilizes multinomial likelihood estimation. Rendle et al. proposed a Bayesian perspective pairwise ranking loss -BPR, in the seminal work [43]. YouTubeNet posed a recommendation as an extreme multiclass classification problem and apply the Softmax cross-entropy (Softmax) [11,22]. Recently, inspired by the largely used contrastive loss in the computer vision area, [37] proposed a first-order based Cosine Contrastive Loss (CCL), where they maximize the cosine similarity between the positive pairs (between users and items) and minimize the similarity below some manually selected margin.", "publication_ref": ["b10", "b17", "b44", "b45", "b38", "b50", "b51", "b16", "b18", "b34", "b42", "b10", "b21", "b36"], "figure_ref": ["fig_0"], "table_ref": []}, {"heading": "Contrastive Learning", "text": "Recently, Contrastive Learning (CL) has become a prominent optimizing framework in deep learning [7,40]. The motivation behind CL is to learn representations by contrasting positive and negative pairs as well as maximize the positive pairs, including data augmentation [7] and multi-view representations [53], etc. Chuang et al.\nproposed a new unsupervised contrastive representation learning framework, targeting to minimize the bias introduced by the selection of the negative samples. This debiased objective consistently improved its counterpart -the biased one in various benchmarks [9]. Lately, by introducing the margin between positive and negative samples, Belghazi et al. present a supervised contrastive learning framework that is robust to biases [2]. In addition, a mutual information estimator -MINE [3], closely related to the contrastive learning loss InfoNCE [40], has demonstrated its efficiency in various optimizing settings. [55] study the alignment and uniformity of user, item embeddings from the perspective of contrastive learning in the recommendation. CLRec [63] design a new contrastive learning loss which is equivalent to using inverse propensity weighting to reduce exposure bias of a large-scale system.", "publication_ref": ["b6", "b39", "b6", "b52", "b8", "b1", "b2", "b39", "b54", "b62"], "figure_ref": [], "table_ref": []}, {"heading": "Negative Sampling Strategies for Item Recommendation", "text": "In most real-world scenarios, only positive feedback is available which brings demand for negative signals to avoid trivial solutions during training recommendation models. Apart from some nonsampling frameworks like iALS [21], Multi-VAE [35], the majority of models [5,8,16,17,41,43] would choose to sample negative items for efficiency consideration. Uniform sampling is the most popular one [43] which assumes uniform prior distribution. Importance sampling is another popular choice [33], which chooses negative according to their frequencies. Adaptive sampling strategy keep tracking and picking the negative samples with higher scores [42,62]. Another similar strategy is SRNS [14], which tries to find and optimize false negative samples In addition, NCE [15] approach for negative sampling has also been adopted in the recommendation system [8].", "publication_ref": ["b20", "b34", "b4", "b7", "b15", "b16", "b40", "b42", "b42", "b32", "b41", "b61", "b13", "b14", "b7"], "figure_ref": [], "table_ref": []}, {"heading": "Bias and Debias in Recommendation", "text": "In the recommender system, there are various different bias [6], including item exposure bias, popularity bias, position bias, selection bias, etc. These issues have to be carefully handled otherwise it would lead to unexpected results, such as inconsistency of online and offline performance, etc. Marlin et al. [38] validate the existence of selection bias by conducting a user survey, which indicates the discrepancy between the observed rating data and all data. Since users are generally exposed to a small set of items, unobserved data doesn't mean negative preference, this is so-called exposure bias [36]. Position bias [10] is another commonly encountered one, where users are more likely to select items that display in a desirable place or higher position on a list. Steck et al. [50] propose an unbiased metric to deal with selection bias. iALS [21] put some weights on unobserved data which helps improve the performance and deal with exposure bias. In addition, the sampling strategy would naturally diminish the exposure bias during model training [6,43]. EXMF [34] is a user exposure simulation model that can also help reduce exposure bias. To reduce position bias, some models [4,12] make assumptions about user behaviors and estimate true relevance instead of directly using clicked data. [48] proposed an unbiased pairwise BPR estimator and further provide a practical technique to reduce variance. Another widely used method to correct bias is the utilization of propensity score [49,64] where each item is equiped with some position weight.", "publication_ref": ["b5", "b37", "b35", "b9", "b49", "b20", "b5", "b42", "b33", "b3", "b11", "b47", "b48", "b63"], "figure_ref": [], "table_ref": []}, {"heading": "CONCLUSION", "text": "In this paper, we conduct a comprehensive analysis of recommendation loss functions from the perspective of contrastive learning. We introduce a list of debiased losses and new mutual informationbased loss functions -MINE and MINE+ to recommendation setting. We also show how the point-wise loss functions can be debiased and certified both iALS and EASE are inherently debiased. The empirical experimental results demonstrate the debiased losses and new information losses outperform the existing (biased) ones. In the future, we would like to investigate how the loss functions work with more sophisticated neural architectures, and help discover more effective recommendation models by leveraging these losses.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "ACKNOWLEDGEMENT", "text": "This research was partially funded by the National Science Foundation through grants IIS-2142675, IIS-2142681, and III-2008557. ", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "A REPRODUCIBILITY", "text": "In Table 4, we list the details of the hyperparameters for reproducing the results of 𝑀𝐼 𝑁 𝐸+ in Tables 2 and3.\nIn Table 5, we list the details of the hyperparameters for reproducing the results of debiased 𝐶𝐶𝐿 in Table 2.", "publication_ref": [], "figure_ref": [], "table_ref": ["tab_4", "tab_2", "tab_5", "tab_2"]}, {"heading": "B PROOF B.1 Proof of Theorem 1", "text": "Proof. To derive the alternating least square solution, we have:\n• Fixing item vectors, optimizing: Interestingly by choosing the right 𝛼 0 and 𝜆, the above solution is in fact the same solution (up to constant factor) for the original L 𝑖𝐴𝐿𝑆 [20]. Following the above analysis and let 𝛼 ′  \nL 𝑢 = || √ 𝑐 𝑢 (𝐻\nÛ ← X ⊤ X + Λ + Ω -1 X ⊤ X • dMat(1 + β) + Ω • dMat( β -γ) V V⊤ V -1 V⊤ ← Û⊤ X ⊤ X + Λ + Ω Û -1 Û⊤ X ⊤ X • dMat(1 + β) + Ω • dMat( β -γ) β ← diag X ⊤ X Û V⊤ -diag X ⊤ X + diag(Ω) ⊙ diag Û V⊤ + γ diag (X ⊤ X) + diag(Ω -Λ) γ ← γ + diag Û V⊤ - β(35)\nD EASE-DEBIASED ", "publication_ref": ["b19"], "figure_ref": [], "table_ref": []}, {"heading": "", "text": "Additional support came from a collaborative research agreement between Kent State University and iLambda Inc.", "publication_ref": [], "figure_ref": [], "table_ref": []}], "references": [{"ref_id": "b0", "title": "Recommender Systems: The Textbook", "journal": "Springer Publishing Company, Incorporated", "year": "2016", "authors": "C Charu;  Aggarwal"}, {"ref_id": "b1", "title": "Unbiased Supervised Contrastive Learning", "journal": "", "year": "2023", "authors": "Alberto Carlo; Benoit Barbano; Enzo Dufumier; Marco Tartaglione; Pietro Grangetto;  Gori"}, {"ref_id": "b2", "title": "Mutual information neural estimation", "journal": "PMLR", "year": "2018", "authors": "Mohamed Ishmael Belghazi; Aristide Baratin; Sai Rajeshwar; Sherjil Ozair; Yoshua Bengio; Aaron Courville; Devon Hjelm"}, {"ref_id": "b3", "title": "A Dynamic Bayesian Network Click Model for Web Search Ranking", "journal": "Association for Computing Machinery", "year": "2009", "authors": "Olivier Chapelle; Ya Zhang"}, {"ref_id": "b4", "title": "Revisiting Negative Sampling VS. Non-Sampling in Implicit Recommendation", "journal": "ACM Trans. Inf. Syst", "year": "2022-03", "authors": "Chong Chen; Weizhi Ma; Min Zhang; Chenyang Wang; Yiqun Liu; Shaoping Ma"}, {"ref_id": "b5", "title": "Bias and Debias in Recommender System: A Survey and Future Directions", "journal": "ACM Trans. Inf. Syst", "year": "2022-10", "authors": "Jiawei Chen; Hande Dong; Xiang Wang; Fuli Feng; Meng Wang; Xiangnan He; † "}, {"ref_id": "b6", "title": "A simple framework for contrastive learning of visual representations", "journal": "PMLR", "year": "2020", "authors": "Ting Chen; Simon Kornblith; Mohammad Norouzi; Geoffrey Hinton"}, {"ref_id": "b7", "title": "On Sampling Strategies for Neural Network-Based Collaborative Filtering", "journal": "Association for Computing Machinery", "year": "2017", "authors": "Ting Chen; Yizhou Sun; Yue Shi; Liangjie Hong"}, {"ref_id": "b8", "title": "Debiased Contrastive Learning", "journal": "", "year": "2020-12-06", "authors": "Ching-Yao Chuang; Joshua Robinson; Yen-Chen Lin; Antonio Torralba; Stefanie Jegelka"}, {"ref_id": "b9", "title": "A Study of Position Bias in Digital Library Recommender Systems", "journal": "", "year": "2018", "authors": "Andrew Collins; Dominika Tkaczyk; Akiko Aizawa; Jöran Beel"}, {"ref_id": "b10", "title": "Deep Neural Networks for YouTube Recommendations", "journal": "Association for Computing Machinery", "year": "2016", "authors": "Paul Covington; Jay Adams; Emre Sargin"}, {"ref_id": "b11", "title": "An Experimental Comparison of Click Position-Bias Models", "journal": "Association for Computing Machinery", "year": "2008", "authors": "Nick Craswell; Onno Zoeter; Michael Taylor; Bill Ramsey"}, {"ref_id": "b12", "title": "Are We Really Making Much Progress? A Worrying Analysis of Recent Neural Recommendation Approaches", "journal": "", "year": "2019", "authors": "Maurizio Ferrari Dacrema; Paolo Cremonesi; Dietmar Jannach"}, {"ref_id": "b13", "title": "Simplify and Robustify Negative Sampling for Implicit Collaborative Filtering", "journal": "", "year": "2020", "authors": "Jingtao Ding; Yuhan Quan; Quanming Yao; Yong Li; Depeng Jin"}, {"ref_id": "b14", "title": "Noise-contrastive estimation: A new estimation principle for unnormalized statistical models", "journal": "PMLR", "year": "2010", "authors": "Michael Gutmann; Aapo Hyvärinen"}, {"ref_id": "b15", "title": "LightGCN: Simplifying and Powering Graph Convolution Network for Recommendation", "journal": "Association for Computing Machinery", "year": "2020", "authors": "Xiangnan He; Kuan Deng; Xiang Wang; Yan Li; Yongdong Zhang; Meng Wang"}, {"ref_id": "b16", "title": "Neural Collaborative Filtering", "journal": "ACM", "year": "2017-04-03", "authors": "Xiangnan He; Lizi Liao; Hanwang Zhang; Liqiang Nie; Xia Hu; Tat-Seng Chua"}, {"ref_id": "b17", "title": "Fast Matrix Factorization for Online Recommendation with Implicit Feedback", "journal": "Association for Computing Machinery", "year": "2016", "authors": "Xiangnan He; Hanwang Zhang; Min-Yen Kan; Tat-Seng Chua"}, {"ref_id": "b18", "title": "Collaborative Metric Learning", "journal": "CHE", "year": "2017", "authors": "Cheng-Kang Hsieh; Longqi Yang; Yin Cui; Tsung-Yi Lin; Serge Belongie; Deborah Estrin"}, {"ref_id": "b19", "title": "Collaborative filtering for implicit feedback datasets", "journal": "", "year": "2008", "authors": "Y Hu; Y Koren; C Volinsky"}, {"ref_id": "b20", "title": "Collaborative Filtering for Implicit Feedback Datasets", "journal": "", "year": "2008", "authors": "Yifan Hu; Yehuda Koren; Chris Volinsky"}, {"ref_id": "b21", "title": "On Using Very Large Target Vocabulary for Neural Machine Translation", "journal": "The Association for Computer Linguistics", "year": "2015-07-26", "authors": "Sébastien Jean; Kyunghyun Cho; Roland Memisevic; Yoshua Bengio"}, {"ref_id": "b22", "title": "Towards a Better Understanding of Linear Models for Recommendation", "journal": "Association for Computing Machinery", "year": "2021", "authors": "Ruoming Jin; Dong Li; Jing Gao; Zhi Liu; Li Chen; Yang Zhou"}, {"ref_id": "b23", "title": "On Estimating Recommendation Evaluation Metrics under Sampling", "journal": "", "year": "2021-05", "authors": "Ruoming Jin; Dong Li; Benjamin Mudrak; Jing Gao; Zhi Liu"}, {"ref_id": "b24", "title": "On Sampled Metrics for Item Recommendation", "journal": "Association for Computing Machinery", "year": "2020", "authors": "Walid Krichene; Steffen Rendle"}, {"ref_id": "b25", "title": "On sampled metrics for item recommendation", "journal": "Commun. ACM", "year": "2022", "authors": "Walid Krichene; Steffen Rendle"}, {"ref_id": "b26", "title": "Impression-Informed Multi-Behavior Recommender System: A Hierarchical Graph Attention Approach", "journal": "", "year": "2023", "authors": "Dong Li; Divya Bhargavi; Vidya Sagar; Ravipati "}, {"ref_id": "b27", "title": "On sampling top-k recommendation evaluation", "journal": "", "year": "2020", "authors": "Dong Li; Ruoming Jin; Jing Gao; Zhi Liu"}, {"ref_id": "b28", "title": "On Item-Sampling Evaluation for Recommender System", "journal": "ACM Trans. Recomm. Syst", "year": "2023-10", "authors": "Dong Li; Ruoming Jin; Zhenming Liu; Bin Ren; Jing Gao; Zhi Liu"}, {"ref_id": "b29", "title": "Towards Reliable Item Sampling for Recommendation Evaluation", "journal": "AAAI Press", "year": "2023", "authors": "Dong Li; Ruoming Jin; Zhenming Liu; Bin Ren; Jing Gao; Zhi Liu"}, {"ref_id": "b30", "title": "On the regularization landscape for the linear recommendation models", "journal": "", "year": "2022", "authors": "Dong Li; Zhenming Liu; Ruoming Jin; Zhi Liu; Jing Gao; Bin Ren"}, {"ref_id": "b31", "title": "Generation-Augmented Query Expansion For Code Retrieval", "journal": "", "year": "2022", "authors": "Dong Li; Yelong Shen; Ruoming Jin; Yi Mao; Kuan Wang; Weizhu Chen"}, {"ref_id": "b32", "title": "Personalized Ranking with Importance Sampling", "journal": "Association for Computing Machinery", "year": "2020", "authors": "Defu Lian; Qi Liu; Enhong Chen"}, {"ref_id": "b33", "title": "Modeling User Exposure in Recommendation", "journal": "CHE", "year": "2016", "authors": "Dawen Liang; Laurent Charlin; James Mcinerney; David M Blei"}, {"ref_id": "b34", "title": "Variational Autoencoders for Collaborative Filtering", "journal": "ACM", "year": "2018-04-23", "authors": "Dawen Liang; Rahul G Krishnan; Matthew D Hoffman; Tony Jebara"}, {"ref_id": "b35", "title": "A General Knowledge Distillation Framework for Counterfactual Recommendation via Uniform Data", "journal": "Association for Computing Machinery", "year": "2020", "authors": "Dugang Liu; Pengxiang Cheng; Zhenhua Dong; Xiuqiang He; Weike Pan; Zhong Ming"}, {"ref_id": "b36", "title": "SimpleX: A Simple and Strong Baseline for Collaborative Filtering", "journal": "Association for Computing Machinery", "year": "2021", "authors": "Kelong Mao; Jieming Zhu; Jinpeng Wang; Quanyu Dai; Zhenhua Dong; Xi Xiao; Xiuqiang He"}, {"ref_id": "b37", "title": "Collaborative Filtering and the Missing at Random Assumption", "journal": "AUAI Press", "year": "2007-07-19", "authors": "Benjamin M Marlin; Richard S Zemel; Sam T Roweis; Malcolm Slaney"}, {"ref_id": "b38", "title": "SLIM: Sparse Linear Methods for Top-N Recommender Systems", "journal": "", "year": "2011", "authors": "Xia Ning; George Karypis"}, {"ref_id": "b39", "title": "Representation learning with contrastive predictive coding", "journal": "", "year": "2018", "authors": "Aaron Van Den Oord; Yazhe Li; Oriol Vinyals"}, {"ref_id": "b40", "title": "Item recommendation from implicit feedback", "journal": "Springer", "year": "2021", "authors": "Steffen Rendle"}, {"ref_id": "b41", "title": "Improving Pairwise Learning for Item Recommendation from Implicit Feedback", "journal": "Association for Computing Machinery", "year": "2014", "authors": "Steffen Rendle; Christoph Freudenthaler"}, {"ref_id": "b42", "title": "BPR: Bayesian Personalized Ranking from Implicit Feedback", "journal": "AUAI Press", "year": "2009", "authors": "Steffen Rendle; Christoph Freudenthaler; Zeno Gantner; Lars Schmidt-Thieme"}, {"ref_id": "b43", "title": "Neural Collaborative Filtering vs. Matrix Factorization Revisited", "journal": "Association for Computing Machinery", "year": "2020", "authors": "Steffen Rendle; Walid Krichene; Li Zhang; John Anderson"}, {"ref_id": "b44", "title": "iALS++: Speeding up Matrix Factorization with Subspace Optimization", "journal": "", "year": "2021", "authors": "Steffen Rendle; Walid Krichene; Li Zhang; Yehuda Koren"}, {"ref_id": "b45", "title": "Revisiting the Performance of IALS on Item Recommendation Benchmarks", "journal": "Association for Computing Machinery", "year": "2022", "authors": "Steffen Rendle; Walid Krichene; Li Zhang; Yehuda Koren"}, {"ref_id": "b46", "title": "On the Difficulty of Evaluating Baselines: A Study on Recommender Systems", "journal": "", "year": "2019", "authors": "Steffen Rendle; Li Zhang; Yehuda Koren"}, {"ref_id": "b47", "title": "Unbiased Pairwise Learning from Biased Implicit Feedback", "journal": "Association for Computing Machinery", "year": "2020", "authors": "Yuta Saito"}, {"ref_id": "b48", "title": "Unbiased Recommender Learning from Missing-Not-At-Random Implicit Feedback", "journal": "Association for Computing Machinery", "year": "2020", "authors": "Yuta Saito; Suguru Yaginuma; Yuta Nishino; Hayato Sakata; Kazuhide Nakata"}, {"ref_id": "b49", "title": "Training and Testing of Recommender Systems on Data Missing Not at Random", "journal": "Association for Computing Machinery", "year": "2010", "authors": "Harald Steck"}, {"ref_id": "b50", "title": "Embarrassingly Shallow Autoencoders for Sparse Data", "journal": "", "year": "2019", "authors": "Harald Steck"}, {"ref_id": "b51", "title": "Autoencoders that don't overfit towards the Identity", "journal": "", "year": "2020-12-06", "authors": "Harald Steck"}, {"ref_id": "b52", "title": "Contrastive Multiview Coding", "journal": "Springer", "year": "2020-08-23", "authors": "Yonglong Tian; Dilip Krishnan; Phillip Isola"}, {"ref_id": "b53", "title": "Graph attention networks", "journal": "", "year": "2018", "authors": "Petar Veličković; Guillem Cucurull; Arantxa Casanova; Adriana Romero; Pietro Lio; Yoshua Bengio"}, {"ref_id": "b54", "title": "Towards Representation Alignment and Uniformity in Collaborative Filtering", "journal": "Association for Computing Machinery", "year": "2022", "authors": "Chenyang Wang; Yuanqing Yu; Weizhi Ma; Min Zhang; Chong Chen; Yiqun Liu; Shaoping Ma"}, {"ref_id": "b55", "title": "Neural Graph Collaborative Filtering", "journal": "ACM", "year": "2019-07-21", "authors": "Xiang Wang; Xiangnan He; Meng Wang; Fuli Feng; Tat-Seng Chua"}, {"ref_id": "b56", "title": "CellPAD: Detecting Performance Anomalies in Cellular Networks via Regression Analysis", "journal": "", "year": "2018", "authors": "Jun Wu; P C Patrick; Qi Lee; Lujia Li; Jianfeng Pan;  Zhang"}, {"ref_id": "b57", "title": "Self-supervised Graph Learning for Recommendation", "journal": "ACM", "year": "2021-07-11", "authors": "Jiancan Wu; Xiang Wang; Fuli Feng; Xiangnan He; Liang Chen; Jianxun Lian; Xing Xie"}, {"ref_id": "b58", "title": "BotTriNet: A Unified and Efficient Embedding for Social Bots Detection via Metric Learning", "journal": "", "year": "2023", "authors": "Jun Wu; Xuesong Ye; Yanyuet Man"}, {"ref_id": "b59", "title": "Graph Convolutional Neural Networks for Web-Scale Recommender Systems", "journal": "ACM", "year": "2018-08-19", "authors": "Rex Ying; Ruining He; Kaifeng Chen; Pong Eksombatchai; William L Hamilton; Jure Leskovec"}, {"ref_id": "b60", "title": "Deep Learning Based Recommender System: A Survey and New Perspectives", "journal": "ACM Comput. Surv", "year": "2019-02", "authors": "Shuai Zhang; Lina Yao; Aixin Sun; Yi Tay"}, {"ref_id": "b61", "title": "Optimizing Top-n Collaborative Filtering via Dynamic Negative Item Sampling", "journal": "Association for Computing Machinery", "year": "2013", "authors": "Weinan Zhang; Tianqi Chen; Jun Wang; Yong Yu"}, {"ref_id": "b62", "title": "Contrastive Learning for Debiased Candidate Generation in Large-Scale Recommender Systems", "journal": "Association for Computing Machinery", "year": "2021", "authors": "Chang Zhou; Jianxin Ma; Jianwei Zhang; Jingren Zhou; Hongxia Yang"}, {"ref_id": "b63", "title": "Unbiased Implicit Recommendation and Propensity Estimation via Combinational Joint Learning (RecSys '20)", "journal": "Association for Computing Machinery", "year": "2020", "authors": "Ziwei Zhu; Yun He; Yin Zhang; James Caverlee"}], "figures": [{"figure_label": "1", "figure_type": "figure", "figure_id": "fig_0", "figure_caption": "Figure 1 :1Figure 1: Effect of number of positive and negative samples on 𝐺𝑜𝑤𝑎𝑙𝑙𝑎", "figure_data": ""}, {"figure_label": "23", "figure_type": "figure", "figure_id": "fig_1", "figure_caption": "Figure 2 :Figure 3 :23Figure 2: Effect of negative weight on 𝐺𝑜𝑤𝑎𝑙𝑙𝑎", "figure_data": ""}, {"figure_label": "23021232112234", "figure_type": "figure", "figure_id": "fig_2", "figure_caption": "2 ( 30 ) 2 𝐹 + ||Λ 1 2 2 𝐹 ( 32 )||Λ 1 2||Λ 1 2 2 𝐹+ 2 𝐹 ( 34 )23021232112234convex. (𝑥, 𝑧 are vectors) min 𝑓 (𝑥) + 𝑔(𝑧) 𝑠.𝑡 𝐴𝑥 + 𝐵𝑧 = 𝑐 (29) Its equivalent to optimize:L 𝜌 (𝑥, 𝑦, 𝑧) = 𝑓 (𝑥) + 𝑔(𝑧) + 𝑦 𝑇 (𝐴𝑥 + 𝐵𝑧 -𝑐) + (𝜌/2)||𝐴𝑥 + 𝐵𝑧 -𝑐 || 2The alternating solution is:𝑥 𝑘+1 := argmin 𝑥 𝐿 𝜌 𝑥, 𝑧 𝑘 , 𝑦 𝑘 𝑧 𝑘+1 := argmin 𝑧 𝐿 𝜌 𝑥 𝑘+1 , 𝑧, 𝑦 𝑘 𝑦 𝑘+1 := 𝑦 𝑘 + 𝜌 𝐴𝑥 𝑘+1 + 𝐵𝑧 𝑘+1 -𝑐(31)C.2 Low-Rank EDLAEIn[52], equation 10 is to optimize:||𝑋 -𝑋 • {𝑈𝑉 𝑇 -𝑑𝑀𝑎𝑡 𝑑𝑖𝑎𝑔(𝑈𝑉 𝑇 ) }|| • {𝑈𝑉 𝑇 -𝑑𝑀𝑎𝑡 𝑑𝑖𝑎𝑔(𝑈𝑉 𝑇 ) }||This can be re-written as:||𝑋 -𝑋𝑈𝑉 𝑇 + 𝑋 • 𝑑𝑀𝑎𝑡 (𝛽)|| 2 𝐹 + • (𝑈𝑉 𝑇 -𝑑𝑀𝑎𝑡 (𝛽))|| 2 𝐹 𝑠.𝑡 . 𝛽 = 𝑑𝑖𝑎𝑔(𝑈𝑉 𝑇 )(33)Using augmented Lagrangian:||𝑋 -𝑋𝑈𝑉 𝑇 + 𝑋 • 𝑑𝑀𝑎𝑡 (𝛽)|| 2 𝐹 + 𝑈𝑉 𝑇 || -||𝑑𝑀𝑎𝑡 (𝛽)|| 2𝛾 𝑇 Ω(𝛽 -𝑑𝑖𝑎𝑔(𝑈𝑉 𝑇 )) + ||Ω 1 2 (𝛽 -𝑑𝑖𝑎𝑔(𝑈𝑉 𝑇 ))||𝛾 is the vector of Lagrangian multipliers, amd Ω = Λ + 𝜔𝐼 where 𝜔 > 0 is a scalar.", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "fig_3", "figure_caption": "(Debiased) Contrastive Learning Loss for Recommendation (Technical Report) Conference acronym 'XX, 2023, Woodstock, NY", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Statistics of the datasets.", "figure_data": "DatasetUser # Item # Interaction #Yelp201831,668 38,0481, 561, 406Gowalla29,858 40,9811, 027, 370Amazon-Books 52,643 91,5992, 984, 108"}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_2", "figure_caption": "The performance of different loss functions w.r.t its debiased one on MF (Matrix Factorization). The unit of the metric values is %. We also present and highlight the relative improvement (RI) of the debiased loss function with its vanilla (biased) counterpart.", "figure_data": "YelpGowallaAmazon-BooksLossAverage RI%Recall@20 NDCG@20 Recall@20 NDCG@20 Recall@20 NDCG@20biased6.915.6718.1714.615.274.22-CCLdebiased6.985.7118.4214.975.494.40-RI%1.01%0.71%1.38%2.46%4.17%4.27%2.33%biased5.964.9514.2712.393.362.68-MSEdebiased6.055.0014.9812.643.352.61-RI%1.51%1.01%4.98%2.02%-0.30%-2.61%1.10%biased6.545.3616.4513.434.603.56-InfoNCEdebiased6.665.4516.5713.724.653.66-RI%1.83%1.68%0.73%2.16%1.09%2.81%1.72%MINE6.565.3716.9314.285.003.93-MINE (ours)RI% (w.r.t baised infoNCE)0.31%0.19%2.92%6.33%8.70%10.39%4.80%MINE+7.125.8618.1315.315.184.05-RI% (w.r.t baised infoNCE)8.87%9.33%10.21%14.00%12.61%13.76%11.46%"}, {"figure_label": "4", "figure_type": "table", "figure_id": "tab_4", "figure_caption": "Hyperparameter details of 𝑀𝐼 𝑁 𝐸+ loss", "figure_data": "Yelp2018 Gowalla Amazon-Booksnegative weight1.11.21.1temperature0.50.40.4regularization1e-81e-81e-8number of negative800800800"}, {"figure_label": "5", "figure_type": "table", "figure_id": "tab_5", "figure_caption": "Hyperparameter details of debiased 𝐶𝐶𝐿 loss", "figure_data": "Yelp2018 Gowalla Amazon-Booksnegative weight0.40.70.6margin0.90.90.4regularization-9-9-9number of negative800800800number of positive102050"}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_6", "figure_caption": "𝑢 𝑆 ) 𝑇 w 𝑢 -√ 𝑐 𝑢 y 𝑆 || 2 + || √ 𝛼 0 𝐻 𝑇 w 𝑢 || 2 + || √︁ 𝜆 𝑢 𝐼 • w 𝑢 || 2 -|| √ 𝑐 𝑢 𝛼 0 (𝐻 𝑢 𝑆 ) 𝑇 w 𝑢 || 2 , 𝑤ℎ𝑒𝑟𝑒 𝜆 𝑢 = 𝜆(|I + 𝑢 | + 𝛼 0 |I|) 𝜈 Note that the observed item matrix for user 𝑢 as 𝐻 𝑢 𝑆 : 𝐻 is the entire item matrix for all items. 𝑦 𝑆 are all 1 column (the same row dimension as 𝐻 𝑢 𝑆 . • Fixing User Vectors, optimizing: √︁ 𝐶 𝑢 y 𝑆 || 2 + || √ 𝛼 0 𝑊 𝑇 h 𝑖 || 2 + || √︁ 𝜆 𝑖 𝐼 • h 𝑖 || 2 𝑖 || 2 , 𝑤ℎ𝑒𝑟𝑒 𝜆 𝑖 = 𝜆(|U + 𝑖 | + 𝛼 0 |U|) 𝜈 Here, 𝑊 𝑖 𝑆 are observed user matrix for item 𝑖, and 𝑊 are the entire user matrix, 𝐶 𝑢 = 𝑑𝑖𝑎𝑔(𝑐 𝑢 ) a |U| × |U| diagonal matrix with 𝑐 𝑢 on the diagonal. Solving L 𝑢 and L 𝑖 , we have the following closed form solutions: w * 𝑢 = 𝑐 𝑢 (1 -𝛼 0 )𝐻 𝑢 𝑆 (𝐻 𝑢 𝑆 ) 𝑇 + 𝛼 0 𝐻𝐻 𝑇 + 𝜆 𝑢 𝐼 𝛼 0 )𝑊 𝑖 𝑆 𝐶 𝑢 (𝑊 𝑖 𝑆 ) 𝑇 + 𝛼 0 𝑊𝑊 𝑇 + 𝜆 𝑖 𝐼 √︁ 𝐶 𝑢 y 𝑆 Assuming 𝑐 𝑢 be a constant for all users, we get w * 𝑢 ∝ 𝐻 𝑢 𝑆 (𝐻 𝑢 𝑆 ) 𝑇 + 𝛼 0 (1 -𝛼 0 )𝑐 𝑢 𝐻𝐻 𝑇 + 𝜆 𝑢 (1 -𝛼 0 )𝑐 𝑢 𝐼", "figure_data": "-1• 𝐻 𝑢 𝑆 • y 𝑆h  *  𝑖 ∝ 𝑊 𝑖 𝑆 (𝑊 𝑖 𝑆 ) 𝑇 +𝛼 0 (1 -𝛼 0 )𝑐 𝑢𝑊𝑊 𝑇 +𝜆 𝑖 (1 -𝛼 0 )𝑐 𝑢𝐼-1• 𝑊 𝑖 𝑆 • y 𝑆𝑢 𝑆 =     h 1 h 𝑠 • • • h | I + 𝑢 |     ∈ R 𝑘 × | I + 𝑢 | , 𝑠 ∈ I + 𝑢(28)L 𝑖 = ||(𝑊 𝑖 𝑆√︁ 𝐶 𝑢 )-||√ 𝛼 0 (√︁ 𝐶 𝑢 𝑊 𝑖 𝑆 )-1• 𝐻 𝑢 𝑆 •√ 𝑐 𝑢 y 𝑆h  -1• 𝑊 𝑖 𝑆 •"}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_7", "figure_caption": "𝑢[𝑐 𝑢 ( ŷ𝑢𝑖 -1)2 -𝑐 𝑢 𝜆 ŷ2 𝑢𝑖 ] + 𝜆 𝑢 [𝑐 𝑢 ( ŷ𝑢𝑖 -1) 2 + 𝑐 𝑢 ∑︁ 𝐹 For Regression based 𝑊 = 𝑈𝑉 𝑇 𝐿 = || √︁ 𝐶 𝑢 (𝑋 -𝑋𝑈𝑉 𝑇 )|| 2 𝐹 -𝜆||𝑋 ⊙ √︁ 𝐶 𝑢 -𝐼𝑋𝑈𝑉 𝑇 || 2 𝐹 -||(1 -𝑋 ) ⊙ √︁ 𝐶 𝑢 -𝜆𝐼𝑋𝑈𝑉 𝑇 || 2", "figure_data": "L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑚𝑠𝑒=∑︁∑︁∑︁ŷ2 𝑢𝑡𝑢𝑖 ∈ I +𝑡 ∈ I=∑︁∑︁∑︁ŷ2 𝑢𝑡 + 𝜆∑︁ŷ2 𝑢𝑡𝑢𝑖 ∈ I +𝑡 ∈ I + 𝑢𝑝 ∈ I\\I + 𝑢=∑︁∑︁ŷ2𝑢𝑖 ∈ I +𝑝 ∈ I\\I + 𝑢"}], "formulas": [{"formula_id": "formula_0", "formula_text": "𝑝 (𝑖 |𝑢) = exp( ŷ𝑢𝑖 )", "formula_coordinates": [2.0, 119.19, 695.14, 70.39, 11.49]}, {"formula_id": "formula_1", "formula_text": "L 𝑠𝑜 𝑓 𝑡 = -E 𝑢 log ∑︁ 𝑖 ∈ I + 𝑢 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) 𝑗 ∈ I 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 )(1)", "formula_coordinates": [2.0, 370.16, 124.44, 188.58, 26.17]}, {"formula_id": "formula_2", "formula_text": "L 𝑠𝑠𝑜 𝑓 𝑡 = -E 𝑢 log ∑︁ 𝑖 ∈ I + 𝑢 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) + 𝑁 𝑗=1;𝑗∼𝑝 - 𝑢 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 )/𝑝 - 𝑢 ( 𝑗)(2)", "formula_coordinates": [2.0, 322.89, 259.7, 235.85, 26.17]}, {"formula_id": "formula_3", "formula_text": "L 𝑖𝑛𝑓 𝑜 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 log 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) + 𝑁 𝑗=1;𝑗∼𝑝 - 𝑢 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 )(3)", "formula_coordinates": [2.0, 342.35, 436.68, 216.39, 24.78]}, {"formula_id": "formula_4", "formula_text": "L 𝑖𝑛𝑓 𝑜 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 log 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) + 𝑁 𝑗=1;𝑗∼𝑝 𝑢 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 )(4)", "formula_coordinates": [2.0, 342.6, 645.16, 216.14, 24.4]}, {"formula_id": "formula_5", "formula_text": "𝑝 𝑢 (𝑖) = 𝜏 + 𝑢 • 𝑝 + 𝑢 (𝑖) + 𝜏 - 𝑢 • 𝑝 - 𝑢 (𝑖)(5)", "formula_coordinates": [3.0, 118.9, 337.34, 175.69, 11.14]}, {"formula_id": "formula_6", "formula_text": "L 𝐼𝑛𝑓 𝑜 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 log exp( ŷ𝑢𝑖 ) exp( ŷ𝑢𝑖 ) + 𝜆 E 𝑗 ∼𝑝 - 𝑢 exp( ŷ𝑢 𝑗 ) = -E 𝑢 E 𝑖∼𝑝 + 𝑢 log exp( ŷ𝑢𝑖 ) exp( ŷ𝑢𝑖 ) + 𝜆 1 𝜏 -E 𝑡 ∼𝑝𝑢 [exp( ŷ𝑢𝑡 ) ] -𝜏 + E 𝑗 ∼𝑝 + 𝑢 [exp( ŷ𝑢 𝑗 ) ](6)", "formula_coordinates": [3.0, 54.44, 489.98, 242.11, 59.13]}, {"formula_id": "formula_7", "formula_text": "L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝐼𝑛𝑓 𝑜 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 ;𝑗 ∼𝑝𝑢 ;𝑘∼𝑝 + 𝑢 log exp( ŷ𝑢𝑖 ) exp( ŷ𝑢𝑖 ) + 𝜆𝑓 ( { 𝑗 } 𝑁 1 , {𝑘 } 𝑀 1 )", "formula_coordinates": [3.0, 54.44, 611.74, 221.94, 20.31]}, {"formula_id": "formula_8", "formula_text": "𝑓 ( { 𝑗 } 𝑁 1 , {𝑘 } 𝑀 1 ) = max 1 𝜏 - 𝑢 1 𝑁 𝑁 ∑︁ 𝑗 =1;𝑗 ∼𝑝𝑢 𝑒𝑥𝑝 (𝑓 𝑢 𝑗 ) -𝜏 + 𝑢 1 𝑀 𝑀 ∑︁ 𝑘=1;𝑘∼𝑝 + 𝑢 𝑒𝑥𝑝 (𝑓 𝑢𝑘 ) , 𝑒 1/𝑡 (7)", "formula_coordinates": [3.0, 54.2, 638.44, 272.29, 31.8]}, {"formula_id": "formula_9", "formula_text": "𝐼 (𝑢, 𝑖) = 𝑠𝑢𝑝 (𝑣 𝑢 ;𝑣 𝑖 ) E 𝑝 𝑢,𝑖 [ ŷ𝑢𝑖 ] -log E 𝑝 𝑢 ⊗𝑝 𝑖 [𝑒 ŷ𝑢𝑖 ](8)", "formula_coordinates": [3.0, 356.43, 217.07, 202.31, 13.95]}, {"formula_id": "formula_10", "formula_text": "L 𝑚𝑖𝑛𝑒 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 ŷ𝑢𝑖 -log E 𝑗∼𝑝 𝑖 [exp ŷ𝑢 𝑗 ](9)", "formula_coordinates": [3.0, 360.2, 341.13, 198.54, 14.73]}, {"formula_id": "formula_11", "formula_text": "L 𝑚𝑖𝑛𝑒 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 ŷ𝑢𝑖 -log 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 [exp ŷ𝑢 𝑗 ](10)", "formula_coordinates": [3.0, 353.8, 405.77, 204.94, 25.82]}, {"formula_id": "formula_12", "formula_text": "L 𝑖𝑛𝑓 𝑜 = -E 𝑢 E 𝑖∼𝑝 + 𝑢 log 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) 𝑒𝑥𝑝 ( ŷ𝑢𝑖 ) + 𝑁 𝑗=1;𝑗∼𝑝 𝑢 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 ) ≥ L 𝑚𝑖𝑛𝑒 = E 𝑢 E 𝑖∼𝑝 + 𝑢 log( 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≈ E 𝑢 E 𝑖∼𝑝 + 𝑢 log 𝑁 E 𝑗∼𝑝 𝑖 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖 + log 𝑁 ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖(11)", "formula_coordinates": [3.0, 331.8, 468.86, 226.94, 97.46]}, {"formula_id": "formula_13", "formula_text": "E 𝑢 E 𝑖∼𝑝 + 𝑢 𝑁 max 𝑗=1;𝑗∼𝑝 𝑖 0, ŷ𝑢 𝑗 -ŷ𝑢𝑖 + log(𝑁 + 1) ≥ L 𝑖𝑛𝑓 𝑜 ≥ L 𝑚𝑖𝑛𝑒 = E 𝑢 E 𝑖∼𝑝 + 𝑢 log( 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 𝑁 max 𝑗=1;𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖(12)", "formula_coordinates": [3.0, 330.91, 594.69, 227.83, 75.34]}, {"formula_id": "formula_14", "formula_text": "L 𝑏𝑝𝑟 = E 𝑢 E 𝑖∼𝑝 + 𝑢 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 -log 𝜎 ( ŷ𝑢𝑖 -ŷ𝑢 𝑗 ) = E 𝑢 E 𝑖∼𝑝 + 𝑢 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 log(1 + 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 ))(13)", "formula_coordinates": [4.0, 99.65, 103.06, 194.93, 59.33]}, {"formula_id": "formula_15", "formula_text": "L 𝑖𝑛𝑓 𝑜 = E 𝑢 E 𝑖∼𝑝 + 𝑢 log(1 + 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≈ E 𝑢 E 𝑖∼𝑝 + 𝑢 log(1 + 𝑁 E 𝑗∼𝑝 𝑖 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 log(1 + 𝑁 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 log(1/𝑁 + 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) + log 𝑁 ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖 ) + log 𝑁 ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 ŷ𝑢 𝑗 -ŷ𝑢𝑖 )(14)", "formula_coordinates": [4.0, 84.34, 188.43, 210.24, 125.87]}, {"formula_id": "formula_16", "formula_text": "L 𝑏𝑝𝑟 = E 𝑢 E 𝑖∼𝑝 + 𝑢 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 log(1 + 𝑒𝑥𝑝 ( ŷ𝑢 𝑗 -ŷ𝑢𝑖 )) ≥ E 𝑢 E 𝑖∼𝑝 + 𝑢 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 𝑚𝑎𝑥 (0, ŷ𝑢 𝑗 -ŷ𝑢𝑖 ) ∝ E 𝑢 E 𝑖∼𝑝 + 𝑢 E 𝑗∼𝑝 𝑖 𝑚𝑎𝑥 (0, ŷ𝑢 𝑗 -ŷ𝑢𝑖 ) (15)", "formula_coordinates": [4.0, 85.77, 397.13, 208.81, 79.25]}, {"formula_id": "formula_17", "formula_text": "L 𝑚𝑖𝑛𝑒+ = -E 𝑢 E 𝑖∼𝑝 + 𝑢 ŷ𝑢𝑖 /𝑡 -𝜆 log 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑖 [exp( ŷ𝑢 𝑗 /𝑡](16)", "formula_coordinates": [4.0, 69.54, 634.14, 225.05, 25.82]}, {"formula_id": "formula_18", "formula_text": "𝑙 + 𝑚𝑠𝑒 ( ŷ𝑢𝑖 ) = (1 -ŷ𝑢𝑖 ) 2 𝑙 - 𝑚𝑠𝑒 ( ŷ𝑢𝑖 ) = ( ŷ𝑢𝑖 ) 2(17)", "formula_coordinates": [4.0, 404.0, 406.73, 154.74, 23.84]}, {"formula_id": "formula_19", "formula_text": "L 𝐶𝐶𝐿 = E 𝑢 ∑︁ 𝑖 ∈ I + 𝑢 (1 -ŷ𝑢𝑖 ) + 𝑤 𝑁 𝑁 ∑︁ 𝑗 ∈ I 𝑅𝑒𝐿𝑈 ( ŷ𝑢 𝑗 -𝜖)(18)", "formula_coordinates": [4.0, 344.64, 491.49, 214.1, 27.01]}, {"formula_id": "formula_20", "formula_text": "𝑙 + 𝑐𝑐𝑙 ( ŷ𝑢𝑖 ) = 1 -ŷ𝑢𝑖 𝑙 - 𝑐𝑐𝑙 ( ŷ𝑢𝑖 ) = 𝑅𝑒𝐿𝑈 ( ŷ𝑢𝑖 -𝜖)(19)", "formula_coordinates": [4.0, 397.49, 571.42, 161.25, 25.51]}, {"formula_id": "formula_21", "formula_text": "L 𝑝𝑜𝑖𝑛𝑡 = E 𝑢 𝜏 + 𝑢 E 𝑖∼𝑝 + 𝑢 𝑙 + ( ŷ𝑢𝑖 ) + 𝜆𝜏 - 𝑢 E 𝑗 ∼𝑝 - 𝑢 𝑙 -( ŷ𝑢 𝑗 )(20)", "formula_coordinates": [4.0, 356.06, 693.74, 202.62, 15.63]}, {"formula_id": "formula_22", "formula_text": "L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑝𝑜𝑖𝑛𝑡 = E 𝑢 𝜏 + 𝑢 E 𝑖∼𝑝 + 𝑢 𝑙 + ( ŷ𝑢𝑖 ) + 𝜏 - 𝑢 𝜆 • E 𝑗∼𝑝 - 𝑢 𝑙 -( ŷ𝑢𝑖 ) = E 𝑢 𝜏 + 𝑢 E 𝑖∼𝑝 + 𝑢 𝑙 + ( ŷ𝑢𝑖 ) + 𝜆 E 𝑗∼𝑝 𝑢 𝑙 -( ŷ𝑢𝑖 ) -𝜏 + 𝑢 E 𝑘∼𝑘 + 𝑢 𝑙 -( ŷ𝑢 𝑗 )(21)", "formula_coordinates": [5.0, 61.55, 203.51, 233.03, 40.84]}, {"formula_id": "formula_23", "formula_text": "L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑝𝑜𝑖𝑛𝑡 = E 𝑢 𝐸 𝑖∼𝑝 + 𝑢 𝜏 + 𝑢 𝑙 + ( ŷ𝑢𝑖 )+ 𝜆 1 𝑁 𝑁 ∑︁ 𝑗=1;𝑗∼𝑝 𝑢 𝑙 -( ŷ𝑢 𝑗 ) -𝜏 + 𝑢 1 𝑀 𝑀 ∑︁ 𝑘=1;𝑘∼𝑝 + 𝑢 𝑙 -( ŷ𝑢𝑘 )(22)", "formula_coordinates": [5.0, 85.28, 316.51, 209.3, 48.49]}, {"formula_id": "formula_24", "formula_text": "                                     L 𝐶𝐶𝐿 = E 𝑢 𝜏 + 𝑢 E 𝑖∼𝑝 + 𝑢 (1 -ŷ𝑢𝑖 ) + 𝜆𝜏 - 𝑢 E 𝑗∼𝑝 - 𝑢 [𝑅𝑒𝐿𝑈 ( ŷ𝑢 𝑗 -𝜖)] L 𝑑𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝐶𝐶𝐿 = E 𝑢 𝜏 + 𝑢 E 𝑖∼𝑝 + 𝑢 (1 -ŷ𝑢𝑖 ) +𝜆 E 𝑗∼𝑝 𝑢 [𝑅𝑒𝐿𝑈 ( ŷ𝑢 𝑗 -𝜖)] -𝜏 + 𝑢 E 𝑘∼𝑝 + 𝑢 [𝑅𝑒𝐿𝑈 ( ŷ𝑢𝑘 -𝜖)] L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑐𝑐𝑙 = E 𝑢 𝐸 𝑖∼𝑝 + 𝑢 𝜏 + 𝑢 (1 -ŷ𝑢𝑖 )+ 𝜆 1 𝑁 𝑁 𝑗=1;𝑗∼𝑝 𝑢 𝑅𝑒𝐿𝑈 ( f 𝑢 𝑗 -𝜖) -𝜏 + 𝑢 1 𝑀 𝑀 𝑘=1;𝑘∼𝑝 + 𝑢 𝑅𝑒𝐿𝑈 ( f 𝑢 𝑗 -𝜖)", "formula_coordinates": [5.0, 54.16, 437.58, 245.1, 113.95]}, {"formula_id": "formula_25", "formula_text": "L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑚𝑠𝑒 ≈ E 𝑢 𝜏 + 𝑢 | I + 𝑢 | ∑︁ 𝑖 ∈I + 𝑢 ( ŷ𝑢𝑖 -1) 2 + 𝜆 1 | I | ∑︁ 𝑡 ∈I ŷ2 𝑢𝑡 - 𝜏 + 𝑢 | I + 𝑢 | ∑︁ 𝑞 ∈I + 𝑢 ŷ2 𝑢𝑞 = ∑︁ 𝑢 1 | I | 𝑐 𝑢 ∑︁ 𝑖 ∈I + 𝑢 ( ŷ𝑢𝑖 -1) 2 where, 𝑐 𝑢 = | I | | I + 𝑢 | 𝜏 + 𝑢 + 𝜆 1 | I | ∑︁ 𝑡 ∈I ŷ2 𝑢𝑡 - 1 | I | 𝑐 𝑢 ∑︁ 𝑞 ∈I + 𝑢 ŷ2 𝑢𝑞 ∝ ∑︁ 𝑢 𝑐 𝑢 ∑︁ 𝑖 ∈I + 𝑢 ( ŷ𝑢𝑖 -1) 2 + 𝜆 ∑︁ 𝑡 ∈I ŷ2 𝑢𝑡 -𝑐 𝑢 ∑︁ 𝑞 ∈I + 𝑢 ŷ2 𝑢𝑞 = ∑︁ 𝑢 ∑︁ 𝑖 ∈I + 𝑢 [𝑐 𝑢 ( ŷ𝑢𝑖 -1) 2 -𝑐 𝑢 𝜆 ŷ2 𝑢𝑞 ] + 𝜆 ∑︁ 𝑡 ∈I ŷ2 𝑢𝑡", "formula_coordinates": [5.0, 318.59, 99.72, 239.28, 145.84]}, {"formula_id": "formula_26", "formula_text": "L 𝑖𝐴𝐿𝑆 = ∑︁ (𝑢,𝑖 ) ∈𝑆 ( ŷ (𝑢, 𝑖) -1) 2 + 𝛼 0 ∑︁ 𝑢 ∈𝑈 ∑︁ 𝑖 ∈𝐼 ŷ (𝑢, 𝑖) 2 + 𝜆 ∑︁ 𝑢 ∈𝑈 (|I + 𝑢 | + 𝛼 0 |I|) 𝜈 ||w 𝑢 || 2 + ∑︁ 𝑖 ∈𝐼 (|𝑈 + 𝑖 | + 𝛼 0 |U|) 𝜈 ||h 𝑖 || 2(23)", "formula_coordinates": [5.0, 318.13, 284.12, 241.43, 61.85]}, {"formula_id": "formula_27", "formula_text": "L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑖𝐴𝐿𝑆 = ∑︁ 𝑢 ∈𝑈 ∑︁ 𝑖 ∈I + 𝑢 [𝑐 𝑢 ( ŷ𝑢𝑖 -1) 2 -𝑐 𝑢 • 𝛼 0 • ŷ2 𝑢𝑖 ] + 𝛼 0 ∑︁ 𝑡 ∈𝐼 ŷ2 𝑢𝑡 + 𝜆 ∑︁ 𝑢 ∈𝑈 ( | I + 𝑢 | + 𝛼 0 | I | ) 𝜈 | |w 𝑢 | | 2 + ∑︁ 𝑖 ∈𝐼 ( | U + 𝑖 | + 𝛼 0 | U | ) 𝜈 | |h 𝑖 | | 2", "formula_coordinates": [5.0, 325.67, 447.2, 220.52, 49.24]}, {"formula_id": "formula_28", "formula_text": "L 𝑒𝑎𝑠𝑒 = ||𝑋 -𝑋𝑊 || 2 𝐹 + 𝜆||𝑊 || 2 𝐹 𝑠.𝑡 . 𝑑𝑖𝑎𝑔(𝑊 ) = 0", "formula_coordinates": [5.0, 380.06, 615.02, 114.24, 22.46]}, {"formula_id": "formula_29", "formula_text": "𝑃 = (𝑋 𝑇 𝑋 + 𝜆𝐼 ) -1 𝑊 * = 𝐼 -𝑃 • 𝑑𝑀𝑎𝑡 (𝑑𝑖𝑎𝑔(1 ⊘ 𝑃))(24)", "formula_coordinates": [5.0, 378.56, 657.72, 180.18, 24.97]}, {"formula_id": "formula_30", "formula_text": "L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑚𝑠𝑒 = ∑︁ 𝑢 ∑︁ 𝑖 ∈ I + 𝑢 [𝑐 𝑢 ( ŷ𝑢𝑖 -1) 2 -𝑐 𝑢 𝜆 ŷ2 𝑢𝑞 ] + 𝜆 ∑︁ 𝑡 ∈ I ŷ2 𝑢𝑡 = ∑︁ 𝑢 ∑︁ 𝑖 ∈ I + 𝑢 [𝑐 𝑢 ( ŷ𝑢𝑖 -1) 2 -𝑐 𝑢 𝜆 ŷ2 𝑢𝑖 ] + 𝜆 ∑︁ 𝑡 ∈ I + 𝑢 ŷ2 𝑢𝑡 + 𝜆 ∑︁ 𝑝 ∈ I\\I + 𝑢 ŷ2 𝑢𝑡 = ∑︁ 𝑢 ∑︁ 𝑖 ∈ I + 𝑢 [𝑐 𝑢 ( ŷ𝑢𝑖 -1) 2 + 𝑐 𝑢 ∑︁ 𝑝 ∈ I\\I + 𝑢 ŷ2 𝑢𝑡 + 𝜆(1 -𝑐 𝑢 ) ∑︁ 𝑢 ∑︁ 𝑖 ∈ I + 𝑢 ŷ2 𝑢𝑖 + (𝜆 -𝑐 𝑢 ) ∑︁ 𝑝 ∈ I\\I + 𝑢 ŷ2 𝑢𝑡 = || √︁ 𝐶 𝑢 (𝑋 -𝑋𝑊 )|| 2 𝐹 -𝜆||𝑋 ⊙ √︁ 𝐶 𝑢 -𝐼𝑋𝑊 || 2 𝐹 -||(1 -𝑋 ) ⊙ √︁ 𝐶 𝑢 -𝜆𝐼𝑋𝑊 || 2 𝐹 Note that ∑︁ 𝑢 ∑︁ 𝑖 ∈ I ŷ2 𝑢𝑖 = ||𝑋𝑊 || 2 𝐹 (25", "formula_coordinates": [6.0, 53.8, 131.44, 237.36, 189.65]}, {"formula_id": "formula_31", "formula_text": ")", "formula_coordinates": [6.0, 291.16, 304.71, 3.42, 4.09]}, {"formula_id": "formula_32", "formula_text": "L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑚𝑠𝑒 =|| √︁ 𝐶 𝑢 (𝑋 -𝑋𝑊 )|| 2 𝐹 -|| √︁ 𝐶 𝑢 -𝐼𝑋𝑊 || 2 𝐹 = ||𝑋 -𝑋𝑊 || 2 𝐹 -𝛼 ||𝑋𝑊 || 2 𝐹(26)", "formula_coordinates": [6.0, 81.53, 373.06, 213.05, 27.55]}, {"formula_id": "formula_33", "formula_text": "𝑊 = ((1 -𝜆)𝑋 𝑇 𝑋 ) -1 𝑋 𝑇 𝑋 .", "formula_coordinates": [6.0, 123.41, 434.92, 100.06, 10.43]}, {"formula_id": "formula_34", "formula_text": "L 𝐷𝑒𝑏𝑖𝑎𝑠𝑒𝑑 𝑒𝑎𝑠𝑒 = ||𝑋 -𝑋𝑊 || 2 𝐹 -𝛼 ||𝑋𝑊 || 2 𝐹 + 𝜆||𝑊 || 2 𝐹 𝑠.𝑡 . 𝑑𝑖𝑎𝑔(𝑊 ) = 0", "formula_coordinates": [6.0, 85.2, 471.9, 175.66, 22.46]}, {"formula_id": "formula_35", "formula_text": "𝑊 = 1 1 -𝛼 (𝐼 -P • 𝑑𝑀𝑎𝑡 ( ì 1 ⊘ 𝑑𝑖𝑎𝑔( P)), 𝑤ℎ𝑒𝑟𝑒 P = (𝑋 𝑇 𝑋 + 𝜆 1 -𝛼 𝐼 ) -1 (27)", "formula_coordinates": [6.0, 93.81, 540.47, 200.78, 40.06]}, {"formula_id": "formula_36", "formula_text": "4", "formula_coordinates": [6.0, 317.96, 668.55, 3.22, 8.04]}, {"formula_id": "formula_37", "formula_text": "L 𝑢 = || √ 𝑐 𝑢 (𝐻", "formula_coordinates": [12.0, 53.98, 418.9, 51.06, 14.16]}, {"formula_id": "formula_38", "formula_text": "Û ← X ⊤ X + Λ + Ω -1 X ⊤ X • dMat(1 + β) + Ω • dMat( β -γ) V V⊤ V -1 V⊤ ← Û⊤ X ⊤ X + Λ + Ω Û -1 Û⊤ X ⊤ X • dMat(1 + β) + Ω • dMat( β -γ) β ← diag X ⊤ X Û V⊤ -diag X ⊤ X + diag(Ω) ⊙ diag Û V⊤ + γ diag (X ⊤ X) + diag(Ω -Λ) γ ← γ + diag Û V⊤ - β(35)", "formula_coordinates": [13.0, 55.09, 97.82, 278.69, 99.74]}], "doi": "10.1145/1526709.1526711"}
