{"title": "2020 Vision: Towards a Sustainable OIR System Thematic Areas: Ground Based Project Space Based Project Infrastructure Activity Technological Development Activity State of the Profession Consideration", "authors": "Sally Oey; Tom Maccarone; Charles Bailyn; Jay Gallagher; J Allyn Smith; Austin Peay; Rachael Beaton; Jim Webb; Brad Barlow; Misty Bentz; Leslie Hebb; William Smith; Patrick Kelly; Jedidah Isler; Michael Meyer; John Salzer; Simone Scaringi", "pub_date": "2019-07-15", "abstract": "Open-access telescopes of all apertures are needed to operate a competitive and efficient national science program. While larger facilities contribute light-gathering power and angular resolution, smaller ones dominate for field of view, time-resolution, and especially, total available observing time, thereby enabling our entire, diversely-expert community. Smaller aperture telescopes therefore play a critical and indispensable role in advancing science. Thus, the divestment of NSF support for modest-aperture (1 -4 m) public telescopes poses a serious threat to U.S. scientific leadership, which is compounded by the unknown consequences of the shift from observations driven by individual investigators to survey-driven science. Given the much higher cost efficiency and dramatic science returns for investments in modest aperture telescopes, it is hard to justify funding only the most expensive facilities. We therefore urge the Astro2020 panel to explicitly make the case for modest aperture facilities, and to recommend enhancing this funding stream to support and grow this critical component of the OIR System. Further study is urgently needed to prioritize the numerous exciting potential capabilities of smaller facilities,and to establish sustainable, long-term planning for the System.", "sections": [{"heading": "", "text": "A fundamental sea change is taking place in the enterprise of ground-based, optical and infrared (OIR) astrophysics. Whereas in the past, observational science was propelled by individual investigators, today, observations are driven ever more by large key projects and surveys (Abt, 2017;Frogel, 2010). This shift is being driven by advances in both technology and data science. It is further accelerated by NSF's withdrawal of support for the individual investigator (\"PI science\") mode of allocating observing time. NOAO has been forced to end general-purpose, public access to most of its own facilities, i.e., the Mayall and Blanco 4-m telescopes and smaller apertures. These two flagship facilities, together with WIYN, are now dominated by the DESI Survey, Dark Energy Survey, and NN-EXPLORE respectively -exciting projects, but ones that originate from the priorities set by other agencies, namely DOE and NASA. These projects have enabled the telescopes to survive and gain vitally important instruments, but at the cost of NSF subordinating some control over its own facilities. There is a risk that NSF is on a path that compromises its mission to promote basic research through community peer review, a process that is the foundation of our phenomenal success and international leadership in scientific discovery. And it severely limits community access to observing facilities.\nTo our knowledge, there has been no community study on the consequences of this shift to survey science at the cost of PI science. However, several science-driven, strategic plans have stressed the importance of maintaining balanced support for broad community access to modest apertures (see Section 2). Since circumstances are forcing us in the opposite direction, this may mean risking the optimization of the US science program at a time when astrophysics in Europe and Asia is ascendant. Unintended consequences pose another serious risk. In particular, NSF is seriously considering a significant investment in the 30-m class, extremely large telescopes (ELTs). While public access to these facilities will be an essential boost for the OIR community, the available per capita observing time on them will be extremely low, and mainly dedicated to key projects instead of PI science. This underscores the fact that public time on the ELTs is not equivalent, nor a substitute for, the public time that NOAO has historically provided. A comprehensive study is therefore urgently needed to formulate the best strategy for optimizing science productivity in the new, survey-driven era.", "publication_ref": ["b0", "b12"], "figure_ref": [], "table_ref": []}, {"heading": "Modest-aperture telescopes drive discovery", "text": "Apertures of all sizes are needed to operate a productive and efficient national science program. Telescope discovery space is parameterized by light-gathering power, angular resolution, time resolution, field of view, and available observing time. The first two are dominated by larger apertures, and the latter three by smaller apertures. Moreover, a critical driver of discovery is human brain power, which is primarily linked to the last parameter, available observing time. Maximizing community access is necessary to maximize science. Combined, these factors cause smaller facilities to dominate raw science productivity. This is well documented in a variety of sources, including a compendium of discussions from community meetings on small telescopes about two decades ago (Oswalt, 2003), including a Lowell Workshop in 1996 and an AAS special session leading up to the 2000 Decadal Survey. At that time, community concern centered on the closing of NOAO telescopes smaller than 4-m Figure 1 shows publication metrics for general-purpose telescopes from Trimble & Ceja (2010). We see that for large apertures (> 8 m), the metrics shown are around twice the values for smaller telescopes, but this relatively modest enhancement by no means causes the large-class facilities to exceed the total productivity of small telescopes. This confirms trends identified earlier by Abt (2003). More recently, Crabtree (2016) ranks telescope facilities by number of papers per telescope published during 2010 -2014. There are 18 OIR facilities in this evaluation, and exactly half of these have apertures above 5 m, and half below. The top 10 ranking is shown in Figure 2. Again we see the larger and smaller apertures contributing exactly equally to the top 10. This trend is maintained among the top four. Moreover, the top-ranked facility is UKIRT, a 3.8-m telescope. The same trend is seen for the period 2012 -2016 (Figure 2; Crabtree, 2018). Thus all apertures contribute equally at all rankings. This analysis does not include specialized facilities of modest aperture, which are even more productive, e.g., SDSS (2.5m) has over 15,000 citations to date on its data release papers, and the 2MASS All-Sky-Release (1.3-m; Skrutskie et al., 2006) has over 6,000 citations.\nThus, small and mid-aperture telescopes have greater total productivity by these metrics. Factoring in their cost-effectiveness dramatically compounds this effect. Figure 1 suggests that the citation rate is roughly linear with aperture. Weaver (2003), therefore finds that, for telescope construction cost scaling roughly as aperture A 2.5 , the dollar cost per citation scales as A 1.5 . This relation applies whether or not operations costs are included; science on an 8-m costs almost 3× as much as on a 4-m, and 8× as much on a 2-m. Thus, while proponents of large  (Crabtree, 2016) and 2012-2016(Crabtree, 2018). telescopes argue that these facilities generate more important science, the citation rates suggest that nevertheless, we see a steep diminishing return on investment with larger apertures.\nSimply put, modest aperture telescopes collectively have been more productive and cost-effective than large-class facilities. There is an unfortunate misperception that \"small telescopes produce small science.\" Yet, some of the most important discoveries of our time were made with modest apertures: the first exoplanet, 51 Pegasi (Haute Provence 1.9-m; Mayor & Queloz, 1995); MACHOs as a 20% component of dark matter (Mt. Stromlo 1.3-m;Alcock et al., 2000); and the existence of dark energy (CTIO 1.5-m and 4-m, among others; Riess et al., 1998). More recently, the electromagnetic counterpart of the first gravitational wave detection was initially identified with a 0.83-m telescope at CTIO (Díaz et al., 2017). We need only look to current exoplanet searches, supernova transient projects, asteroseismology studies, and solar system planetesimal surveys to see the on-going, essential contribution of smaller telescopes. In their Astro2020 white paper, Najita et al. (2019) compare the respective productivity of small and large telescopes as \"growth stocks\" versus \"value stocks.\" This is an apt analogy, underscoring the fact that smaller telescopes are the ones that truly drive the entire scientific enterprise, while large facilities provide fundamental quantum advances in opening critical discovery space. Another relevant analogy is to note that desktop computers are needed as much as high-performance computing; different scale technologies simply play different but complementary roles. Both need support.", "publication_ref": ["b18", "b0", "b6", "b7", "b23", "b26", "b6", "b6", "b7", "b15", "b1", "b22", "b8", "b17"], "figure_ref": ["fig_0", "fig_1", "fig_1", "fig_0"], "table_ref": []}, {"heading": "The Ground-Based OIR System", "text": "Conceptualizing the public, ground-based, OIR telescopes as \"The System\" grew from before the 2000 decadal review (AANM; McKee, C. F. & Taylor, J. H., 2001) and was established by a series of System Workshops that took place between AANM and the 2006 NSF Senior Review (Blandford et al., 2006). Based on comprehensive community consultation, the Senior Review strongly endorsed support for modest-size telescopes: \"Instead of further divestiture of the CTIO and KPNO telescopes,... [the Senior Review] recommends that NOAO should acknowledge a responsibility to lead the utilization of small and mid-sized telescopes in the public sector to address the new and emerging opportunities...\" This guidance was based on three arguments: 1. The synergy between large and small aperture facilities, anticipating an increased role for smaller facilities due to, e.g., time domain science; 2. More than half of US astronomers and their students do not have access to private facilities; 3. Smaller telescopes provide critical test beds for new technology. Recommendation 2 of the Senior Review was: \"The OIR Base program should be led by NOAO. It should deliver community access to an optimized suite of high-performance telescopes of all apertures through Gemini time allocation, management of TSIP and operation of existing or possibly new telescopes at CTIO in the south and KPNO or elsewhere in the north.\"\nPursuant to the Senior Review, NOAO constituted two committees, Renewing Small Telescopes for Astronomical Research (ReSTAR), and Access to Large Telescopes for Astronomical Instruction and Research (ALTAIR) to recommend strategic plans for modest and large facilities, respectively. ReSTAR emphatically stressed the need for comprehensive public access to small and mid-aperture telescopes, again emphasizing that modest-and large-scale facilities play fully complementary roles in astrophysical discovery. The report echoed findings from AANM that the new era of survey science would increase the demand for modest apertures, and that the available public access was many times less than contemporary community requires. ReSTAR thus envisioned the System as a network of telescopes coordinated by NOAO, recommending a doubling in the number of public 2 -4-m telescopes (Pilachowski et al., 2008). ReSTAR also recommended extending the Telescope System Instrumentation Program (TSIP) to mid-scale telescopes. This program, originally proposed by AANM, did become a backbone of the System, providing substantial amounts of public access to a variety of facilities until the program was discontinued after 2012.\nThe 2010 decadal review (Astro2010; Blandford et al., 2010) acknowledged community open access to telescopes \"with apertures up to 8 meters\" as a \"critical need.\" However, one of their Conclusions was that NSF's funding allocations needed to be rebalanced between NOAO's telescopes, existing partnerships, and future facilities, such that the last should benefit. The report also suggested that NOAO's mid-aperture telescopes would become less relevant in the ELT era, an argument that the report did not substantiate and with which we disagree (e.g., Pilachowski et al., 2008). This led Astro2010 to suggest that NSF reevaluate NOAO's role in the community.\nRevised budget realities led to the 2012 NSF-AST Portfolio Review (PRC), which seized upon these sentiments and led to the recent NSF divestment from public access to the KPNO 2.1-m, WIYN, and Mayall telescopes (Recommendation 10.6; Eisenstein et al., 2012). The panel was charged with an extraordinarily difficult task of making hard choices to slash expenditures and programs; however, there was little quantitative discussion of comprehensive productivity metrics in the context of the multi-aperture OIR System. In particular, there was little discussion about balancing current productivity against future needs, and there was an explicit shift such that the recommendations \"reduce the quantity of time available via open access to moderate/small OIR telescopes, but the portfolio aims to increase the value of each night, by raising the average aperture, site quality, and instrumentation quality of AST-funded OIR observations...\". The PRC therefore made the decision to disenfranchise half of the astronomical community who only have access to telescope facilities via the public system. NOAO's System Roadmap Committee issued a strong Statement (Soifer et al., 2012) expressing concern about these issues. With NSF's assets significantly reduced, the NRC commissioned a new study to develop a repositioning strategy for the OIR System led by Debra Elmegreen (\"Elmegreen Report\"; Elmegreen et al., 2015). The panel carried out a new, quantitative inventory of the public OIR System in the context of the historical strategic plans. They revalidated the fundamental need to support all apertures. Their Recommendation 1 attempted to recover public access by charging NOAO to oversee a program for observatories to exchange telescope time and instruments, while managing a central TAC process. Recommendation 2 was for NOAO to constitute a System organizing committee to maintain an ongoing, community-wide planning process. At the time of the PRC in 2012, NOAO offered on the order of 600 nights per semester on 2 -6-m telescopes (Soifer et al., 2012). The 2019B Call for Proposals offers only 131 nights in this aperture class, a drastic reduction. An additional 135 nights are offered on 8-m class telescopes, and ∼200 nights are available on 1 -2-m telescopes via SMARTS and Las Cumbres Observatory.", "publication_ref": ["b16", "b4", "b19", "b4", "b19", "b10", "b24", "b11", "b24"], "figure_ref": [], "table_ref": []}, {"heading": "The Ground-based OIR Future", "text": "Recommendations 1 and 2 from the Elmegreen Report remain to be effectively implemented. As stressed above in Section 1, by far the most cost efficient way to maximize scientific productivity is to invest in publicly accessible, modest aperture telescopes. As outlined above, this is driven by several factors: 1. Large telescopes alone are greatly restricted in multi-parameter discovery space; 2. Public access enables the entire community. 3. Modest facilities and their instrumentation are 1 -2 orders of magnitude cheaper to build and operate than large ones. Training of students (e.g., white paper by Whelan et al., 2019) and technical personnel, as well as hosting technology trials are additional critical roles with broad, long-term consequences that are extensively called out in previous studies.\nThese points have been demonstrated and stressed in several strategic planning papers over the last 20 years as documented in Section 2, based on a variety of studies and comprehensive community input. We simply cannot afford to ignore the critical role of modest-aperture facilities if we are to maintain the health of our field and remain internationally competitive.\nWe therefore urge the Astro2020 panel to explicitly make the case for modest aperture facilities, and to recommend an enhancement of this funding stream to support and grow this critical component of the OIR System. As stressed above, a small budget, perhaps on the order of $10M / year, would yield outstanding return on investment. The immediate goal should be to more aggressively carry out recommendations from the Elmegreen Report, especially Recommendations 1 and 2, to expand public access to modest apertures as rapidly as possible. The OIR System also needs sustainable, long-term strategic plans, along with guidance to NSF for different budget scenarios.\nFurther study is needed to evaluate the community's most urgent needs and what the most effective solutions are, now that public time on mid-size apertures is relatively unavailable. Based on a rough estimate of $180k yr -1 m -2 for operations costs on existing modest-aperture facilities, $10M / yr could support a total of two 4-m, four 2-m, and eight 1-m telescopes, which could include allowance for instrument and facilities development and student training programs. This calculation is merely illustrative; in the Appendix, we list a variety of needed capabilities in the context of the currently available System. It will be important to study the balance between long-term and smaller projects, as there will be enormous demand for both in the wake of facility-scale surveys. Which capabilities are deemed essential should be determined deliberately in close consultation with the community of users.\nCutting-edge technology on smaller facilities is often a fraction of the cost on larger telescopes, but can dramatically improve system performance, thus effectively increasing the aperture. Upgrading detector and throughput efficiency yield a drastic increase in signal-to-noise. Image improvement technology has a similar effect, perhaps including adaptive optics (AO) on mid-size telescopes (e.g., Robo-AO, now on UH 2.2-m; Riddle et al., 2015). Improvements in observing efficiency likewise can yield substantial gains in observing time, for example, rapid slew capability and more efficient target and guide star acquisition. Furthermore, as read noise drops below sky background levels, imaging data from arrays of small telescopes can be combined without loss of sensitivity (e.g., as in the BlackGEM project; Bloemen et al., 2015), and photonic linking devices are beginning to enable the same for spectroscopy (see white paper by Eikenberry et al., 2019). Such facilities can be designed with operational flexibility so that, for example, a telescope array with a total aperture equivalent to a 4-m could also function as 16 individual 1-m telescopes.\nForming university consortia to assume operations of existing telescopes is a proven model for preserving existing facilities. Successful examples include the Small and Moderate Aperture Research Telescope System (SMARTS) at CTIO, and the Southeastern Association for Research in Astronomy (SARA). The latter assumed operations of a 1-m telescope at KPNO beginning in 1995 and refurbished it to be remotely accessible (Keel et al., 2017). The healthy, 15-institution consortium now operates three remote-access telescopes at KPNO, CTIO and La Palma that serve about 200 users per year at an operational cost of less than $200 per night. New facilities can also be built in partnership with the national observatories, as in the case of the 3.5-m WIYN at KPNO. SMARTS, in operation since 2003, is supported more by a mix of individual PIs, institutions, and NASA funds. The consortium is being forced to scale back operations by closing public access to two (1.0-m and 1.3-m) of their four telescopes. Anecdotal reports indicate that NSF grant review panels are increasingly reluctant to fund support for small telescopes, which makes cost-sharing models difficult for small institutions. Travel support for observing is also a perennial issue for investigators at smaller institutions, and could be alleviated by considering institutional or group grants. Alternatively, incentivizing and supporting queue, service, and robotic observing may prove feasible in some models. Consortium sustainability depends on a variety of factors, including operations budget, funding sources, number of nights per member, existence of long-term projects, and availability of contingency funds. A review of funding should examine all the relevant factors, including the role of PI funding for observing support.\nAs stressed in Section 2, small-scale funding on modest-aperture facilities yields dramatic science returns. It is therefore hard to justify funding only the most expensive facilities. NOAO has already made good efforts to develop time exchanges. Limited public access is currently available this semester (2019B) on Subaru and AAT (3 and 5 nights, respectively). LBT is offering 8 nights through the discontinued TSIP program. Through MSIP, Las Cumbres and the CHARA interferometer are offering on the order of 144 and 30 nights, respectively. These efforts are commendable, but there is a great need to grow access, especially in the 2 -4-m class. For example, NOAO (soon NCOAfoot_0 ) could help coordinate and solicit submissions to the MSIP program to ensure that modest apertures continue to participate. The enormous success of TSIP was due to the two-fold benefit of updating instrumentation on smaller telescopes, which is critical for their competitiveness; and providing community access in exchange for funding. More focused advocacy and coordination could generate more buy-in from private observatories, motivating them to upgrade via MSIP.\nSystem coordination could also provide support for observatories to improve their operations and greatly promote observing efficiency. For example, this could include development of standard observing templates for a variety of applications, as pioneered at, e.g., UKIRT and YALO (the predecessor to SMARTS). These enable service observing by less experienced observers, alleviating the need for hiring dedicated service observers. Some observatories also may have the means, but lack the FTE to develop queue observing systems, and could use System coordinated help. Even fairly basic needs like installing software to identify guide stars can be facilitated and encouraged. If appropriate, certain strategies and technologies may be prioritized or incentivized through system coordination. For example, telescopes equipped with only a single instrument drastically reduce operations and maintenance costs, and lend themselves to remote and/or robotic operation. As small telescope arrays become more established, it may even be desirable to consider working toward standard telescope control systems, which would greatly facilitate observing efficiencies by users and implementation of robotic systems and remote observing.\nEncouragingly, the creation of NCOA and its organizational structure appropriately positions Mid-Scale Observatories as an equal partner to LSST, Gemini, and the Community Science and Data Center. This will enable the much-needed, dedicated attention and advocacy for this System component. We strongly urge that the Astro2020 report explicitly stress the critical need to commit the modest funding line needed to grow support for the smaller-scale facilities over the next decade. These have supported the bulk of the community, and are therefore the heart of PI-driven science. It is sobering to note that in some cases (e.g., SMARTS), scientists are supporting facilities by writing personal checks. We also recommend a community study to prioritize funding needs for modest aperture telescopes and develop a sustainable, long-term strategic plan for the OIR System. Such a study should include clarifying the required level of investment relative to other NSF priorities. The Elmegreen Report Recommendation 2 to provide on-going, science-driven planning could then be established from this starting point.\nTo paraphrase the 2006 Senior Review (Blandford et al., 2006), innovative ideas, advanced technology and clever data handling can be more important than simply increasing collecting area. Like the mass functions of stars and galaxies, although the smaller objects are less luminous, they dominate the mass of the entire system. We ignore them at our peril.", "publication_ref": ["b27", "b21", "b5", "b9", "b14", "b4"], "figure_ref": [], "table_ref": []}, {"heading": "Appendix: Specific Needs for Observational Capabilities", "text": "Adequately supporting modest aperture telescopes requires maintaining and upgrading their technology and instrumentation. Modest-aperture telescopes will be in enormous demand for follow-up observations in both survey mode and smaller projects. The ReSTAR Report therefore recommended a range of capabilities on small and mid-aperture telescopes in both hemispheres (Pilachowski et al., 2008), especially low and high-resolution spectroscopy, and optical and IR imaging. Here we outline some anticipated needs for observational capabilities based on typical science drivers, relative to the current ground-based, public OIR System. This description is meant to be more illustrative than exhaustive. Future study is needed to explore and prioritize a more complete range of capabilities and determine a recommended funding level relative to other NSF priorities.\nImaging: In the era of LSST, ZTF and PanSTARRS, the role of small-to-medium telescopes in imaging projects will evolve. Single-epoch projects may be dominated by emission-line imaging; and by infrared surveys deeper than provided by 2MASS, and in regions not covered by the initial set of VISTA surveys. Additionally, there will be demand for imaging at high angular resolution, both for fainter objects that require AO, and for bright objects that require interferometry. At the present time, the national System has a good set of wide-field, optical imagers on a broad range of telescope apertures, but the filter set is insufficient. There is also no wide-field (> 20 × 20 ) infrared imaging and relatively little high time-resolution instrumentation, nor instruments that can simultaneously observe in multiple filters. The System currently has reasonably good capabilities for rapid response on small telescopes through Las Cumbres, but lacks the fastest slewing, robotic telescopes that are needed for prompt follow-up of transients. Spectroscopy: While SDSS-V will dramatically expand the database of spectra, LSST will create a new need for mass-scale spectroscopy. Brighter targets generated by LSST will be spread over the sky in a manner that is not conducive to multi-object spectroscopy, meaning that many smaller telescopes will be needed to follow them up. Time-domain spectroscopy is also needed for targets of opportunity triggered from other wavelength ranges. Furthermore, a broad range of parameter space, including sky coverage, will be left uncovered. For example, no mass-scale infrared spectroscopic surveys are currently planned. Even today, the current System would be greatly enhanced by offering queue-scheduled, moderate-resolution spectroscopy on a 2 -4-m class telescope for, e.g., supernova and GRB follow-ups and AGN reverberation mapping. Modernizing spectrograph efficiencies would be especially productive, as demonstrated by the performance of the CHIRON echelle on the SMARTS 1.5-m and Goodman spectrograph on SOAR.\nTime-domain: Time-domain astronomy is generally less compatible with classical observing. We note that NOAO's oversubscription rates have been higher on the queue scheduled telescopes and robotic telescopes than for classical observing. This is at least partly because these telescopes enable monitoring campaigns. As time domain astronomy grows in scope, these types of programs are likely to become more important. LSST will be limited in cadence, filters, and northern sky coverage. For example, infrared monitoring applications (e.g., variable sources in star forming regions) will remain. Additionally, there will be need for high-cadence monitoring (e.g., searches for orbital periods of short-period binaries); and long, uninterrupted monitoring to sample variability timescales (e.g., accretion variability and white dwarf pulsations). As an example, the Whole Earth Blazar Telescope, a global network of small telescopes, achieved a continuous 72-hour light curve of a highly variable blazar, 0716+71, with 1-minute time resolution (Bhatta et al., 2013). Long-term, multi-year monitoring programs greatly benefit from access to consistent instrumentation, as shown by, e.g., studies of the nearest red, brown and white dwarfs (Henry et al., 2018), novae (Walter et al., 2012), and X-ray binaries (Buxton et al., 2012). Such applications are well suited to small-and medium-sized telescopes, and cannot be done by LSST. The availability of substantial amounts of time on the Las Cumbres network is an excellent step; however, public access will expire in 2020 and it represents only a fraction of what will be needed in the LSST era.\nRapid response to targets of opportunity (TOOs) requires a broad range of instrument capabilities available at all times (e.g., OIR counterparts of gamma-ray bursts). This can be done by having many telescopes running in parallel, each with different instruments; or with individual telescopes having either versatile, multi-mode instruments or rapid instrument changing capability, as can be done with instruments mounted at Nasmyth ports. It is also important to have the ability to schedule TOO programs on very short notice. NOAO's ANTARES event broker and AEON observing system for LSST transient follow-ups are welcome examples of this essential infrastructure development. We note that the robust TOO program of NASA's Swift mission, which is predominantly scheduled \"on the fly\" rather than by panels, is widely regarded as one of its core strengths.\nOther capabilities: Other observing modes are also worth considering, such as polarimetry and speckle imaging. Polarimetry, in particular, represents a relatively unexploited frontier for electromagnetic information and hence has excellent growth potential. It is perhaps well suited to mid-size aperture telescopes, since the required photon fluxes are fairly high, while demand is currently low on larger facilities. However, polarimetry can done on smaller apertures for a variety of science applications, as demonstrated by Bailey et al. (2017, on a 0.35-m!) and Ramaprakash et al. (2019, on a robotic 1.5-m). Furthermore, there are important scientific areas in which small telescopes can outperform large ones. For example, slew speeds for small telescopes can be dramatically faster. This is important for fast acquisition of transient phenomena like gamma-ray bursts, shock breakouts, and gravitational wave merger events; and also for efficiency in observing large samples of brighter objects. In addition, many classes of variability studies (e.g., light curves of accreting objects, or stellar pulsations of stars) require time resolution on the order of seconds or shorter, which can be difficult or impossible for brighter objects on large telescopes. A variety of other observing capabilities should also be examined.", "publication_ref": ["b19", "b3", "b13", "b25"], "figure_ref": [], "table_ref": []}], "references": [{"ref_id": "b0", "title": "The Future of Small Telescopes In The New Millennium. Volume I -Perceptions, Productivities, and Policies", "journal": "PASP", "year": "2003", "authors": "H A Abt"}, {"ref_id": "b1", "title": "", "journal": "ApJ", "year": "2000", "authors": "C Alcock; R A Allsman; D R Alves"}, {"ref_id": "b2", "title": "", "journal": "MNRAS", "year": "2017", "authors": "J Bailey; D V Cotton; L Kedziora-Chudczer"}, {"ref_id": "b3", "title": "", "journal": "A&A", "year": "2013", "authors": "G Bhatta; J R Webb; H Hollingsworth"}, {"ref_id": "b4", "title": "From the Ground Up: Balancing the NSF Astronomy Program", "journal": "The National Academies Press", "year": "2006", "authors": "R D Blandford"}, {"ref_id": "b5", "title": "", "journal": "AJ", "year": "2012", "authors": "S Bloemen; P Groot; G Nelemans; M Klein-Wolt"}, {"ref_id": "b6", "title": "SPIE Conf. Ser", "journal": "", "year": "2016", "authors": "D R Crabtree"}, {"ref_id": "b7", "title": "", "journal": "", "year": "2018", "authors": "D R Crabtree"}, {"ref_id": "b8", "title": "", "journal": "ApJ", "year": "2017", "authors": "M C Díaz; L M Macri; D Garcia Lambas"}, {"ref_id": "b9", "title": "Astro2020 white paper", "journal": "", "year": "2019", "authors": "S Eikenberry; A Gonzalez; J Darling"}, {"ref_id": "b10", "title": "Advancing Astronomy in the Coming Decade: Opportunities and Challenges", "journal": "", "year": "2012", "authors": "D Eisenstein"}, {"ref_id": "b11", "title": "Optimizing the U.S. Ground-Based Optical and Infrared Astronomy System", "journal": "The National Academies Press", "year": "2015", "authors": "D M Elmegreen"}, {"ref_id": "b12", "title": "", "journal": "PASP", "year": "2010", "authors": "J A Frogel"}, {"ref_id": "b13", "title": "", "journal": "AJ", "year": "2018", "authors": "T J Henry; W.-C Jao; J G Winters"}, {"ref_id": "b14", "title": "", "journal": "PASP", "year": "2017", "authors": "W C Keel; T Oswalt; P Mack"}, {"ref_id": "b15", "title": "", "journal": "Nature", "year": "1995", "authors": "M Mayor; D Queloz"}, {"ref_id": "b16", "title": "Astronomy and Astrophysics in the New Millennium", "journal": "The National Academies Press", "year": "2001", "authors": "C F Mckee; J H Taylor"}, {"ref_id": "b17", "title": "Astro2020 white paper", "journal": "", "year": "2019", "authors": "J R Najita"}, {"ref_id": "b18", "title": "The Future of Small Telescopes In The New Millennium. Volume I -Perceptions, Productivities, and Policies", "journal": "Kluwer, Astrophys. & Space Sci. Library", "year": "2003", "authors": "T D Oswalt"}, {"ref_id": "b19", "title": "Renewing Small Telescopes for Astronomical Research", "journal": "", "year": "2008", "authors": "C Pilachowski"}, {"ref_id": "b20", "title": "", "journal": "MNRAS", "year": "2019", "authors": "A N Ramaprakash; C V Rajarshi; H K Das"}, {"ref_id": "b21", "title": "", "journal": "ApJ", "year": "2015", "authors": "R L Riddle; A Tokovinin; B D Mason"}, {"ref_id": "b22", "title": "", "journal": "AJ", "year": "1998", "authors": "A G Riess; A V Filippenko; P Challis"}, {"ref_id": "b23", "title": "", "journal": "AJ", "year": "2006", "authors": "M F Skrutskie; R M Cutri; R Stiening"}, {"ref_id": "b24", "title": "System Roadmap Committee Statement on the NSF Portfolio Review Committee Report and the Response", "journal": "", "year": "2010", "authors": "T Soifer"}, {"ref_id": "b25", "title": "", "journal": "PASP", "year": "2012", "authors": "F M Walter; A Battisti; S E Towers; H E Bond; G S Stringfellow"}, {"ref_id": "b26", "title": "The Future of Small Telescopes The New Millennium. Volume I -Perceptions, Productivities, and Policies", "journal": "Kluwer", "year": "2003", "authors": "B Weaver"}, {"ref_id": "b27", "title": "", "journal": "Astro", "year": "2019", "authors": "D G Whelan"}], "figures": [{"figure_label": "1", "figure_type": "figure", "figure_id": "fig_0", "figure_caption": "Figure 1 :1Figure 1: Total number of papers, citations, and citations per paper (C/P) for publications in 2008 compiled by Trimble & Ceja (2010) for general-purpose telescopes. Data for VLT, Keck, Gemini, LBT, and Magellan are divided by the number of telescopes hosted by these facilities. We exclude data where metrics for different aperture telescopes are consolidated for an entire observatory.", "figure_data": ""}, {"figure_label": "2", "figure_type": "figure", "figure_id": "fig_1", "figure_caption": "Figure 2 :2Figure 2: Ranking of general-purpose, OIR telescopes by numbers of papers published during 2010 -2014 (Crabtree, 2016) and 2012 -2016 (Crabtree, 2018).", "figure_data": ""}], "formulas": [], "doi": "10.17226/12951"}
