{"title": "CNOT gate on reverse photon modes in ring cavity", "authors": "Sergey N Andrianov; Narkis M Arslanov; Konstantin I Gerasimov; Alexander A Kalinkin; Sergey A Moiseev", "pub_date": "2019-01-14", "abstract": "Photon modes of reverse rotation in ring QED-cavity coupled with single atom are considered. By applying Schrieffer-Wolf transformation for the off-resonant light-atom interaction, an effective Hamiltonian of the evolution of the photon modes is obtained. Heisenberg equations for the input-output photon mode operators are written and expression for the system wave function is found. The obtained analytical solution shows the condition of the control not quantum gate implementation. Possible on a chip experimental implementation and recommendations for the construction of optical quantum computer using this gate are considered.", "sections": [{"heading": "Introduction", "text": "Photonic two-qubit gates are important instruments for quantum processing, optical quantum communication etc. However its effective experimental realization remains a quite difficult problem. Since the photons do not interact with each other in free space, the photonic two qubit gate are realized in probabilistic way using linear optical elements [1]. It is possible to enhance the photon photon interaction in nonlinear media. In particular, the authors of paper [2] have proposed using additional nonlinear two-photon frequency up and down conversion elements. This nonlinear interaction is also rather weak but can be considerably enhanced in micro-and nano-cavities due to the Purcell effect. Moreover, this indirect interaction can be replaced by the resonant interaction of photons with atoms. Therefore, the theme of construction photon-photon two-qubit gates using cavities containing atoms is a subject of intensive investigation.\nCPhase photon-photon gate using the interaction of polarization encoded photon qubits with a cavity containing three-level atom was presented in paper [3]. CPhase gate on nitrogen vacancy center in this configuration was considered in papers [4,5]. Three qubit control SWAP (Toffoli) gate was proposed in paper [6]. Deterministic photon-photon √ SW AP gate using a Λ-type atomcavity system with polarization encoding of qubits was theoretically proposed in paper [7]. Also, CPhase photon-photon gate in this approach was proposed in paper [8]. CNOT gates were proposed for photon qubit interacting with cavity containing atom [9], quantum dot [10,11], diamond nitrogen-vacancy centers [12] and collective magnon system [13]. Recently, the realization of original scheme [3] was successfully demonstrated in experiment [14]. Experimental realization of SWAP gate using nanofiber-coupled microsphere resonator coupled to single Rb atom was presented in paper [15]. CNOT gate on quantum dot in photonic crystal cavity strongly coupled to polarization encoded photon qubits was demonstrated in paper [16].\nThus, large number of theoretical and experimental works concerning photonphoton cavity based quantum gates has been performed, although the quantum efficiency and fidelity of the two-qubit gates remain insufficient high [14], which requires further searching for new ways to improve practical realization of twophoton gates. Besides, aforementioned approaches used polarization encoding of photon qubits and it is interesting to study the possibility to use other encodings. Here, we propose using the dispersion interaction of light modes with the atom in order to suppress influence of atomic decoherence processes. Moreover, here we propose photon-photon CNOT gate using encoding of qubits on contrary directed photon modes of propagation in ring cavity with controlling two-level atom and consider the on a chip scheme for its experimental implementation.\nFig. 1 On a chip scheme for photon-photon CNOT gate scheme; reverse whispering-gallery modes of optical cavity interacts with two-level atom with effective coupling constant µ and with each other with coupling constant η by scattering in Bragg-grating situated closely to the cavity surface.", "publication_ref": ["b0", "b1", "b2", "b3", "b4", "b5", "b6", "b7", "b8", "b9", "b10", "b11", "b12", "b2", "b13", "b14", "b15", "b13"], "figure_ref": [], "table_ref": []}, {"heading": "Schrieffer-Wolf transformation and effective Hamiltonian", "text": "The analyzed scheme is depicted in Fig. 1 where resonant atom is placed in the ring cavity connected via waveguide with multi-qubit quantum memory cell. The ring cavity supplies two counter propagating light modes coupled with each other due to scattering on the tuned Bragg-grating. We assume that the atom interacts with two photons oppositely rotating in the ring cavity. The total Hamiltonian of studying system is written as follows H = H 0 + H 1 , where H 0 = H a + H r is main Hamiltonian and\nH 1 = H (cw) r-a + H (ccw) r-a\nis perturbation Hamiltonian. In this scheme, we focus to considering only a two-level atom, but the obtained results can be also applied to the case of a three-level atom, where the specific features and advantages arising from this will be briefly discussed below. Main Hamiltonian (in units h) consists of atomic Hamiltonian H a = ω 0 S z , where ω 0 is frequency of atomic transition in two-level model, S z is operator of effective spin z-component (i.e. we ignore decoherent processes in the atomic dynamics), and radiation Hamiltonian H r = ω cw a † cw a cw + ω ccw a † ccw a ccw + η(a † cw a ccw + a † ccw a cw ), where ω cw and ω ccw are frequencies of clockwise and counterclockwise photons in ring cavity, a + cw(ccw) and a cw(ccw) are creation and annihilation operators for clockwise (counterclockwise) photon, η is clockwise-counterclockwise photons interaction constant. The coupling of the counterpropagating modes can be realized by forming Bragg-grating with parameters (period and amplitude) determining appropriate value λ.\nPerturbation Hamiltonian includes atomic interaction with clockwise and counterclockwise photons H\n(cw) r-a = gS + a cw +g * S -a † cw and similarly H (ccw)\nr-a = gS + a ccw + g * S -a † ccw , where S + and S -are raising and lowering operators in two-level model, g is interaction constant. Below we consider off-resonant interaction between light modes and two-level atom by assuming some detuning ∆ of the atomic frequency ω 0 from the cavity mode frequency ω ccw . In this case we get dispersion light-atom interaction where atomic decoherent processes are suppressed by the factor g ∆ 1 [16]. Performing Shrieffer-Wolf transformation [17] e s for this case, we get for effective Hamiltonian\nH s = H 0 + 1 2 [H 1 , s] providing H 1 + [H 0 ,\ns] = 0 that gives the following formula for transformation operator:\ns = α (cw) gS + a cw + β (cw) g * S -a † cw + α (ccw) gS + a ccw + β (ccw) g * S -a † ccw ,(1)\nwhere\n∆ = ω 0 -ω cw , α (cw) = -β (cw) = -1 ∆-η , α (ccw) = -β (ccw) = -1 ∆-η\nand it is assumed β (ccw) g 1, β (cw) g 1 and ∆ determines dispersive interaction of light with atom, is a decay constant of the atomic coherence,\nω cw = ω ccw = ω r , β (cw) = β (ccw) = β.\nBy using (1) we get the effective Hamiltonian:\nH s = ω cw a † cw a cw + ω ccw a † ccw a ccw + η a † cw a ccw + a † ccw a cw + ω 0 + 2β|g| 2 S z +µS z a † cw a cw + a † ccw a ccw + a cw a † ccw + a † cw a ccw ,\nwhere the coupling between the cavity modes is controlled by the atomic state via µS z (where\nµ = 2β|g| 2 = 2|g| 2 /( ∆ -η)) with S z = ±1/2.\nBelow we analyze the dynamics of the field modes.", "publication_ref": ["b15", "b16"], "figure_ref": [], "table_ref": []}, {"heading": "System dynamics and CNOT gate", "text": "Now, accounting coupling of cavity with an external waveguide and using the well-known approach of quantum optics [15], we obtain two coupled equations:\nd dt a cw = -iω cw + κ 2 a cw -i {η + µS z } a ccw + √ κ a in,1 (t) ,(2)\nd dt a ccw = -i(ω ccw + κ 2 )a ccw -i{η + µS z }a cw + √ κ a in,2 (t),(3)\nwhere κ is coupling constant of the cavity mode with free modes, a in, (1,2) is the input field of m-cavity mode launched from the quantum memory cell (see Fig. 1). Linear equations for field operators a cw (t) and a ccw (t) are easily solved for its Fourier components and yield for two states of atom (m = ±1/2):\na cw (ω) = -i{η + µm} √ κ a in,2 (ω) + κ 2 -i (ω -ω ccw ) √ κ a in,1 (ω) (η + µm) 2 + κ 2 -i (ω -ω cw ) κ 2 -i (ω -ω ccw ) ,(4)\na ccw (ω) = -i {η + µm} √ κ a in,1 (ω) + κ 2 -i (ω -ω cw ) √ κ a in,2 (ω) (η + µm) 2 + κ 2 -i (ω -ω cw ) κ 2 -i (ω -ω ccw ) .(5)\nUsing these solutions and accounting the initial state for input light fields a in,1 (t) and a in,2 (t), we can get now features of output fields a out,1 (t) and a out,2 (t) from relations [18] \na out,1 (t) = √ κa cw (t)-a in,1 (t), a out,2 = √ κa ccw - a in,2\n. By assuming ω cw = ω ccw = ω r , we get from (4, 5):\na out,1 (ω) = B 1,1 (m, ω)a in,1 (ω) + B 1,2 (m, ω)a in,2 (ω) ,(6)\na out,2 (ω) = B 2,1 (m, ω)a in,1 (ω) + B 2,2 (m, ω)a in,2 (ω) ,(7)\nwhere\nB 1,2 (m, ω) = B 2,1 (m, ω) = -i {η + µm} κ (η + µm) 2 + κ 2 -i (ω -ω r ) 2 ,\nand\nB 1,1 (m, ω) = B 2,2 (m, ω) = - (η + µm) 2 -κ 2 4 -(ω -ω r ) 2 (η + µm) 2 + κ 2 -i (ω -ω r ) 2 .\nEqs. 6,7 demonstrate dependence of output fields on the state of the atom. For the input single photon state\n|Ψ in = -1 2 ,+ 1 2 m α m ∞ -∞ dω{C (m) 1 (ω) a † in,1 (ω) +C (m) 2 (ω)a † in,2 (ω)} |0 1 |0 2 |m c ,(8)\nwe get the output quantum state of light after the photon-atom interaction:\n|ψ at+ph = -1 2 ,+ 1 2 m α m ∞ -∞ dω{C (m) 1,out (ω)a (m) † out,1 (ω) + C (m) 2,out (ω)a (m) † out,2 } |0 1 |0 2 |m c .\nwhere \nC (m) 1,out (ω)a (m) † out,1 (ω) = C (m) 1 (ω) B * 1,1 (m)a † in,1 (ω) + C (m) 2 (ω) B * 1,2 (m)a † in,2 (ω),(9)\nC (m) 2,out (ω) a (m)+ out,2 (ω) = C (m) 1 (ω) B * 2,1 (m) a + in,1 (ω)+C (m) 2 (ω) B * 2,2 (m) a + in,2 (ω) . (10\nB * 1,2 (m) = B * 2,1 (m) = i{η+µm}κ (η+µm) 2 + κ 2 B * 1,1 = B * 2,2 = - (η+µm) 2 -κ 2 4 (η+µm) 2 + κ 2 4\n. By taking into account the fulfillment of the impedance matching conditions:\nη = µ 2 , µ = κ 2 ,(11)\nwe find for the field amplitudes:\nB * 1,2 (-1/2) = B * 2,1 (-1/2) = 0, B * 1,1 = B * 2,2 = 1 if m=-1/2, and B * 1,2 1 2 = B * 2,1 1 2 = i; B * 1,1 = B * 2,2 = 0 if m=1/2.\nFinally, the wave function of the output fields will be\n|ψ at+ph = α -1/2 ∞ -∞ dω{C (-1 2 ) 1 (ω) a † in,1 (ω) + C (-1 2 ) 2 a † in,2 (ω) } |0 1 |0 2 | -1/2 c +iα 1/2 ∞ -∞ dω{C ( 1 2 ) 1 (ω) a † in,2 (ω) + C ( 1 2 ) 2 (ω)a † in,1 (ω) } |0 1 |0 2 |1/2 c .\nWe note that the coupling constant η can be varied by changing contrast of Bragg-grating and its distance to the surface of ring cavity as it was used recently for nanofiber cavity containing one atom [19] (see Fig. 1) By performing edition rotation of the atom state on angle π/2 we get :\n|Ψ out = exp -iSzπ 2 |ψ at+ph = exp {iπ/4} • {α -1/2 ∞ -∞ dω[C (-1 2 ) 1 (ω) a + in,1 (ω) + C (-1 2 ) 2 a + in,2 (ω) ] |0 1 |0 2 | -1/2 c +α 1/2 ∞ -∞ dω[C ( 1 2 ) 1 (ω) a + in,2 (ω) + C ( 1 2 ) 2 (ω)a + in,1 (ω) ] |0 1 |0 2 |1/2 c }.\nAs it is seen in Eq.( 12), the atom in state m=-1/2 preserves the initial quantum state of two mode photon state, while we have NOT gate for the photon state if m=1/2. This indicates the performance of CNOT gate in the case of monochromatic cavity. Bearing in mind that the atomic state (evaluation of the atomic amplitudes α -1/2 and α 1/2 ) can be regulated by the controlling photon the photon-photon CNOT gate can be constructed using this approach.", "publication_ref": ["b14", "b0", "b1", "b17", "b18"], "figure_ref": [], "table_ref": []}, {"heading": "Possibilities of experimental implementation", "text": "In order to construct the considered CNOT gate, we must satisfy the two matching conditions (11). The first condition η = µ/2 = |g| 2 /( ∆ -η) can be fulfilled by choice of the photon-atom frequency detuning ∆ = ω 0 -ω ccw for the given coupling constant of the circulating cavity light modes η. In turns, the coupling constant η is determined by the parameters of the fabricated Bragg grating (see Fig. 1). For the fulfillment of (11), we can adjust the coupling coefficient κ of the cavity with external waveguide by tuning the refractive index in the coupling region. If the system parameters are properly chosen, we can efficiently realize the proposed CNOT gate by following this scenario. First, we use a controlling photon qubit for excitation of the controlling atom situated in the ring cavity. The effective photon transfer to the atomic state can be realized by appropriated choice of the temporal photon mode. In particular, this process can be performed for two-level or three-level lambda-type atom interacting with additional laser field on the adjoined atomic transition [20]. Moreover implementation of the considered CNOT gate on three-level atom could provide longer coherence time on the ground two levels that make it easier to perform. Then, we load target photon qubit in the cavity that is not in resonance with the control atom at this stage. Finally, we introduce CNOT gate operation cavity in resonance with its atom, and perform CNOT gate as it was described above.\nWhispering-gallery mode optical cavity with high quality factor up to Q = 10 11 [21] can be used to construct CNOT gate with enhanced coupling constant µ. Besides controlling two-level atom (Rb for example) we suggest also quantum dot, nanoparticle with single active center attached to the surface of cavity or single atom or ion implanted in the cavity surface. Optical fiber-taper is widely used for coupling light field with cavity mode [22][23][24]. For critical coupling very thin fiber is necessary with diameter D < λ while such fibers are usually too unstable and can be damaged easily. Recently integrated photonic waveguides were used for efficient coupling of atom with light [25].\nIn addition to this approach we suggest femtosecond laser written waveguide in fused silica plate [26,27]. Robust construction of this device is shown in Fig. 1. Laser written waveguide has small region where waveguide draw nearer (several µm) to the surface of fused silica plate. This region can be used for coupling with whispering-gallery light modes through evanescent part of light field. Coupling constant can be adjusted by changing the refractive index between cavity and plate or between waveguide and the surface of fused silica plate using short laser pulses. Moreover the printed waveguide can be implemented in inorganic crystal doped by rare-earth ions [28][29][30] for on chip quantum storage of photonic qubits as it is depicted in Fig. 1. It is worth noting that the device can be efficiently connected with resonator quantum memory cells [30][31][32][33][34][35][36] for operation with large number of photonic qubits.\nAt the fabrication of waveguide, laser forms the shell of waveguide (two or more damage tracks) with decreased refractive-index, in addition this damage tracks produce stress field that leads to increasing of core refractive-index [27]. It was shown that spectroscopic and coherency properties of rare-earth ions in materials perspective for implementation of quantum computer were not changed drastically [26,37]. Our measurements in waveguides produced in 7 LiY F 4 : Er 3+ show that erbium ions in these waveguides have coherent time sufficiently long for quantum informatics and waveguides with a high diameter (∼ 100µm) have relatively low waveguide propagation losses (0.6 dB/cm).\nHowever, with decreasing of waveguide diameter, these losses enhanced and the coherence time somewhat shortened. Therefore we have investigated another type of waveguides that are fabricated in Y 2 SiO 5 (most popular material for quantum informatics applications [17]). Laser beam produced a weak damage at the focal volume with relevant increase in refractive index and it is a position of waveguide core. After fabrication of the waveguides, the dif- ference of refractive indexes of the core with diameter d core and the coating is equal approximately n=0.001. Such waveguides have demonstrated sufficiently broad radiation profile in the transverse dimension. We have found that the transverse distribution of radiation is about 40 µm at the diameter of core equal d core = 5 µm. At the abrupt inclination of the waveguide the radiation get out of the waveguide as it is also shown in the numerical simulations depicted in (Fig. 2).\nTherefore, the waveguide should have sufficiently large bending radius R. The waveguide transmission can reach unity at the optimal parameters of bending, d core etc. The light transmission through the waveguide with diameter d core = 5 µm and 40 µm bending size is depicted in Fig. 3. For example, the transmission can reach T r =97.5% in the operation zone at the radius R near 0.08 m that corresponds to the inclination angle 1.28 degrees. In this case, the bending length will be about 3.6 mm. As it is shown in Fig. 1, a series of waveguide with core size of 5 µm was created in a quartz glass with length 11.8 mm by using the femtosecond laser writing method. The repetition rate of laser pulses creating waveguides was chosen 1 MHz, the pulse length -400 fs, the average radiation power -82 mW. The laser output was frequency doubled to meet optimal focusing conditions with a Mitutoyo Plan APO 100X microscope objective [38]. The two bending zones have a total length of 7.2 mm, which determines the maximum length 4.6 mm of the interaction zone between the cavity and waveguide. The creation of a curved waveguide was carried out at a depth of 55 µm with the subsequent rise of the waveguide core to the surface of the optical chip to a depth of 15 µm. Such shape of the waveguides ensured the steady propagation of light and its localization near the waveguide at a distance of 40 µm (as it was found by the numerical calculations). After creating the waveguides, the ends of the optical chip were sanded to a depth of 150 µm and polished to provide the best input / output of the optical signal. The radius of curvature we chose was 80mm, which provided a transfer efficiency in a double bending waveguide structure 1 of more than 90% in accordance with numerical calculation for 2 bend (T r) 2 = 95% see Fig. 3.  In order to efficiently transfer radiation into the cavity, we need to find the appropriate parameters of the working area near the surface with the optimal depth of the waveguide and the length (see Fig. 4). To ensure the interaction of the optical field of the waveguide with the microcavity, the chip surface can be polished, which determines the actual depth of the waveguide area interacting with the microcavity. We have numerically simulated the radiation properties in such waveguide systems. The light will reflect from the crystal-air interface at the approach of radiation to the operative area (where ring cavity is located). As a result, the maximum of radiation distribution in transverse direction of non-symmetric waveguide will be shifted deeper in the crystal. This effect is due to the small refractive indexes difference. This waveguide structure has an optimal distance for radiation transfer from the waveguide to the crystal-air interface d surf and then to resonator, correspondingly. In this case, the initial diameter of the waveguide d core must be also diminished up to some optimal value. For instance, the excitation of resonator (with the diameter D cavity = 110 µm and refractive index of crystal n cavity = 1.47) is shown in Fig. 4 for radiation wavelength λ = 808 nm and polarization along vertical axis E y at the distance from waveguide to interface d surf = 1 µm. Thus, performed calculations had shown that the effective excitation of resonator with diameter 110 µm is possible at the waveguide core diameter 2 µm and the waveguide bending radius 0.1 m.", "publication_ref": ["b10", "b19", "b20", "b21", "b22", "b23", "b24", "b25", "b26", "b27", "b28", "b29", "b29", "b30", "b31", "b32", "b33", "b34", "b35", "b26", "b25", "b36", "b16", "b37"], "figure_ref": ["fig_1", "fig_2", "fig_2", "fig_3", "fig_3"], "table_ref": []}, {"heading": "Conclusion", "text": "We have proposed the photon-photon CNOT gate on counter propagating photon modes in ring cavity containing a two-level atom. It was theoretically found that the CNOT gate can be realized at the optimal coupling constants of photon-atom interaction in the ring cavity and coupling constant of the photons propagating clockwise and counterclockwise. It is shown that the CNOT gate can be realized deterministically with small number of operation steps in a simple optical scheme. In our scheme, besides the proposed photon-photon CNOT gate, the single qubit gates can be also implemented by additional control of atomic state which is necessary for the universal quantum computing.\nWe considered possible implementation of the proposed CNOT operation in on a chip waveguide scheme. We have conducted a numerical simulation for such a scheme and experimental studies of the light propagation in the femtosecond laser written bending waveguide fabricated in quartz glass. The optimal parameters of the waveguide systems were found for 90% efficiency of waveguided light transmission to the cavity area. Thus, the performed studies demonstrated possible ways for the on a chip implementation of the proposed photon-photon CNOT gate.", "publication_ref": [], "figure_ref": [], "table_ref": []}], "references": [{"ref_id": "b0", "title": "", "journal": "Nature", "year": "2001", "authors": "E Knill; R Laflamme; G J Milburn"}, {"ref_id": "b1", "title": "", "journal": "Physical Review Letters", "year": "2018", "authors": "M Y Niu; I L Chuang; J H Shapiro"}, {"ref_id": "b2", "title": "", "journal": "Physical Review Letters", "year": "2004", "authors": "L M Duan; H J Kimble"}, {"ref_id": "b3", "title": "", "journal": "Optics Express", "year": "2013", "authors": "C Wang; Y Zhang; R Jiao; G Sheng; Jin "}, {"ref_id": "b4", "title": "", "journal": "Optics Express", "year": "2017", "authors": "B C Ren; F G Deng"}, {"ref_id": "b5", "title": "", "journal": "Physical Review A", "year": "2007", "authors": "B Wang; L M Duan"}, {"ref_id": "b6", "title": "", "journal": "Physical Review A", "year": "2010", "authors": "K Koshino; S Ishizaka; Y Nakamura"}, {"ref_id": "b7", "title": "European Conference on Lasers and Electro-Optics -European Quantum Electronics Conference", "journal": "Optical Society of America", "year": "2015", "authors": "Y Tokunaga; K Koshino"}, {"ref_id": "b8", "title": "", "journal": "Scientific Reports", "year": "2016", "authors": "G Y Wang; Q Liu; H R Wei; T Li; Q Ai; F G Deng"}, {"ref_id": "b9", "title": "", "journal": "Physical Review A", "year": "", "authors": "H R Wei; F G Deng"}, {"ref_id": "b10", "title": "", "journal": "Optics Express", "year": "2013", "authors": "H R Wei; F G Deng"}, {"ref_id": "b11", "title": "", "journal": "Scientific Reports", "year": "2015", "authors": "H R Wei; G L Long"}, {"ref_id": "b12", "title": "", "journal": "Scientific Reports", "year": "2017", "authors": "A P Liu; L Y Cheng; Q Guo; S Zhang; M X Zhao"}, {"ref_id": "b13", "title": "", "journal": "Nature", "year": "2016", "authors": "B Hacker; S Welte; G Rempe; S Ritter"}, {"ref_id": "b14", "title": "", "journal": "Nature Photonics", "year": "2013", "authors": "H Kim; R Bose; T C Shen; G S Solomon; E Waks"}, {"ref_id": "b15", "title": "", "journal": "Physical Review", "year": "1966", "authors": "J R Schrieffer; P A Wolff"}, {"ref_id": "b16", "title": "", "journal": "Optica", "year": "2018", "authors": "A Seri; G Corrielli; D Lago-Rivera; A Lenhard; H De Riedmatten; R Osellame; M Mazzera"}, {"ref_id": "b17", "title": "Quantum Optics", "journal": "Springer", "year": "1994", "authors": "D F Walls; G J Milburn"}, {"ref_id": "b18", "title": "", "journal": "Physical Review Letters", "year": "2014", "authors": "R Yalla; M Sadgrove; K P Nayak; K Hakuta"}, {"ref_id": "b19", "title": "", "journal": "Physical Review Letters", "year": "2007", "authors": "A V Gorshkov; A André; M Fleischhauer; A S Sørensen; M D Lukin"}, {"ref_id": "b20", "title": "", "journal": "Optics Express", "year": "2007", "authors": "A A Savchenkov; A B Matsko; V S Ilchenko; L Maleki"}, {"ref_id": "b21", "title": "", "journal": "Optics Letters", "year": "1997", "authors": "J C Knight; G Cheung; F Jacques; T A Birks"}, {"ref_id": "b22", "title": "", "journal": "Optics Letters", "year": "2002", "authors": "T J Kippenberg; S M Spillane; K J Vahala"}, {"ref_id": "b23", "title": "", "journal": "Physical Review Letters", "year": "2000", "authors": "M Cai; O Painter; K J Vahala"}, {"ref_id": "b24", "title": "", "journal": "Optics Letters", "year": "2018", "authors": "M Anderson; N G Pavlov; J D Jost; G Lihachev; J Liu; T Morais; M Zervas; M L Gorodetsky; T J Kippenberg"}, {"ref_id": "b25", "title": "", "journal": "Laser Physics Letters", "year": "2018", "authors": "M M Minnegaliev; I V Dyakonov; K I Gerasimov; A A Kalinkin; S P Kulik; S A Moiseev; M Y Saygin; R V Urmancheev"}, {"ref_id": "b26", "title": "", "journal": "Laser & Photonics Reviews", "year": "2013", "authors": "F Chen; J R V De Aldana"}, {"ref_id": "b27", "title": "", "journal": "Nature", "year": "2011", "authors": "E Saglamyurek; N Sinclair; J Jin; J A Slater; D Oblak; F Bussières; M George; R Ricken; W Sohler; W Tittel"}, {"ref_id": "b28", "title": "", "journal": "Nature Communications", "year": "2017", "authors": "T Zhong; J M Kindem; J Rochman; A Faraon"}, {"ref_id": "b29", "title": "", "journal": "Quantum Electronics", "year": "2018", "authors": "M M Minnegaliev; K I Gerasimov; R V Urmancheev; S A Moiseev"}, {"ref_id": "b30", "title": "", "journal": "Quantum Electronics", "year": "2015", "authors": "S N Andrianov; S A Moiseev"}, {"ref_id": "b31", "title": "", "journal": "Optics and Spectroscopy", "year": "2016", "authors": "S A Moiseev; S N Andrianov"}, {"ref_id": "b32", "title": "", "journal": "Physical Review A", "year": "2010", "authors": "C Simon; H De Riedmatten; M Afzelius"}, {"ref_id": "b33", "title": "", "journal": "Physical Review A", "year": "2010", "authors": "S A Moiseev; S N Andrianov; F F Gubaidullin"}, {"ref_id": "b34", "title": "", "journal": "Physical Review Letters", "year": "2013", "authors": "M Sabooni; Q Li; S Krll; L Rippe"}, {"ref_id": "b35", "title": "", "journal": "New Journal of Physics", "year": "2014", "authors": "P Jobez; I Usmani; N Timoney; C Laplane; N Gisin; M Afzelius"}, {"ref_id": "b36", "title": "", "journal": "Physical Review Applied", "year": "2016", "authors": "G Corrielli; A Seri; M Mazzera; R Osellame; H De Riedmatten"}, {"ref_id": "b37", "title": "", "journal": "Applied Physics B", "year": "2016", "authors": "I V Dyakonov; A A Kalinkin; M Y Saygin; A G Abroskin; I V Radchenko; S S Straupe; S P Kulik"}], "figures": [{"figure_label": "", "figure_type": "figure", "figure_id": "fig_0", "figure_caption": ") Below we assume the input photon state C m 1.2 (ω) is characterized by sufficiently narrow spectral width δωs κ 1, where", "figure_data": ""}, {"figure_label": "2", "figure_type": "figure", "figure_id": "fig_1", "figure_caption": "Fig. 22Fig. 2 Behavior of radiation with Ey polarization in bent waveguide with core diameter 5 µm and waveguide length of L=0.591 mm and L= 2.41 mm.", "figure_data": ""}, {"figure_label": "3", "figure_type": "figure", "figure_id": "fig_2", "figure_caption": "Fig. 33Fig.3The transmission Tr of light with Ez polarization through the waveguide with core diameter 5 µm depending on the bending radius R 0 (the two curves are given in different scales).", "figure_data": ""}, {"figure_label": "4", "figure_type": "figure", "figure_id": "fig_3", "figure_caption": "Fig. 44Fig. 4 Nnmerical simulation of the ring cavity excitation by the waveguide field (the waveguide mode is excited from the right side mode). a) Diameter of the cavity is D cavity = 110 µm, wavelength is λ = 808nm; A) Diameter of the waveguide is dcore = 4 µm. b) Diameter of the waveguide is dcore = 2 µm. It is seen the enhancement of the ring cavity mode and out waveguide mode at the decreasing of waveguide diameter dcore up to 2 µm and the field scatters partially in air.", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "", "figure_caption": "", "figure_data": ""}], "formulas": [{"formula_id": "formula_0", "formula_text": "H 1 = H (cw) r-a + H (ccw) r-a", "formula_coordinates": [3.0, 297.07, 422.67, 99.52, 13.77]}, {"formula_id": "formula_1", "formula_text": "(cw) r-a = gS + a cw +g * S -a † cw and similarly H (ccw)", "formula_coordinates": [3.0, 192.58, 617.48, 205.15, 13.77]}, {"formula_id": "formula_2", "formula_text": "H s = H 0 + 1 2 [H 1 , s] providing H 1 + [H 0 ,", "formula_coordinates": [4.0, 72.0, 150.5, 336.74, 23.49]}, {"formula_id": "formula_3", "formula_text": "s = α (cw) gS + a cw + β (cw) g * S -a † cw + α (ccw) gS + a ccw + β (ccw) g * S -a † ccw ,(1)", "formula_coordinates": [4.0, 81.16, 207.51, 327.58, 12.69]}, {"formula_id": "formula_4", "formula_text": "∆ = ω 0 -ω cw , α (cw) = -β (cw) = -1 ∆-η , α (ccw) = -β (ccw) = -1 ∆-η", "formula_coordinates": [4.0, 101.3, 229.04, 305.99, 13.47]}, {"formula_id": "formula_5", "formula_text": "ω cw = ω ccw = ω r , β (cw) = β (ccw) = β.", "formula_coordinates": [4.0, 72.0, 267.05, 160.33, 12.07]}, {"formula_id": "formula_6", "formula_text": "H s = ω cw a † cw a cw + ω ccw a † ccw a ccw + η a † cw a ccw + a † ccw a cw + ω 0 + 2β|g| 2 S z +µS z a † cw a cw + a † ccw a ccw + a cw a † ccw + a † cw a ccw ,", "formula_coordinates": [4.0, 73.49, 312.36, 336.43, 29.03]}, {"formula_id": "formula_7", "formula_text": "µ = 2β|g| 2 = 2|g| 2 /( ∆ -η)) with S z = ±1/2.", "formula_coordinates": [4.0, 145.07, 360.14, 217.21, 11.71]}, {"formula_id": "formula_8", "formula_text": "d dt a cw = -iω cw + κ 2 a cw -i {η + µS z } a ccw + √ κ a in,1 (t) ,(2)", "formula_coordinates": [4.0, 107.95, 474.09, 300.79, 23.23]}, {"formula_id": "formula_9", "formula_text": "d dt a ccw = -i(ω ccw + κ 2 )a ccw -i{η + µS z }a cw + √ κ a in,2 (t),(3)", "formula_coordinates": [4.0, 111.44, 510.83, 297.29, 23.23]}, {"formula_id": "formula_10", "formula_text": "a cw (ω) = -i{η + µm} √ κ a in,2 (ω) + κ 2 -i (ω -ω ccw ) √ κ a in,1 (ω) (η + µm) 2 + κ 2 -i (ω -ω cw ) κ 2 -i (ω -ω ccw ) ,(4)", "formula_coordinates": [4.0, 82.52, 611.11, 326.21, 34.55]}, {"formula_id": "formula_11", "formula_text": "a ccw (ω) = -i {η + µm} √ κ a in,1 (ω) + κ 2 -i (ω -ω cw ) √ κ a in,2 (ω) (η + µm) 2 + κ 2 -i (ω -ω cw ) κ 2 -i (ω -ω ccw ) .(5)", "formula_coordinates": [5.0, 80.86, 103.94, 327.88, 34.55]}, {"formula_id": "formula_12", "formula_text": "a out,1 (t) = √ κa cw (t)-a in,1 (t), a out,2 = √ κa ccw - a in,2", "formula_coordinates": [5.0, 72.0, 164.16, 336.74, 28.78]}, {"formula_id": "formula_13", "formula_text": "a out,1 (ω) = B 1,1 (m, ω)a in,1 (ω) + B 1,2 (m, ω)a in,2 (ω) ,(6)", "formula_coordinates": [5.0, 122.24, 207.84, 286.49, 11.5]}, {"formula_id": "formula_14", "formula_text": "a out,2 (ω) = B 2,1 (m, ω)a in,1 (ω) + B 2,2 (m, ω)a in,2 (ω) ,(7)", "formula_coordinates": [5.0, 123.91, 227.58, 284.83, 9.65]}, {"formula_id": "formula_15", "formula_text": "B 1,2 (m, ω) = B 2,1 (m, ω) = -i {η + µm} κ (η + µm) 2 + κ 2 -i (ω -ω r ) 2 ,", "formula_coordinates": [5.0, 112.84, 263.16, 255.07, 27.74]}, {"formula_id": "formula_16", "formula_text": "B 1,1 (m, ω) = B 2,2 (m, ω) = - (η + µm) 2 -κ 2 4 -(ω -ω r ) 2 (η + µm) 2 + κ 2 -i (ω -ω r ) 2 .", "formula_coordinates": [5.0, 107.24, 317.73, 266.26, 34.87]}, {"formula_id": "formula_17", "formula_text": "|Ψ in = -1 2 ,+ 1 2 m α m ∞ -∞ dω{C (m) 1 (ω) a † in,1 (ω) +C (m) 2 (ω)a † in,2 (ω)} |0 1 |0 2 |m c ,(8)", "formula_coordinates": [5.0, 94.31, 403.95, 314.43, 36.06]}, {"formula_id": "formula_18", "formula_text": "|ψ at+ph = -1 2 ,+ 1 2 m α m ∞ -∞ dω{C (m) 1,out (ω)a (m) † out,1 (ω) + C (m) 2,out (ω)a (m) † out,2 } |0 1 |0 2 |m c .", "formula_coordinates": [5.0, 88.42, 473.69, 307.16, 26.18]}, {"formula_id": "formula_19", "formula_text": "C (m) 1,out (ω)a (m) † out,1 (ω) = C (m) 1 (ω) B * 1,1 (m)a † in,1 (ω) + C (m) 2 (ω) B * 1,2 (m)a † in,2 (ω),(9)", "formula_coordinates": [5.0, 74.85, 539.41, 333.89, 23.83]}, {"formula_id": "formula_20", "formula_text": "C (m) 2,out (ω) a (m)+ out,2 (ω) = C (m) 1 (ω) B * 2,1 (m) a + in,1 (ω)+C (m) 2 (ω) B * 2,2 (m) a + in,2 (ω) . (10", "formula_coordinates": [5.0, 72.0, 583.86, 338.55, 28.97]}, {"formula_id": "formula_21", "formula_text": "B * 1,2 (m) = B * 2,1 (m) = i{η+µm}κ (η+µm) 2 + κ 2 B * 1,1 = B * 2,2 = - (η+µm) 2 -κ 2 4 (η+µm) 2 + κ 2 4", "formula_coordinates": [5.0, 267.42, 626.9, 144.81, 16.41]}, {"formula_id": "formula_22", "formula_text": "η = µ 2 , µ = κ 2 ,(11)", "formula_coordinates": [6.0, 209.57, 129.63, 199.17, 22.31]}, {"formula_id": "formula_23", "formula_text": "B * 1,2 (-1/2) = B * 2,1 (-1/2) = 0, B * 1,1 = B * 2,2 = 1 if m=-1/2, and B * 1,2 1 2 = B * 2,1 1 2 = i; B * 1,1 = B * 2,2 = 0 if m=1/2.", "formula_coordinates": [6.0, 72.0, 157.83, 336.74, 29.99]}, {"formula_id": "formula_24", "formula_text": "|ψ at+ph = α -1/2 ∞ -∞ dω{C (-1 2 ) 1 (ω) a † in,1 (ω) + C (-1 2 ) 2 a † in,2 (ω) } |0 1 |0 2 | -1/2 c +iα 1/2 ∞ -∞ dω{C ( 1 2 ) 1 (ω) a † in,2 (ω) + C ( 1 2 ) 2 (ω)a † in,1 (ω) } |0 1 |0 2 |1/2 c .", "formula_coordinates": [6.0, 88.35, 218.59, 303.57, 46.45]}, {"formula_id": "formula_25", "formula_text": "|Ψ out = exp -iSzπ 2 |ψ at+ph = exp {iπ/4} • {α -1/2 ∞ -∞ dω[C (-1 2 ) 1 (ω) a + in,1 (ω) + C (-1 2 ) 2 a + in,2 (ω) ] |0 1 |0 2 | -1/2 c +α 1/2 ∞ -∞ dω[C ( 1 2 ) 1 (ω) a + in,2 (ω) + C ( 1 2 ) 2 (ω)a + in,1 (ω) ] |0 1 |0 2 |1/2 c }.", "formula_coordinates": [6.0, 88.07, 337.94, 304.1, 48.49]}], "doi": "10.1038/35051009"}
