{"title": "CORec-Cri: How collaborative and social technologies can help to contextualize crises?", "authors": "Ngoc Luyen Lê; Jinfeng Zhong; Elsa Negre; Marie-Hélène Abel", "pub_date": "2023-10-03", "abstract": "Crisis situations can present complex and multifaceted challenges, often requiring the involvement of multiple organizations and stakeholders with varying areas of expertise, responsibilities, and resources. Acquiring accurate and timely information about impacted areas is crucial to effectively respond to these crises. In this paper, we investigate how collaborative and social technologies help to contextualize crises, including identifying impacted areas and real-time needs. To this end, we define CORec-Cri (Contextulized Ontology-based Recommender system for crisis management) based on existing work. Our motivation for this approach is two-fold: first, effective collaboration among stakeholders is essential for efficient and coordinated crisis response; second, social computing facilitates interaction, information flow, and collaboration among stakeholders. We detail the key components of our system design, highlighting its potential to support decision-making, resource allocation, and communication among stakeholders. Finally, we provide examples of how our system can be applied to contextualize crises to improve crisis management.", "sections": [{"heading": "I. INTRODUCTION", "text": "In situations where traditional public resources like ambulances and helicopters are insufficient and not well-positioned to reach everyone in need during population evacuations, alternative evacuation resources must be explored. Citizen resources, including citizen-volunteer drivers and their personal vehicles, are more widely dispersed and accessible. Many citizen-volunteer may also be willing to assist with the evacuation using their own vehicles. For instance, a minivan owner with a capacity of 9 passengers could potentially evacuate an additional 8 people, significantly boosting the evacuation process's capacity. Similarly, a boat owner with a capacity of 6 passengers could help evacuate 5 people during a flood. Effective collaboration among different stakeholders is critical for a successful response to a crisis situation. In crisis management, collaboration involves working together with multiple stakeholders, including government agencies, non-governmental organizations, private companies, and individuals, to effectively respond to the crisis situation [1]. Key elements of collaboration in crisis management include communication, coordination, resource management, and decisionmaking. Effective communication is essential for successful collaboration in crisis management [2]. Stakeholders need to share information in a timely and accurate manner to make informed decisions and allocate resources effectively. Collaboration also involves coordinating efforts among stakeholders to avoid duplication of effort, make effective use of resources, and ensure that everyone is working towards common goals. Furthermore, collaboration requires stakeholders to work together to allocate and manage resources, including personnel, equipment, and supplies. Finally, stakeholders must work together to make informed decisions about response strategies and resource allocation. Furthermore, social computing has emerged as an essential tool for managing crises by facilitating information sharing, communication, and collaboration among stakeholders [3]. In the realm of crisis management, social computing has been applied to aid and relief efforts [4]- [6], crowd-sourcing [7], [8], and managing information flow [7], [9], [10].\nWe define an advanced crisis management system that extends the methodology introduced in [11] (ORec-Cri: Ontology-based Recommender system for Crisis management) by incorporating collaborative and social technologies to enhance communication and coordination between stakeholders. We term the modified system as CORec-Cri (Contextualized Ontology-based Recommender system for Crisis management). CORec-Cri recommends a list of citizen-volunteer drivers/vehicles to each impacted area, particularly when public resources are inadequate or inaccessible due to crisis situations. To further improve the system, we leverage social computing to better contextualize crises (e.g. identifying the location of impacted areas and real-time needs, gathering and sharing information related to crises) and facilitate collaboration among stakeholders. Collaborative technologies and social computing components are introduced to enable effective interactions among different stakeholders, supporting decisionmaking, resource allocation, and communication. We illustrate the practicality of our approach with examples of crisis situations where CORec-Cri can be applied. The key benefits of our approach include enhanced collaboration, informed decisionmaking, and improved crisis management outcomes.\nThe rest of this article is organized as follows: Section II introduces literature on collaborations and social computing in crisis management. Section III presents our main contributions: our approach to the construction of a framework leveraging the power of collaboration and social computing for crisis management. In section IV, we illustrate and discuss our work by a scenario of a crisis management. Finally, we conclude and present the perspective.", "publication_ref": ["b0", "b1", "b2", "b3", "b5", "b6", "b7", "b6", "b8", "b9", "b10"], "figure_ref": [], "table_ref": []}, {"heading": "II. RELATED WORKS", "text": "In this paper, our aim is to contextualize crises through the utilization of collaborative and social technologies. Therefore, we will provide a brief overview of related works that leverage these technologies for effective crisis management.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "A. Collaborative Technologies in crisis management", "text": "Collaboration plays an important role in crisis management, as it brings together various stakeholders and organizations to coordinate their efforts and respond to crises seamlessly. Effective collaboration in crisis management involves sharing information and resources, and making informed decisions that can impact the outcomes of evacuation activities. Collaborative technologies and social computing, combined with effective planning and training, can further facilitate collaboration, making it easier to share information and resources and prepare for crises [2]. Therefore, the use of collaborative technologies can contribute to greater resilience in the face of crises and better preparedness for future unpredictable crises [12].\nCollaborative technologies based on computer-supported systems, networks and mobiles can provide an efficient means of enhancing the dissemination, retrieval, and analysis of information during crises. For example, Monares et al. [13] developed a mobile groupware application that enables firefighters to reduce their reliance on radio communication and exchange digital information during emergency response processes. Elmhadhbi et al. [14] proposed an ontology-based messaging service that aims to resolve inconsistencies and enhance understanding among participants during emergency responses. This service ensures semantic translation of exchanged information, utilizing a shared understanding of concepts and terms among stakeholders. Chehade et al. [15] proposed the development of well-designed communication system interfaces that facilitate communication and interaction among various stakeholders, with the aim of enhancing situational awareness. Consequently, these proposed collaborative frameworks can improve the speed and accuracy of information sharing and analysis, which is crucial in crisis situations.\nCollaborative technologies have several important aspects that can aid in organizing, deploying, and intervening during crisis management: (i) cooperative information gathering, (ii) team awareness, and (iii) risk and vulnerability assessment [16]. Collaborative technologies first facilitate cooperative information gathering by enabling stakeholders to share and analyze critical data in real-time, which can help inform decisionmaking during evacuation efforts. Team awareness can then be enhanced by collaborative technologies that allow stakeholders to communicate and coordinate their efforts, ensuring that everyone is aware of the actions being taken. Finally, collaborative technologies can aid in risk and vulnerability assessment by providing stakeholders with the tools to identify and mitigate potential threats and vulnerabilities. Messaging apps, social media platforms, and video conferencing tools are part of social computing that enable individuals to share information and communicate in real-time during crisis management. In the next section, we will examine related works on social computing and its applications in crisis management.", "publication_ref": ["b1", "b11", "b12", "b13", "b14", "b15"], "figure_ref": [], "table_ref": []}, {"heading": "B. Social Computing in crisis management", "text": "Social computing refers to the utilization of technology, such as Twitter and Facebook, to facilitate interaction and collaboration between users, transforming the way in which people communicate [3]. During times of disaster, whether natural or man-made, the use of social technologies rapidly increases. As Saroj and Pal [17] indicate, people use these technologies to communicate with family and friends in the affected area to inquire about their safety and security. Sharing or seeking information about essential needs such as food, shelter, transportation, and medical care is another important use of social technologies. With the help of social technologies, anyone can potentially serve as a source of essential information resources. Therefore, the use of such social technologies can be highly beneficial for decisionmakers during times of crises [7], [18]- [20].\nFrom existing literature, three ways can be identified to integrate social computing into crisis management. The first is the listening function [7], which is a direct use of social computing since people impacted by crises can send out their opinions and emotions through social media. Emotional analysis during crises [9] has also been researched. Secondly, decision-makers can apply social computing to monitor the situation more effectively and respond efficiently to manage crises [21]. According to Vihalemm et al. [10], social media helps citizens receive, understand, and emotionally cope with warning messages when crises arrive. The authors in [4] used tweets to identify the location of crises, enabling decisionmakers to better allocate rescue resources. Rescue or relief assistance is another critical use of social media tools by decision-makers, as medical needs can be identified more efficiently with the help of social media [5], [6]. Thirdly, crowd-sourcing and collaboration represent another important way social computing is applied to crisis management [7]. For instance, Sahana, along with its derivatives Eden, Vesuvius, and Mayon, are open-source disaster management systems that aim to harness the crowd-sourcing power of social media [8].\nIt can be observed that the use of social computing in these works focuses on private social media platforms such as Twitter, Facebook, etc. Although these platforms facilitate efficient information flow during crises, rumors and incorrect information may also spread and cause panic among the population, hindering effective crisis management [22], [23]. In our work, we aim to design a social computing tool that is restricted to volunteers to avoid rumors and incorrect information and reduce the effort required to detect and mitigate the spread of such harmful information.", "publication_ref": ["b2", "b16", "b6", "b17", "b19", "b6", "b8", "b20", "b9", "b3", "b4", "b5", "b6", "b7", "b21", "b22"], "figure_ref": [], "table_ref": []}, {"heading": "III. OUR APPROACH", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "A. Problem statement", "text": "The authors in [11] presented a system (ORec-Cri) designed to aid decision-makers in recommending a list of citizenvolunteer drivers/vehicles for evacuation purposes. The system is composed of four layers: (i) the Interaction Layer, where citizen-volunteer drivers respond to the requests of decisionmakers; (ii) the Intelligent Layer, which recommends a list of citizen-volunteer drivers/vehicles to decision-makers based on minimizing evacuation time; the (iii) Service Layer, which computes the distance among points using OpenStreetMap; (iv) the Data Layer, which stores an ontology-supported knowledge base for the crisis management domain. However, there are two major issues with this system design. Firstly, it is not clear how the system collects critical information, such as the location of impacted areas, the number of people and disabled individuals in each area, and the priority level of each area. Secondly, the real-time situation in impacted areas may change, making it crucial that the system considers contextual information to generate accurate recommendations that adapt sto the real-time context of the impacted areas. To to address the issues of ORec-Cri [11], we aim to tackle the following two problems: (i) how to collect detailed information related to impacted areas, such as location, number of affected individuals in each area, and the priority level of each area; and (ii) how to handle real-time changes in each impacted area, such as changes in accessibility. To solve these problems, we define a framework that harnesses the power of collaborative and social technologies.", "publication_ref": ["b10", "b10"], "figure_ref": [], "table_ref": []}, {"heading": "B. Collaboration framework for crisis management", "text": "In the context of crisis management, we present a framework designed to facilitate effective collaboration and communication among various stakeholders by leveraging collaborative and social technologies. This framework aims to improve the overall evacuation activities and population sheltering management based on the mobilization and deployment of citizen resources. The key aspects of our collaboration framework in crisis management are based on elements that encapsulate the common characteristics of collaboration as identified in the work of Sying et al. [24]. We have adapted these elements to the context of crisis management as follows:\n1) Goals of collaborations: We aim to enhance the efficiency and effectiveness of evacuation efforts by fostering communication, coordination, and cooperation among stakeholders. These collaborations enable the exchange of accurate, timely, and relevant information, resource allocation, and decision-making, while collaborative and social technologies provide platforms and tools for real-time communication, data sharing, visualization, and tracking resources. Coordination and situational awareness are also important goals in crisis management collaborations. With collaborative and social technologies and platforms, these objectives can be realized by using tools for planning, task assignment, progress monitoring, real-time data collection, analysis, knowledge sharing, capac-ity building, stakeholder engagement, and the documentation, analysis, and dissemination of knowledge.\n2) Collaborators and Actions: Collaborators in crisis management are essential to organize and participate in activities aimed at mitigating the impact of a crisis. Our research has identified several key collaborators, including decisionmakers, citizen-volunteer drivers, and affected people. Regarding particular actions of the collaborators, decision-makers are essential to coordinating and managing the overall evacuation operations. They are responsible for making critical decisions related to resource allocation for citizen-volunteer drivers/vehicles, task assignment to citizen-volunteer drivers, and overall strategy. This involves leveraging the collection and analysis of information, understanding the context of the crisis, and making informed decisions with the aid of technology. Citizen-volunteer drivers, on the other hand, are individuals who own or have access to vehicles and are willing to transport affected people to safe locations during a crisis. They may be called upon to help evacuate individuals from affected areas or transport essential supplies to those in need. Affected people are directly impacted by the crisis and may require assistance with evacuation, sheltering, or access to resources. This group includes individuals who may be injured, displaced, or otherwise affected by the crisis. Collaboration with affected people is crucial to ensure that their needs are identified and addressed in the response effort.\n3) Resources Applied: Effective crisis management requires the mobilization and coordination of different types of resources. In our scope, we categorize resources into three main types: material, human, and dematerialized resources. Material resources include physical tools, equipment, vehicles, and shelters necessary to respond to a crisis. This includes items such as citizen vehicles, search and rescue equipment, medical supplies, and emergency shelters. Human resources involve individuals involved in the response effort, including volunteers and affected individuals (who may need coordination with medical personnel or emergency responders). Dematerialized resources involve non-physical resources, such as data and information, that can be collected, analyzed, and shared to support decision-making and communication among stakeholders. The deployment of dematerialized resources can be the use of collaborative and social technologies to collect and analyze data and information in a timely manner, and share them with the relevant stakeholders to facilitate an efficient and coordinated response effort. By efficiently mobilizing and coordinating these resources, stakeholders can work together to respond to the crisis situation and minimize its impact on affected individuals and communities.\n4) Context of Collaborations: Collaboration in crisis management requires consideration of various contextual factors that can impact the response effort. These factors may include access conditions, weather conditions, environmental conditions, and the time of day. Access conditions, such as the availability of transportation and communication infrastructure, can affect the ability of responders to reach affected people and the ability of affected people to access necessary resources. Weather conditions can impact the ability to respond or evacuate affected people, and environmental conditions such as the presence of hazardous materials can impact the safety of responders and those affected by the crisis. Additionally, the time of day can also be a factor, as evacuation efforts may differ depending on whether the crisis occurs during daylight or nighttime hours. Understanding the contextual factors can help decision-makers, affected people, and citizenvolunteer drivers collaborate more effectively by utilizing relevant contextual information to inform response strategies. Effective collaboration in crisis management necessitates the cooperation of multiple stakeholders and the utilization of technological tools. Communication, coordination, and cooperation are prioritized throughout all stages of the response effort, making the construction of collaborative platforms crucial in facilitating this process and enhancing the overall response effort. We delve into the general architecture for developing computer-support systems for decision-makers during crises.\nThe original architecture of ORec-Cri [11] is composed of four layers: Interaction Layer, Intelligent Layer, Service Layer and Data Layer. Firstly, Intelligent Layer receives data from OpenStreetMap API and Crisis Management Knowledge base, and computes a list of citizen-volunteer driver/vehicle recommendations that satisfy the given constraints, which are displayed to decision-makers through the web-based interface. Then, Service Layer computes the time for each distance between driver/vehicle pairs and rescue points and filters them accordingly. Next, Data Layer contains an ontologysupported knowledge base for the crisis management domain, modeling and storing all necessary information and data [11]. By integrating of social computing into the current system, we define the construction of a novel architecture by adding a new layer called the Social Computing Layer. This layer serves as an information management system during a crisis, and is responsible for collecting and processing data from different sources, such as affected people, citizen-volunteer drivers/vehicles, and decision-makers. The Social Computing Layer will be able to integrate, exchange the data with other layers, making it easily accessible to decision-makers. As shown in Figure 1, the novel architecture for the platform includes the Social Computing Layer as a central component for integrating and exchanging information during a crisis.\nThe integration of social computing into the proposed system can provide a powerful component for crisis management, allowing individuals, affected people, citizen-volunteer drivers/vehicles, and organizations to respond more effectively to crisis events by enabling real-time communication and collaboration, and providing valuable insights into how information is spreading and being received. Besides, integrating social computing can also enhance decision-making by providing direct information and feedback from other agents [25]. This allows individuals, affected people, citizen-volunteer drivers/vehicles, and organizations to adapt their actions to the situations.\nEstablishing communication channels and platforms among various stakeholders in a crisis situation enables the realtime gathering of information about ongoing events. Decisionmakers can capture and contextualize the situation from multiple perspectives, including those of the victims or affected populations, by continually updating information about the number of injuries or receiving reports from citizenvolunteer drivers/vehicles regarding any obstacles or accidents they encounter during rescue and evacuation operations. This collection of real-time information can significantly enhance the decision-making process and enable more efficient and effective participation in response efforts. Therefore, by utilizing collaborative and social technologies to contextualize crises, it is possible to achieve situational awareness, optimize resources, and make efficient decisions. The next section will explore the use of social computing in crisis management for context awareness.", "publication_ref": ["b23", "b10", "b10", "b24"], "figure_ref": ["fig_0"], "table_ref": []}, {"heading": "C. Contextualized crises by social computing", "text": "Figure 1 illustrates the updated structure of our crisis management system with the addition of a Social Computing Layer controlled by the Information management System. In contrast to ORec-Cri proposed in [11], CORec-Cri also allows impacted individuals (victims) to access the system via a Mobile-based Interface. Through the integration of social computing, we aim to facilitate communication and collaboration among the various stakeholders involved in crisis management. This is crucial to contextualize crises and ensure better crisis management. In the following sections, we will provide a detailed overview of how the Social Computing Layer helps to contextualize crises before, during, and after a crisis occurs: (i) Before crisis: citizen-volunteer drivers who are willing to help can register via the Mobile-based Interfaced. Decision-makers may judge whether the registers are qualified to conduct rescue according to the information provided (e.g., rescue experience, detailed information related to their vehicles, etc.). For more details, please refer to [11]. This ensures that the citizenvolunteer drivers (with their vehicles) registered meet up with the constraints predefined. Plain users can also register via the Mobile-based Interfaced so that they can ask for help or release information about the impacted area when crises happen. (ii) During crises: In the event of an emergency, such as a flood, obtaining firsthand information about the impacted area quickly is crucial. Individuals impacted in these areas can assist decision-makers in identifying the location, the number of impacted individuals, and their actual needs (e.g., medical requirements, food, and water), which can be done through the Mobile-based Interface. This information helps decision-makers recognize the priority of each impacted area and the real-time needs in the impacted areas. Once the needs have been identified, decision-makers can issue requests for assistance, and available citizen-volunteer drivers (with their vehicles) can respond through the Mobile-based Interface. It is important to note that ORec-Cri utilizes the information provided by impacted individuals to recommend a list of citizenvolunteer drivers (with their vehicles) to the impacted areas. Additionally, social computing can be used to update the realtime situation in the impacted area, allowing individuals in the impacted area and citizen-volunteer drivers to assist decisionmakers in better allocating various resources. (iii) After crises: The Social Computing Layer not only facilitates communication and collaboration between the various stakeholders involved in crisis management but also enables decisionmakers to release a synthesis report about the rescue process. This report can help citizen-volunteer drivers and impacted people to better understand how decisions were made and how resources were allocated. Additionally, citizen-volunteer drivers and impacted people can provide feedback, comments, and suggestions on the rescue process via the Mobile-based interface. This feedback can help decision-makers to improve their crisis management strategies and processes. That being said, we can significantly improve real-time communication and collaboration between important factors in a crisis, such as victims/affected people, volunteers/drivers, and decisionmakers. With the structure depicted in Figure 1, the following three characteristics [26] that capture the essence of social computing are assured: (i) Community: In CORec-Cri, there are mainly three groups of people: decision-makers, affected people, and citizen-volunteer drivers/vehicles, which can be the collective source of wisdom [26]. (ii) Connectivity: In CORec-Cri, affected people, citizen-volunteer drivers/vehicles, and decision-makers are connected by the mobile-based interface. Affected people can inform decision-makers of realtime information about the affected place; citizen-volunteer drivers/vehicles can inform decision-makers of their availability; at the same time, decision-makers can inform affected people of the process of rescue. These interactions take place in the Intercation Layer and are supported by the Social Computing Layer. (iii) Collaboration: As depicted in Figure 1, the whole system operates by the collaboration of different people. Decision-makers help to allocate the citizen-volunteer drivers/vehicles; citizen-volunteer drivers/vehicles help to rescue affected people; affected people keep decision-makers informed of the real-time information. At the same time, the self-organize efforts [27] of citizen-volunteer drivers/vehicles and affected people may also help to ease the shortage of resources.", "publication_ref": ["b10", "b10", "b25", "b25", "b26"], "figure_ref": ["fig_0", "fig_0", "fig_0"], "table_ref": []}, {"heading": "IV. CASE STUDY AND DISCUSSIONS", "text": "In this section, we describe a scenario where CORec-Cri can be implemented to manage a flood crisis situation in Compiègne city. The Municipal Council has taken measures to prepare for such a crisis by maintaining a list of 50 citizenvolunteer drivers/vehicles and three gymnasiums as shelters for vulnerable people. The information about these resources is entered into the system via a web interface.\nWhen a flood crisis occurs, the person in charge at the Municipal Council initiates necessary evacuation activities. Decision-makers capture the number of people impacted, the priority level of each affected area, and the information about rescue points. The mobilization of public resources has been deployed, but unfortunately, they do not suffice to cover all rescue points. Consequently, the person in charge has decided to reinforce the situation by utilizing citizen resources. Previously, the Municipal Council's agent utilized the mobile-based interface of CORec-Cri to gather information on available citizen-volunteer drivers and vehicle resources. Currently, decision-makers use a web-based interface to input information on the requirements of each rescue point, such as the number of affected individuals and the priority level of the rescue point, to obtain the best list of citizen-volunteer drivers and vehicle resources for each rescue point. Simultaneously, the person in charge can contextualize the crisis by employing the social computing module of CORec-Cri during the crisis, and they can monitor contextual information about the crisis, such as current weather and traffic conditions.\nCORec-Cri creates a collaborative environment that enables decision-makers, citizen-volunteer drivers, and affected people to receive or share important information depending on their context. Specifically, CORec-Cri utilizes a mobile-based interface to inform citizen-volunteer drivers of their assigned rescue point and the recommended trajectory. The system also facilitates real-time information sharing and contextual information, which allows decision-makers to monitor the situation of vehicles and the number of people present at each rescue point during the rescue process. By having updated, real-time information, decision-makers can make appropriate adaptations or interventions in response to unexpected changes in the situation. Citizen-volunteer drivers can also use the system to inform decision-makers of any changes in the rescue point, interruptions in traffic circulation, or inaccessibility to the rescue point. This information can assist decision-makers in making real-time adjustments to their plans At the same time, the use of a social computing module can inform the public about the flood situation in Compiègne. Social platforms can capture specific situation emergences that may not be reported through traditional channels. In particular, incorporating the information management system and media platforms such as Twitter or Facebook, the Municipal Council can communicate with the public and provide updates on the situation, including the status of evacuation efforts, the availability of emergency resources, and other important information. Additionally, individuals impacted by the flood can use these platforms to request assistance or share information about their needs, allowing decision-makers to allocate resources more effectively.\nThe use of collaborative and social technologies facilitates the real-time gathering of information about the situation and enables effective communication and coordination among stakeholders. CORec-Cri has the potential to assist decisionmakers in managing a flood crisis situation efficiently and effectively by providing real-time information sharing, optimizing resources, and facilitating communication among decision-makers, citizen-volunteer drivers, and the public.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "V. CONCLUSION AND PERSPECTIVE", "text": "In this paper, we have presented a collaboration framework for crisis management that utilizes collaborative and social technologies to enhance communication and coordination among various stakeholders. Through CORec-Cri, decisionmakers, citizen-volunteer drivers, and affected people can leverage the benefits of social computing to gather, share, and analyze information about crises. This can help contextualize crises -before, during, and after a crisis occurs -and provide stakeholders with a better understanding of the situation, enabling them to share information in a timely and utilize resources effectively and efficiently. We have also illustrated the practicality of our approach with examples of how it can be applied in real-world crisis situations. Moving forward, there are several avenues for further research and development in the field of crisis management. First, there is a need for more robust and scalable systems that can handle large-scale crises with diverse requirements and constraints. CORec-Cri can be further enhanced by incorporating advanced technologies such as artificial intelligence, machine learning, and data analytics to improve decision-making, prediction, and resource allocation in real-time. Second, there is a need for a more comprehensive evaluation and validation of crisis management systems in real-world scenarios. Field trials and case studies can provide valuable insights into the effectiveness and efficiency of the system in different crisis situations and contexts. This can help in identifying potential limitations, areas for improvement, and opportunities for customization based on specific needs and requirements.", "publication_ref": [], "figure_ref": [], "table_ref": []}], "references": [{"ref_id": "b0", "title": "Collaborative decision-making in emergency and disaster management", "journal": "International Journal of Public Administration", "year": "2011", "authors": "N Kapucu; V Garayev"}, {"ref_id": "b1", "title": "Collaborative crisis management: a plausibility probe of core assumptions", "journal": "Policy and Society", "year": "2020", "authors": "C F Parker; D Nohrstedt; J Baird; H Hermansson; O Rubin; E Baekkeskov"}, {"ref_id": "b2", "title": "Social computing: An overview", "journal": "Communications of the association for Information Systems", "year": "2007", "authors": "M Parameswaran; A B Whinston"}, {"ref_id": "b3", "title": "Event classification and location prediction from tweets during disasters", "journal": "Annals of Operations Research", "year": "2019", "authors": "J P Singh; Y K Dwivedi; N P Rana; A Kumar; K K Kapoor"}, {"ref_id": "b4", "title": "Public health implications of social media use during natural disasters, environmental disasters, and other environmental concerns", "journal": "Natural Hazards", "year": "2016", "authors": "K C Finch; K R Snook; C H Duke; K.-W Fu; Z T H Tse; A Adhikari; I C ; -H Fung"}, {"ref_id": "b5", "title": "Social media in medical and health care: opportunities and challenges", "journal": "Marketing intelligence & planning", "year": "2016", "authors": "W M Lim"}, {"ref_id": "b6", "title": "Social media in disaster risk reduction and crisis management", "journal": "Science and engineering ethics", "year": "2014", "authors": "D E Alexander"}, {"ref_id": "b7", "title": "Harnessing the crowdsourcing power of social media for disaster relief", "journal": "IEEE intelligent systems", "year": "2011", "authors": "H Gao; G Barbier; R Goolsby"}, {"ref_id": "b8", "title": "On critical event observability using social networks: A disaster monitoring perspective", "journal": "IEEE", "year": "2014", "authors": "D.-A Nguyen; T Abdelzaher; S Borbash; X.-H Dang; R Ganti; A Singh; M Srivatsa"}, {"ref_id": "b9", "title": "Citizens' response patterns to warning messages", "journal": "Journal of contingencies and crisis management", "year": "2012", "authors": "T Vihalemm; M Kiisel; H Harro-Loit"}, {"ref_id": "b10", "title": "Constraint-based recommender system for crisis management simulations", "journal": "", "year": "2023", "authors": "N L Lê; J Zhong; E Negre; M.-H Abel"}, {"ref_id": "b11", "title": "Coordination and Collaboration in Crisis Management", "journal": "Springer International Publishing", "year": "2016", "authors": "A Chatham"}, {"ref_id": "b12", "title": "Mobilemap: A collaborative application to support emergency situations in urban areas", "journal": "IEEE", "year": "2009", "authors": "A Monares; S F Ochoa; J A Pino; V Herskovic; A Neyem"}, {"ref_id": "b13", "title": "Promes: An ontology-based messaging service for semantically interoperable information exchange during disaster response", "journal": "Journal of Contingencies and Crisis Management", "year": "2020", "authors": "L Elmhadhbi; M.-H Karray; B Archimède; J N Otte; B Smith"}, {"ref_id": "b14", "title": "Ontology-based approach for designing user interfaces: Application for rescue actors", "journal": "", "year": "2020", "authors": "S Chehade; N Matta; J.-B Pothin; R Cogranne"}, {"ref_id": "b15", "title": "Collaborative technology for coordinating crisis management track report -ct2cm 2011", "journal": "", "year": "2011", "authors": "C Hanachi; F Charoy; S Stinckwich"}, {"ref_id": "b16", "title": "Use of social media in crisis management: A survey", "journal": "International Journal of Disaster Risk Reduction", "year": "2020", "authors": "A Saroj; S "}, {"ref_id": "b17", "title": "Interaction with citizens experiments: from context-aware alerting to crowdtasking", "journal": "", "year": "2016", "authors": "D Havlik; J Pielorz; A Widera"}, {"ref_id": "b18", "title": "Red tape: Attitudes and issues related to use of social media by us county-level emergency managers", "journal": "", "year": "2015", "authors": "L Plotnick; S R Hiltz; J A Kushma; A H Tapia"}, {"ref_id": "b19", "title": "Microblogging during two natural hazards events: what twitter may contribute to situational awareness", "journal": "", "year": "2010", "authors": "S Vieweg; A L Hughes; K Starbird; L Palen"}, {"ref_id": "b20", "title": "Staying connected. social media put to work when disaster strikes", "journal": "Modern healthcare", "year": "2011", "authors": "P Barr"}, {"ref_id": "b21", "title": "Social media in emergency management: Twitter as a tool for communicating risks to the public", "journal": "Technological Forecasting and Social Change", "year": "2016", "authors": "P Panagiotopoulos; J Barnett; A Z Bigdeli; S Sams"}, {"ref_id": "b22", "title": "Rumour detection on social media for crisis management", "journal": "", "year": "2019", "authors": "S Han; F Ciravegna"}, {"ref_id": "b23", "title": "Context-aware recommender system for system of information systems", "journal": "", "year": "2021", "authors": "S Li"}, {"ref_id": "b24", "title": "Collaboration and decision making in crisis situations", "journal": "", "year": "2016", "authors": "A Vivacqua; A C Garcia; J Canós; M Comes; V Vieira"}, {"ref_id": "b25", "title": "A brief survey of computational approaches in social computing", "journal": "IEEE", "year": "2009", "authors": "I King; J Li; K T Chan"}, {"ref_id": "b26", "title": "voluntweeters\" self-organizing by digital volunteers in times of crisis", "journal": "", "year": "2011", "authors": "K Starbird; L Palen"}], "figures": [{"figure_label": "1", "figure_type": "figure", "figure_id": "fig_0", "figure_caption": "Fig. 1 .1Fig. 1. The architecture of CORec-Cri.", "figure_data": ""}], "formulas": [], "doi": ""}
