{"title": "CAPTCHA Types and Breaking Techniques: Design Issues, Challenges, and Future Research Directions", "authors": "Noshina Tariq; Aslam Farrukh;  Khan; Gautam Srivastava", "pub_date": "2023-07-16", "abstract": "The proliferation of the Internet and mobile devices has resulted in malicious bots' access to genuine resources and data. Bots may instigate phishing, unauthorized access, denial-of-service, and spoofing attacks, to mention a few. Authentication and testing mechanisms to verify the end-users and prohibit malicious programs from infiltrating the services and data are strong defense systems against malicious bots. Completely Automated Public Turing test to tell Computers and Humans Apart (CAPTCHA) is an authentication process to confirm that the user is a human; hence, access is granted. This paper provides an in-depth survey on CAPTCHAs and focuses on two main things: (1) a detailed discussion on various CAPTCHA types along with their advantages, disadvantages, and design recommendations, and (2) an in-depth analysis of different CAPTCHA breaking techniques. The survey is based on over two hundred studies on the subject matter conducted since 2003 to date. The analysis reinforces the need to design more attack-resistant CAPTCHAs while keeping their usability intact. The paper also highlights the design challenges and open issues related to CAPTCHAs. Furthermore, it also provides useful recommendations for breaking CAPTCHAs.", "sections": [{"heading": "INTRODUCTION", "text": "The Internet is a primary mode of communication in the modern age of the Internet of Things (IoT) [1]. The availability of a diverse range of mobile devices and more affordable high-speed data subscriptions boosted consumers' interest in Internet use. From its inception, Internet security has been the primary concern of web developers. As the Internet continues to grow for providing various websites, services, and blogs likewise grow. Today's websites are dedicated to the public, transportation, entertainment, financial services, food items, healthcare, and hotel reservations, to mention a few. In this regard, the growing user base also necessitates the deployment of high-end computing power at the websites [2]. However, these high-end processors are rendered ineffective (2) An analysis of state-of-the-art CAPTCHA survey papers (for both construction and breaking) is done, highlighting their contributions and missing research areas in the said domain.\n(3) CAPTCHA practices and applications are discussed, helping readers better understanding the areas where CAPTCHAs may be useful. (4) Based on CAPTCHA formation, exhaustive state-of-the-art study and analysis are presented.\nIn line with CAPTCHA types, advantages and disadvantages accordant with the proposed taxonomies are also provided for engineering better designs. (5) Based on CAPTCHA breaking techniques, a comprehensive state-of-the-art study and analysis are presented to fix the loopholes in CAPTCHA designs that may be exploited by the attackers. (6) In-depth analysis and future prospects of design issues and challenges are imparted encompassing a prolific discussion on CAPTCHA sturdiness and usability.\nIn this survey paper, Section 2 presents related work that provides a comparison among stateof-the-art survey. In Section 3, important CAPTCHA application areas are discussed. Section 4 presents different CAPTCHA techniques based on their formation and design. Challenges and open issues in CAPTCHAs designs are discussed in Section 5. Section 6 represents the survey of state-of-the-art CAPTCHA breaking algorithms. Section 7 presents a productive discussion on CAPTCHA robustness and usability along with the challenges and open issues, and Section 8 gives the conclusion and future directions.", "publication_ref": ["b0", "b1", "b4", "b5"], "figure_ref": [], "table_ref": []}, {"heading": "RELATED SURVEYS", "text": "This section briefly discusses state-of-the-art surveys from 2010 to date. Table 1 presents a comparison between state-of-the-art and this paper. We compared contributions and the subject matter, such as the survey about CAPTCHA types, attacks on CAPTCHAs or both. It is also investigated that the survey has proposed any taxonomy of CAPTCHA types or its breaking techniques or not. That helps readers to understand the subject matter in a modular way. It is also essential that a survey discusses challenges and open issues associated with the subject matter from our perspective. That helps the readers to find the gaps and future research directions.\nMagdy et al. [21] presented a survey on CAPTCHA types and breaking techniques. Though they have discussed its different types and limited usability issues; however, the survey is not comprehensive. Kumar et al. [22] presented a systematic survey on CAPTCHAs. This paper encompasses a good discussion of different CAPTCHAs and their breaking. However, types and attacks are not classified as the techniques used in their breaking. Moreover, it does not discuss challenges and open \n✓ × × × × × [20] 2022 ✓ ✓ ✓ × × × [21] 2021 ✓ ✓ × ✓ × × [22] 2021 ✓ ✓ ✓ × × × [23] 2021 × ✓ × × × × [24] 2021 ✓ × ✓ × × × [25] 2019 ✓ ✓ × × ✓ × [26] 2020 ✓ ✓ × × × × [27] 2020 × ✓ × × × × [28] 2016 ✓ × ✓ × × × [29] 2018 ✓ × × × × × [30] 2018 ✓ ✓ × × × × [31] 2013 ✓ ✓ × × ✓ × [32] 2015 ✓ × × × × × [33] 2010 ✓ × × × × × [34] 2011 ✓ ✓ × × × ×\nissues in CAPTCHA designing and breaking. However, our paper provides a more comprehensive survey on CAPTCHA types and breaking techniques. Still, it also discusses challenges and open issues in this regard, along with the recommendations for designing and breaking CAPTCHAs. Zhang et al. [25] discuss the advancements made scientifically and technologically on CAPTCHAs' design and attacks. They discussed the usability, robustness, and limitations of different types of CAPTCHAs. Besides, the attack techniques and differences between the formation of CAPTCHAs are categorically debated. This paper discusses recommendations for future studies and suggests several issues that require extra analysis. However, a taxonomy of types and breaking techniques is not presented.\nThe CAPTCHA usability and its progression technology are also assessed in [26]. It examines the CAPTCHA mechanisms from usability and security aspects, unlike other studies that have been done on it. The introduction of new CAPTCHA formats (game CAPTCHA) and attacking methods (deep learning-based attacking) are also included in this paper. However, they do not present a taxonomy and a discussion about challenges and open issues. Besides, [27] carries out methodical investigation and categorization. The study is based on the ultramodern ML-based method for self-operating text-based CAPTCHA breaking issues. An investigation into the present status and robustness of text-based CAPTCHA is also presented. The present-day Internet users use it to counter ML-based automated breaking tools in this paper. This literature also recommends that ML-based as a breaking tool is very efficacious because of its speed, precision, and reverie in the CAPTCHA solution. This paper encourages combatting the issues associated with current internet services and ML-based methods; a reverse Turing test is encouraged in this paper. Reverse Turing systems are recommended because they offer less stress to human users and give computer/robots challenging problems. However, the paper does not present a taxonomy of the CAPTCHA types or their breaking techniques. It also lacks in discussing challenges and open issues in this regard.\nCAPTCHA types, their usability, and deficiencies are discussed in [28]. However, this survey focuses on CAPTCHA types only. Moreover, it does not discuss attacks made on CAPTCHAs. It also does not present a taxonomy and the challenges and open issues associated with CAPTCHA types. [29] compares CAPTCHA and completely automated public physical test to tell computers and humans apart (CAPPCHA). CAPPCHA and CAPTCHA are alike because they are both used to protect websites from abusive automated programs. As discussed in this paper, CAPPCHA improves the authentication technique required for mobile devices. Besides, a proof of concept is also provided. However, an extensive analysis of the subject must be carried out to confirm the efficiency of CAPPCHA. Therefore, this paper aims to thoroughly investigate CAPTCHA's officiousness and its usability involving several human users. However, this paper also does not talk about CAPTCHA breaking techniques, taxonomy, and challenges.\nIn [30], keywords, such as; login, cart, registration, account, post, auth, join, register, sign, password, and subscribe, were used by a personally web designed crawler. The crawler makes use of a beautiful soup library to investigate 30,000 websites and check if they use CAPTCHA to protect their URLs. This paper also examines and categorizes CAPTCHA as regards its limitations. Out of 30,000 web pages, only 10,017 uses CAPTCHA. According to the facts provided by this survey, the most used CAPTCHA includes; text/image-based CAPTCHA, reCAPTCHA, text-based CAPTCHA, math, slider, FunCAPTCHA, custom, and audio-based CAPTCHA. However, taxonomy and open issues are not addressed in this paper. [31] discusses three essential things. They include; recent CAPTCHAs and associative attacks, the inquiry into the vigor and usefulness of recently introduced CAPTCHAs, and propose new techniques to improve recently introduced CAPTCHAs. However, the paper does not suggest a taxonomy. [32] explores substitutes of CAPTCHA, usability, and services provide researchers with enough information so that new techniques and solutions can be suggested. Thus far, the positive strides made in CAPTCHA advancements, various CAPTCHAs substitutes, were categorized, evaluated, and compared with their shortcomings. Solutions to the shortcoming were also proposed. However, CAPTCHA breaking is out of the scope of this paper. Besides, there is no proposed taxonomy, and no discussion on open issues are discussed either.\nFrom the human standpoint, [33] extensively reviews CAPTCHAs to gauge how much an average user is affected by CAPTCHA. However, this paper focuses only on CAPTCHA types. There is no taxonomy presented. There is no discussion on open issues and challenges presented in the paper. Similarly, Bandy et al. [34] presented a classification of CAPTCHAs and compared its different kinds. The CAPTCHAs are classified and compared as regards their usability and security. Conventional methods for generating and breaking text and image-based CAPTCHA are also introduced. Lastly, this paper recommends various ways to enhance vigor, usability and to tackle security issues. However, taxonomy and open issues are not discussed.", "publication_ref": ["b20", "b21", "b24", "b25", "b26", "b27", "b28", "b29", "b30", "b31", "b32", "b33"], "figure_ref": [], "table_ref": ["tab_0"]}, {"heading": "CAPTCHA PRACTICES", "text": "There are several CAPTCHA practices and applications; this section highlights some of the most common practised CAPTCHA applications below:\n3.1 Mitigating e-mail (address) security and spams Ahn et al. [35] described how web scrapers (programs that extract data from websites) might be prevented from obtaining users' e-mail addresses by requiring them to answer a CAPTCHA prior to revealing their e-mail addresses. It may also be used for the prohibition on the use of fake e-mail addresses. Most businesses offer complimentary e-mail services in today's information era. They are the targeted victims of bot assaults. Numerous businesses adopt such methods to obtain complimentary e-mail addresses to distribute spam. A most effective yet simplest way of avoiding unwanted bot assaults is to utilise CAPTCHA-based security. Pope and Kaur [36] highlighted that the majority of e-mail providers had implemented such an approach.", "publication_ref": ["b34", "b35"], "figure_ref": [], "table_ref": []}, {"heading": "Phishing Attacks Prevention", "text": "Phishing is a technique used by unethical attackers (e.g., hackers and crackers) to gain access to online banking, e-voting, social media, and e-mail accounts by displaying a similar false web page to the account owner [37] [15]. For instance, these attackers send a link to certain targeted account holders through the e-mail accounts, and by clicking the link, they submit sensitive details, such as usernames and passwords. It results in the loss of confidential information such as official records or project bids. Phishing attackers collect bank information such as usernames, passwords, and credit/debit card information. Certain websites are legitimate financial websites, and some are duped into providing personal and private web to these false websites. These attackers do not utilise their method to break internet accounts, which makes the tracking very challenging. Additionally, cyber law is not sufficient to prosecute such unethical hackers [22]. Under such cases, certain countermeasures must be adopted in conjunction with a strong authentication process. Hence, CAPTCHA is inevitable in both bot and phishing attack scenarios.", "publication_ref": ["b36", "b14", "b21"], "figure_ref": [], "table_ref": []}, {"heading": "Banning robots from playing games", "text": "Using the CAPTCHA is easier than previously thought to restrict online bot gaming. It is extremely simple to keep robots and computers from playing online games, as found by [37], [38], and [39].", "publication_ref": ["b36", "b37", "b38"], "figure_ref": [], "table_ref": []}, {"heading": "Ensuring a strong internet protection", "text": "A recent online paper outlined the theory of dictionary attack, which aims to find the passphrase or password of an authentication system by accessing probable alternatives. CAPTCHA is particularly efficient in protecting against such dictionary assaults in these types of circumstances, according to [40], [41], and [42].", "publication_ref": ["b39", "b40", "b41"], "figure_ref": [], "table_ref": []}, {"heading": "A way to handle worms and spam", "text": "CAPTCHA is used to combat worms and spam and accept mail only if no computer program is present, proving that humans are behind it [21], [43], and [44].", "publication_ref": ["b20", "b42", "b43"], "figure_ref": [], "table_ref": []}, {"heading": "Stronger password security", "text": "Attempting to enter the password after too many incorrect tries may result in an account being locked, but this is not a superior approach. Ahn et al. [45] claim that if a computer program tries to complete a task, it may be overridden by requiring the user to input a CAPTCHA to demonstrate that it is a person and not a computer program.", "publication_ref": ["b44"], "figure_ref": [], "table_ref": []}, {"heading": "A search engine bot's barrier", "text": "Pope and Kaur [36] and Kim and Luke [46] pointed out that if a business wants its web pages to remain undisturbed, CAPTCHA will help to block computers from indexing the sites.", "publication_ref": ["b35", "b45"], "figure_ref": [], "table_ref": []}, {"heading": "Keep automatic online polls to a minimum", "text": "CAPTCHA may also be used to prevent a computer program from voting in online polls. The claims of [45] and [36] asserted that even while it cannot be used to prevent a person from voting more than once, it cannot be used to allow them to vote more than once either.", "publication_ref": ["b44", "b35"], "figure_ref": [], "table_ref": []}, {"heading": "A Rejecting Shopping Agent Solution", "text": "This kind of software is quite popular today: You may build one that provides you with a full cost comparison from many comparable websites, for example, trivago or makemytrip [22]. Since the customer cannot view all the ads from these online shops, the online stores lose out. Rejecting this kind of program from disclosing pricing information is extremely successful using the CAPTCHA [47].", "publication_ref": ["b21", "b46"], "figure_ref": [], "table_ref": []}, {"heading": "CLASSIFICATION OF CAPTCHAS BASED ON THEIR TYPES", "text": "The CAPTCHA schemes may be broadly classified into Optical Character Reader (OCR) and non-OCR CAPTCHA formations. They can further be classified into different types, as shown in Fig. 2. This section presents different CAPTCHA schemes classified based on OCR-based and Non-OCR CAPTCHAs, along with each approach's pros and cons.", "publication_ref": [], "figure_ref": ["fig_1"], "table_ref": []}, {"heading": "OCR-Based CAPTCHA Schemes", "text": "This section presents the most commonly OCR-based CAPTCHA schemes.", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Text-based CAPTCHAs.", "text": "In 1997, the first bot attack was made on Alta Vista that submitted automated URLs. Therefore, distorted arbitrary text CAPTCHAs were generated by Andrei Border to deter bots [48]. Text-based CAPTCHAs are categorized as reading-based CAPTCHAs. The user reads a text made up using only letters or a random combination of numbers or letters and inputs them into a given box in the same sequence [49]. It is quite troublesome for a computerized program to read twisted letters or numbers from clutter. This clutter could consist of anything like a grid, noise, shapes, lines, hues, shades, or contrasting colors. These CAPTCHAs are broadly used by many websites such as Google, rapid-share, MSN, Yahoo, YouTube, and Badongo. An example of a text-based CAPTCHA is shown in Fig. 3 [50].  Gimpy-r and EZ-Gimpy are a few examples of a text-based CAPTCHA, as shown in Fig. 4 and 5 [51]. In Gimpy, an image is shown with the variegated text, and the user has to input three different texts or words by looking at them [52]. reCAPTCHA is another severe form of a text-based CAPTCHA. Text-based CAPTCHA's benefit lies in its formation, where simple 4-8 letter words or arbitrarily written letters or numbers may be used. It is not very complicated for a user to recognize; however, it might not be the case as development has been done to make them robust. The deformation and noise are enhanced to make it attack-resistant, making it difficult for users to understand and recognize the letters. People with visual restraints may also find it cumbersome and fail. Moreover, if dictionary-based words are used, a huge database is required. They are also vulnerable to various attacks [53], [54], [55]. Most of the attacks on text-based CAPTCHAs are based on OCR techniques. Therefore, the designing of a robust text CAPTCHA is inevitable [56]. Similarly, Shao et al. [57] proposed an attack-resistant text based-CAPTCHA using adversarial examples.\n4.1.2 3D CAPTCHAs. Many websites have employed the 2D text CAPTCHAs to protect themselves from automated bots. These CAPTCHAs are designed using random characters, symbols, and numbers in a 2D space format, as shown in Fig. 1 [58]. The most significant disadvantage with these approaches is that they can easily be cracked through automated offline post-processing attacks [58]. These approaches work by segmenting the whole CAPTCHA and then recognize each character individually. Many attempts have been made to improve security by including dots and lines across the CAPTCHAs. Deep Neural Networks (DNNs) for cracking the 2D CAPTCHAs have posed severe security threats with an accuracy of 83% [59]. The use of 2D text CAPTCHAs can easily be compromised with improved OCR technology. [60] is a new type of text-based CAPTCHA known as DotCHA, which depends on human interaction. In this approach, the user has to rotate the 3D text model to identify the correct letters. In nature, the 3D text model is the twisted and sequential 3D text having a centre pivot axis, which depicts different letters upon rotation. This type of CAPTCHA is protected from segmentation attacks. It is composed of different spheres of each letter, i.e., it is a scatter-type CAPTCHA. This type of CAPTCHA is also protected from machine Learning (ML) attacks due to its unique working way. 4.1.3 Hand-written CAPTCHAs. Lin and Wan [61] gave an idea of a synthesized form of handwritten CAPTCHAs. GUI interface to accumulate and build samples. Mori et al. [62] used a method that produces samples of naturally written characters. Parvez et al. [63] proposed an Arabic handwritten CAPTCHA scheme based on the 'segmentation-validation' generation. Recently, another example is presented inusing Hindi language. One such example is shown in Fig. 7 [64]. One main advantage of hand-written CAPTCHA is that it is challenging for a computer to apply techniques like segmentation, making it grueling to recognize. However, collecting samples of hand-written words is a real problem. The size of the collection and maintaining the dataset is a large problem. It is also vulnerable to attacks, such as brute force dictionary attacks. Another issue with hand-written CAPTCHAs is the cursive writing that can also make it a little problematic for humans to identify [65].", "publication_ref": ["b47", "b48", "b49", "b50", "b51", "b52", "b53", "b54", "b55", "b56", "b57", "b57", "b58", "b59", "b60", "b61", "b62", "b63", "b64"], "figure_ref": ["fig_2", "fig_3", "fig_0", "fig_6"], "table_ref": []}, {"heading": "Hollow CAPTCHA", "text": "Another newly emerged text-based CAPTCHA is hollow. These CAPTCHAs are deployed by many well-known websites like Yahoo!, Tencent, Sina, China Mobile, and Baidu. It uses contour lines as its' main feature in fabricating the connected hollow characters. The main aim of these contour lines is to improve the security and usability of the scheme. The standard segmentation and recognition techniques fail to break connected characters. Hollow CAPTCHA models come in different designs with various design features, such as use interference arcs, varied lengths, and thickness of hollow portions and randomly-generated contours. However, too much teeming and overlapping may confuse character pairs, compromising its usability [66][67], as illustrated in Fig. 8.", "publication_ref": ["b65"], "figure_ref": ["fig_7"], "table_ref": []}, {"heading": "Non-OCR CAPTCHAs", "text": "This section presents Non-OCR CAPTCHA schemes.   [68]. The user has to identify and select a specific picture from several listed images, as shown in Fig. 9 [18]. It uses advancements in the field of image identification and blew out the inherent issues of text-based CAPTCHAs. One such example is presented in [69] using adversarial perturbation and they used Convolutional Neural Network (CNN) for its security analysis. Initially, Chew and Tygar [70] used labeled allied images in Google Image Search. After that, Ahen and Dabbish [35] established labels in \"ESP Games. \" However, these required classes of objects and a substantial database. Similarly, images of Kittens were utilized by Oli Warner [71]. Once again, the issue of a small database size arose. However, playing with pictures is simpler and more efficient as they are less distorted and deformed; hence they are agreeable.\nAfter that, ASIRRA \"Animal Species Image Recognition for Restricted Access\" [72] arrived with a three million images database prepared by Petfinder.com. This database had two distinctive picture types (cats and dogs), which were real and innocuous, as shown in Fig. 11. The test was simple as the user simply differentiates a cat from the list of dogs. This test provided 99.6% usability relief, which the user can solve in less than 30 seconds. Compared to other CAPTCHAs, ASIRRA used attractive images; however, an algorithm and a centralized web server must be generalized and confirmed. Pictures require more storage as the database has to be maintained and displayed on-screen. There are many image-based CAPTCHAs found in literature [73] [74] [75] [76]. An example is shown in Fig. 12. Another approach is presented by Kwon et al.in [77]. The same authors proposed another image-based CAPTCHA [78] based on adversarial example processes, such as FGSM, I-FGSM, or DeepFool. Another type of two-way image-based CAPTCHA is proposed in [79]. The proposed scheme used a homography transformation to match two given images.", "publication_ref": ["b67", "b17", "b68", "b69", "b34", "b70", "b71", "b72", "b75", "b76", "b77", "b78"], "figure_ref": ["fig_11", "fig_12"], "table_ref": []}, {"heading": "Audio", "text": "CAPTCHAs. Data can be perceived in the sense of visual portrayal as well as in the form of audio [80]. However, image-based CAPTCHAs are less preferred over audio CAPTCHAs  as some visually impaired people also utilize the Internet. Consequently, sound CAPTCHAs were created to help visually impaired users [81], [82], [83]. Diverse speakers speak letters or numbers after a certain time interval. The user inputs the correct number or letter in a file. Automated speech recognition (ASR) software is utilized for this functionality. Background noise is used to mystify it [81]. Audio CAPTCHAs may be made more robust using audio-based watermarking techniques [84]  Shahreza et al. [85] proposed a non-OCR CAPTCHA for visually impaired users based on Text-To-Speech (TTS) system to generate a mathematical question, and then converting it to speech. One advantage of this particular method is that automated software needs to make itself familiar with speech-based questions. In order to solve the problem and answer the questions, it needs to be smart enough. One other advantage is that a visually impaired person would not have to input long words. Just a number as a reply would be enough. Hence, it saves time as it is easy to knob.\nHaichang et al. [86] used waveform diagrams for the spoken phrases or words to help the user. The phrase or word is arbitrarily made or chosen from different types of books. Such sentences appear on the screen, and the user is asked to speak them out loud. At that point, it is decided that whether the speaker is a bot or a human. This strategy analyzes sound characteristics and exploits the discrepancy between a simulated machine speech and humans. It offers a high sanctuary; however, this particular scheme's problem is settling on synthetic sound software. The issue with audio CAPTCHAs is background noise, which might affect the user's hearing acuity. We may also say that accent problems may also occur and impact recognition for non-native users. Another issue is that most audio strategies utilize audio files, which determines its span and challenge [86] [17]. Similarly, four different types of audio CAPTCHAs are proposed by Fanelle et al. [87] with improved precision and speed. An example image is shown in Fig. 13. They conducted worldwide experimentation in three-sessions with 67 PVIs. Shekhar et al. [88] proposed a robust CAPTCHA scheme, resistant to Deep Learning (DL) and ML attacks.  ) is displayed in different places randomly without overlapping in different places and is used after minor alternation. This objective approach is to spot the desired picture and then guess is complicated for a computer. Identification is not an easy process. The computer must be well-versed with the picture's knowledge and shapes. It has to track down the precise position of the picture displayed on the screen. Thus, resistance brews against their attacks. Such a method can be carried out on other devices with touch screens. Though it is easy to use, it still requires a database of a fixed amount of pictures that inevitably will be repeated. Another novel collage-based CAPTCHA, SCAPTCHA, is proposed in [91]. An example image is shown in Fig. 15. It is based on different artifact segments and associated metadata, such as sizes and positions. However, users need to answer the questions associated with the CAPTCHA. ", "publication_ref": ["b79", "b80", "b81", "b82", "b80", "b83", "b84", "b85", "b85", "b16", "b86", "b87", "b90"], "figure_ref": ["fig_13", "fig_16"], "table_ref": []}, {"heading": "Mouse-intrusion", "text": "CAPTCHAs. Among CAPTCHA breaking schemes, a text-based CAPTCHA breaking scheme is the most profitable. It is the success rate that is greater than the others. Therefore, the idea of 'Drag and Drop' CAPTCHA was introduced by Desai and Patadia [92]. Example images are in Fig. 17 and Fig. 18. For such kinds of CAPTCHA, mouse intrusion is mandatory. It follows the Artificial Intelligence (AI) technique. A simple mouse-intervention CAPTCHA image is shown in Fig. 16 [93]. Complicated or intricate types of CAPTCHAs usually use redirection and laundry attacks where the CAPTCHA is diverted to 'human sweatshop' after which hired humans are used so the computer can solve it [94]. In [95], another click-based CAPTCHA scheme is brought forth. The mouse clicks help identify a human by analyzing the clicking on certain image components [96]. It also does that through the process of dragging and dropping a letter on the destination. The need for a keyboard in this is nil [96]. According to this approach, the users drag and drop the letters at appropriate place. In this approach, technological scrutiny is not mandatory that ends in relief for the users [97]. 'DND' CAPTCHAs do not require any noise and chaotic backgrounds, making it apt in bandwidth use [92]. Developed in JavaScript, HTML, and Java applets make it comprehensible, easy, and simple to design and needless bandwidth. A similar approach is proposed by Shah et al. [98], recently.  Another click-based graphical CAPTCHA is presented in [99]. Such CAPTCHAs are vital and robust [92], [97], [100]. However, it requires the user to properly fall through with the order and the character's exact destination. Another technique involves displaying a panel of changing colors. The user, as soon as the green color is shown, has to click the button [93]. The mouse is also used in Bongo sentences where the clicks help the user find and then type it in the respective place [92]. Likewise, game-like CAPTCHA is proposed in [101] for intrusion detection providing account authentication. Based on flash-gaming, another gaming CAPTCHA is proposed in [102].", "publication_ref": ["b91", "b92", "b93", "b94", "b95", "b95", "b96", "b91", "b97", "b98", "b91", "b96", "b99", "b92", "b91", "b100"], "figure_ref": ["fig_18", "fig_19", "fig_17"], "table_ref": []}, {"heading": "Question-based CAPTCHAs.", "text": "A new approach uses arithmetic problems by keeping four essential abilities that humans possess [103]. This approach involves understanding the question's text, disclosing question images, comprehending the problem, and then solving it. The arithmetic problem, to the user, is presented as an image. For example, see 19 [104]. Question-based CAPTCHAs are formulated to overcome the limitations of both OCR-and Non-OCR-Based CAPTCHAs [104], [105].\nGimpy method [106] was introduced in OCR-based CAPTCHA to take any word from the dictionary to use as CAPTCHA. Though, it was not scalable with only 850 words in the dictionary. To lower the quality of a word to be used as CAPTCHA, a pessimal print method [107] was used. However, they are also liable to hacking. The method proposed that in [108] would surmount the problem. This method also makes it easy, so that, non-English speakers can benefit from it. After this new approach [107], Implicit CAPTCHA [108] would not be in use. It is also a very costly method. To make it hard for computers to be acquainted with the speech, Text-to-Speech method [109] is used. However, the user has to make certain calculations, which people are not well-versed with it. This method is used both by the OCR and non-OCR techniques, for a bot has to go through more calculations. At times, the images can be extremely incoherent and can lead to incorrect entries by the users.", "publication_ref": ["b102", "b103", "b103", "b104", "b105", "b106", "b107", "b106", "b107", "b108"], "figure_ref": [], "table_ref": []}, {"heading": "Video CAPTCHAs.", "text": "A novel content-oriented video CAPTCHA was enlisted to increase user security from 70% to 90% and reduce attacks with only 2% [110]. However, in this approach, video labeling is required. Every time that a video is uploaded on YouTube, it is usually tagged by it is loaded. Accordingly, every time a user plays the video, they need to type three different words, for that certain video, to describe the video. A video will be played if any of the three words match the stored database related to that video. However, the users get irritated due to wrong entries. By ensuring the Kerchkhoffs' Principle, tests are produced and checked automatically. All of the tests need to be solved with minimal exertions put by humans. Finally, it must be very challenging for the machine to be algorithmically solved [110]. An example of video CAPTCHA is given in Fig. 20. It must be noted that this examination was conducted on a minimal scale video database; it would be ineffective to expand its size. Thus, for large scale video collection, the results would not be reliable. Video-based CAPTCHA solutions are discussed in [111], where the text is embedded in a matter of seconds of flash video. However, the users, even without watching the whole clip, may recognize and remember characters instantly. Another problem is the equipment and software needed, such as the availability of a flash player or a compatible decoder. Therefore, the absence of such facilities can make a video playing a failure.\n4.3.7 SKETCHA: A Drawing CAPTCHA. As compared to computers, humans are much better at recognizing 3D images. A new CAPTCHA called \"sketcha\" was devised by Ross et al. [112], with a huge database to display a 3D image in different rotations, as shown in Fig. 21. To bring it to 90 degrees, the user has to click. It is very accessible and friendly to the user, as a user can comprehend drawing more than photographs [113]. However, overlapping, deformation, or addition of clutter is not required in the image, which makes a drawing CAPTCHA coherent and apparent. They are more user-friendly and have no language dependency [112]. The 3D approach makes it difficult for the machine by giving different picture styles [114]. Though, to bring the image to 90 degrees, several clicks may be needed, as shown in Fig. 10. However to save the images, a database is also required.    Ultimately this effective strategy helped to get exceptionally credible experiments that gave positive results. This technique owns two integral benefits, i.e., human's entertainment and playing become meaningful. Secondly, the game programmers take leverage when the game logo is displayed several times. The CAPTCHA is further segregated into different levels for users to choose from based on their convenience. In order to make CAPTCHA look a little more complicated and intrigued, more detail is added. It may be fun, however, at the same time, strenuous as well. Manar et al. [116]    4.3.9 Hybrid CAPTCHA schemes. This section presents different CAPTCHA approaches based on mixed-use formations, such as text and audio, text and multimedia, and special purpose CAPTCHA schemes. Some examples of hybrid CAPTCHA may be found in [117], [118], and [119]. A taxonomy of hybrid CAPTCHA scheme is shown in Fig. 27 and the types are discussed below:  -CAPTCHAs as Public key: All types of CAPTCHAs, whether OCR or non-OCR, are used for bot attack prevention. In Man-in-the-Middle (MitM) attack situation, they fail in securing the resources. Keeping such scenarios in mind, public-key embedded CAPTCHAs are introduced by Samir Saklikar [120]. To ensure the validity of such CAPTCHAs, public key installation is a mandatory process along with the surety of a secured channel. However, handshaking and public/private keys pose communication overhead in such schemes. -Audio-visual CAPTCHA: This kind of CAPTCHA scheme is appropriate for illiterate persons. Tariq and Khan [15] proposed a novel hybrid CAPTCHA scheme based on images and related sounds. This approach is based on the cognitive abilities of human users. It is a user-friendly approach; however, databases of images and sounds are required. Similar work examples are [121] and [122]. -Tree-based hand-written CAPTCHA: This CAPTCHA scheme is based on the combination of text and graphics. It exploits the reading abilities of human users. A synthetic hand-written tool is used along with some random transformations to generate a tree structure test [123] randomly. However, an understanding of the tree structure is required. -CAPTCHAs for smart devices: Ubiquity of Internet browsing in smart IoT devices has led to the design of CAPTCHA with special features. Due to constrained resources like memory and energy, it is inevitable to design light-weight CAPTCHAs. These schemes should promote certain characteristics of touch-screen devices [124], [125]. Highlighting CAPTCHA [126], multilingual highlighting CAPTCHA [127], CAPTCHA zoo [128] and seeSay and hearSay CAPTCHA [129] are few examples of such domain. -CAPTCHAs for Mobile devices: There are some specially designed CAPTCHAs for mobile devices. They make use of touch screens and the sensors embedded on the device. Such examples encompass [130], [131], [132], [133], [134], and [135].  [122], [17], and [136]. Another CAPTCHA scheme specifically presented for children in [137]. -CAPTCHA-based passwords: Alajmi et al. [41] presented a CAPTCHA-based password authentication mechanism using AI problem. Another video-based CAPTCHA is proposed in [47]. This scheme is proposed as a graphical password scheme. Muhammad et al. [138] also proposed a graphical password scheme using click-based CAPTCHAs. Khan et al. [139] also proposed a graphical password scheme for security using CAPTCHA. A detailed study on CAPTCHAs as graphical passwords is presented in [140].", "publication_ref": ["b109", "b109", "b110", "b111", "b112", "b111", "b113", "b115", "b116", "b117", "b118", "b119", "b14", "b120", "b121", "b122", "b123", "b124", "b125", "b126", "b127", "b128", "b129", "b130", "b131", "b132", "b133", "b134", "b121", "b16", "b135", "b136", "b40", "b46", "b137", "b138", "b139"], "figure_ref": ["fig_21", "fig_22", "fig_10", "fig_30"], "table_ref": []}, {"heading": "CHALLENGES AND OPEN ISSUES IN CAPTCHAS DESIGNS", "text": "A CAPTCHA is considered good if it is easy for humans to solve and resist potential attacks. However, designing such CAPTCHAs is a difficult task. A CAPTCHA is considered usable if it is easy for human users. It is considered strong if it resists computers and with a success rate as low as 0.01% [141]. Most of the CAPTCHA breaking techniques are designed for text-based CAPTCHAs, as it is widely used [142]. To improve the user-friendliness of CAPTCHA, the presentation of its user interface needs to be up to par. There is a myriad of qualities that affect the practicality of CAPTCHAs [143]. Some of which are; font size, font style, and image size. Problems usually arise when humans do not easily recognize the font style and situations that look similar. For instance, a sizeable font is the most suitable in text-based CAPTCHA as it improves human users' clarity.\nSimilarly, the size is a fundamental property of image-based CAPTCHA as it also improves usability. Small images are preferable because they depreciate server-processing time, increase the download process, and inhabits smaller spaces in webpages [144]. However, large images are more precise and more descriptive for human users. They also improve the security prowess of the CAPTCHA and reduce the probability of speculations [145]. Furthermore, the importance of sizeable images is of high importance. A resolution must be made between usability and vigor.\nAudio-based CAPTCHA is quite different from its other CAPTCHA counterpart, as it does not depend on presentation. Some studies have shown that audio-based CAPTCHA might be complicated for visually impaired users. Bigham and Cavender [146] debated that most current audio CAPTCHAs are exasperating for visually impaired users. The latter use screen readers to understand CAPTCHA. The rationale behind the debate is that navigation elements cause them to lose concentration and fail to hear the CAPTCHA's beginning, even as they try to listen and answer the CAPTCHA questions. The load time can be altered about the user's network constraint to improve the image's usability-and motion-based CAPTCHAs [147] [148]. Conversion of the animation quality and dimensions to the grayscale can improve performance.\nThe inference that can be drawn from this is that intellectually disabled users are faced with more difficulties, followed by visually impaired users [149]. The rationale behind this inference is that intellectually disabled users do not understand CAPTCHAs. For the visually impaired, most CAPTCHAs are understood through a visual canal. Although several steps have been taken to improve CAPTCHAs' accessibility for disabled individuals, complete eradication of the problems will make CAPTCHAs more accessible by computers and robots. The use of substitute methods instead of CAPTCHAs to avoid spam should be significantly considered. Because after the analysis done on the subject, substitute methods handle accessibility hurdles better [150].\nTo enhance CAPTCHA usability and assist human users in identifying aim objects in noisy backgrounds, zooming. Color filtering tools should be made available. Unavailability of the listed tools can frustrate human users because of background noises in the suggested CAPTCHA, which is the same as some Unicode characters in terms of shape, color, and location [31]. The importance of colors in improving CAPTCHA usability cannot be overemphasized as color eases human identification and confound OCR systems [151], [141]. Although colors have their usefulness, one has to be careful in their application, impairing security and usability. The perplexity associated with exploiting desirable color patterns and arrangements is one of the adverse effects on human usability. Another adverse effect is the inability to counter-attack.\nThere is a constant comparison between CAPTCHA and other substitute methods [32]. These substitute methods, while some may be more efficacious, user friendly, and secure than CAPTCHA. CAPTCHA is still the most common method among users, such as security administrators and business owners. Nevertheless, some substitute methods like spam detection and Askimet plugs are prevalent among users [152]. The rationale behind this penchant is explained below:\n• Most administrators use third-party solutions [153]. They do not code their CAPTCHAs from the beginning on the premise of vigor, popularity, cheap execution charge, and low management overhead. Except in crucial and delicate situations, the rationale behind the use of substitute methods is not feasible. • Most administrators are unaware of the new substitute methods, and there is not enough information about them [32]. Nevertheless, there are third party solutions that provide substitutes to users, unlike CAPTCHA. The substitute methods are still upcoming in terms of their diversity and popularity viewpoint. • The fact that most of these substitute methods are not adequately organized and packaged is responsible for most users not using them. The unavailability of these features decreases their usability and makes them informal. • Website owners should continue using substitute methods because of CAPTCHAs' effect on accessibility, conversion rate, usability, and user satisfaction. Managers that are aware of the consequences of using CAPTCHAs and, at the same time, unaware of substitutes have removed CAPTCHAs from their websites. They now care about their users than they do attackers [32].", "publication_ref": ["b140", "b141", "b142", "b143", "b144", "b145", "b146", "b147", "b148", "b149", "b30", "b150", "b140", "b31", "b151", "b152", "b31", "b31"], "figure_ref": [], "table_ref": []}, {"heading": "Performance analysis", "text": "Since time immemorial, the text-based CAPTCHA has been the most preferred type of CAPTCHA.\nAlthough it is unsafe in recent times, text-based security can still be improved using various means due to its wide usage and complexity. These means may include; use of font styles or noise. Recently, the most widely used CAPTCHA is image-based. It is advantageous in the sense that it is easier to use than its text-based counterpart. However, this CAPTCHA might be prone to adversarial attacks; there is still room for improvement. The most uncommon type of CAPTCHA is the audio/videobased CAPTCHA. Its atypicality is owed to the premise that it requires higher bandwidth and does \n× × ✓ × High Low [102] Non-OCR Flash-based × × ✓ × Medium Medium [120] Non-OCR Hybrid ✓ × × × High Medium [154] OCR reCAPTCHA ✓ ✓ ✓ ✓ Low Low [155] Non-OCR Audio ✓ × × × High Medium [156] Non-OCR Mouse Intervention × × ✓ × High Low [157]\nNon-OCR Turing test using pessimal print ✓ ✓ × × High Low not save time. Above all, they get broken with ease. Based on our study, the performance analysis of different CAPTCHA schemes is illustrated in Table 2. Similarly, a comparison based on different CAPTCHA characteristics is presented in Table 3.\nWe observed that the OCR-based CAPTCHAs are mostly dictionary-and database-based. The trade-off between usability and robustness is the main challenge in the design of a CAPTCHA. Text-based CAPTCHAs are the ones that are most frequently used by several websites and webbased applications. Text-based CAPTCHAs are mainly preferred due to low latency and storage costs. However, they are more vulnerable than the other CAPTCHA schemes, such as image, audio, or video. Besides, text-based CAPTCHAs are annoying to use due to usability issues. Different security features make it attack-resistant in CAPTCHA designing, such as 'font tricks, ' diversified font styles, upper or lower case letters, deformation, alteration, distortion, twists, and sizes. Another such feature is the 'noise' [50], which is also referred to as clutter. For noise and clutter, different shapes (such as circles, squares, or rectangles), lines (vertical, diagonal, or horizontal), colors, dots may be used for CAPTCHA security. Similarly, the objects or text may be overlapped to make CAPTCHA resilient against potential segmentation attacks.\nOn the contrary, non-OCR-based CAPTCHA tests do not require word dictionaries. However, a substantially larger database is needed to store images, videos, or sounds. They have different disadvantages, such as vulnerability, unfriendly, massive image libraries, server loads, downloading delays, and timely access [18]. However, they are less vulnerable than text-based CAPTCHAs. They are more usable than text-based because they require less noise, clutter, deformation, and overlapping. These features make them more enjoyable and easy to pass.\nSimilarly, audio-based CAPTCHAs are less supported as non-native listeners/users might face problems recognizing words/phrases due to accent problems. Moreover, non-native speakers may not have enough vocabulary. Downloading issues make video-based CAPTCHAs less attractive than the others. Besides, network delay and the file size may also strain a user's resources interested in the desired task and not in CAPTCHA solving.", "publication_ref": ["b49", "b17"], "figure_ref": [], "table_ref": ["tab_1", "tab_2"]}, {"heading": "Recommendations for designers", "text": "According to our study, the following are some of the ineluctable factors in designing a robust CAPTCHA.\n(1) A good CAPTCHA must be resistant against segmentation attacks.\n(2) Deformation, fragmentation of text/images, lines, and clutter must be added to avoid recognition attacks. (3) Distortion, rotations, wrapping of text/images, and random scaling may also make it robust. (4) False boundaries of text/images are also helpful in designing a good CAPTCHA.\n(5) Apposite selection of multiple backgrounds and foreground colors also enhances security. ( 6) CAPTCHA must be generated at run-time with enough randomness. ( 7) Random length and combination of characters must be promoted. ( 8) Make it sturdy against pixel count attacks, such as by using random wrapping of text. ( 9) Clever use of words, phrases, and images is required. (10) To avoid database attacks, the use of a large-sized database is mandatory. (11) Feature deformation is helpful in image-based CAPTCHA designing to deter ML-based attacks. ( 12) A good CAPTCHA must be resilient against random guessing attacks. (13) We can confine the number of attempts and the time taken to solve a CAPTCHA. ( 14) Question-based CAPTCHA may be based on the logical thinking of humans rather than on computations only. (15) A combination of text and images is a good strategy. ( 16) Make more human interactions through mouse-clicking, screen tapping, drag-n-drop, or drop-down lists. ( 17) Machine learning technology is used in both breaking and security enhancements in the CAPTCHA. An example of this technology is the adversarial and neutral style that may give better directives for designing CAPTCHA [78]. (18) While the need to solve the different challenges might be pressing, some confidential information is also required [158]. Confidential information, such as pass time, pass speed, and the operation tracks, are needed to differentiate humans from robots. ( 19) Language comprehension should be paid more attention. As the ability to understand language is a required human skill to improve CAPTCHA in its entirety. Associative power is just another advanced human skill that can improve CAPTCHA.\nHowever, if these factors are applied eminently, the usability of the resultant challenge will decrease. As said earlier that there is a trade-off between robustness and usability. For example, adding more clutter, distortion, or overlapping will result in robust yet less readable and annoying CAPTCHA for human users. Therefore, we need to balance robustness and usability at the same time in a healthy proportion. [52] gave the idea of CAPTCHA breaking in 2003. They made recognition-based attacks on Gimpy and EZ-Gimpy CAPTCHAs. They attacked many schemes and revealed the weaknesses of different CAPTCHA schemes. This section presents different attacks made on ", "publication_ref": ["b9", "b10", "b12", "b77", "b17", "b157", "b51"], "figure_ref": [], "table_ref": []}, {"heading": "CAPTCHA BREAKING TECHNIQUES Mori and Malik", "text": "", "publication_ref": [], "figure_ref": [], "table_ref": []}, {"heading": "Segmentation Attacks", "text": "In breaking a CAPTCHA, segmentation is the most crucial step. A CAPTCHA challenge can only be well-recognized if the segmentation step is done properly [159]. Chellapilla et al. [160] claimed that once CAPTCHA texts are segmented well, recognizing a single character is much better in automated programs than humans. Pre-processing is done first to remove noise and clutter. Once Pre-processing has been done, the process of segmentation is started. A well-segmented image is then going through the recognition process to break a CAPTCHA scheme [67]. A generic view of CAPTCHA breaking steps is given in Fig. 29 followed by some segmentation-based attacks made on different CAPTCHA schemes.  According to the estimate, the success rate shot from 4.89% to 66.2% in this segmentation. The authors stated that humans feasibly detected the twisted/distorted word into a complete word on account of this. Therefore, it is pertinent to mention that they can easily break a segmented text as well.\nMicrosoft, Yahoo, and Google CAPTCHA were termed the weakest ones as humans' capability to break them were relatively higher, says Jeff Yan and Ahmed Salah [50]. They took six improperly sequenced letters or numerical digits from services.org CAPTCHA. Even though they were not in a sequence, overlapping words could not become possible, making humans rethink every time they click the expected digit. Hence, segmentation was possible in a vertical position. Each word was then counted in pixel table after segmentation for recognition, as seen in Fig. 30 and31.  Table 4 represents the lookup table used in letter-pixel count. The success rate of this approach was nearly 100%. In contrast, the strategy fails to function in letters with the same number of pixels (highlighted red in Table 4), especially when they overlap. Additionally, suppose the same pixel refers to more than one character. In that case, it paves the way for ambiguity and malfunctioning of the segmentation algorithm.\n6.1.2 Snake segmentation. To get rid of the simple segmentation, snake Segmentation [50] was used. There is no such rule in Snake Segmentation that it has to be vertical only. As shown in Fig. 32, the snake can move forward and backwards and up and down to break a picture. Standardization is done to see the letter, and that happens when the segmentation is done. A success ratio of 96% in the examples given and 99% on pictures selected randomly was attained. The images with alphabets, words, or numbers are difficult to break down because they are either joint or overlapping images.  ", "publication_ref": ["b158", "b159", "b66", "b49", "b49"], "figure_ref": ["fig_32", "fig_34", "fig_8", "fig_36"], "table_ref": ["tab_3", "tab_3"]}, {"heading": "Color filling Segmentation.", "text": "Color filling segmentation was used for pictures that contain only two colors, one of them being the background [161]. The other color is used for the text; therefore, the foreground. The foreground letters are dispersed, and to form an image, different colors are combined, and each pixel's count in the segment is done. The count done here is then compared with the count that is in the pixel table. If the count falls short, it is added with its adjoining right and left segment to figure out the correct letter or digit, as shown in Fig. 33. If there are many arcs placed, then this method is not successful. Megaupload [161] made a new segmentation resistance that was not like Google, Yahoo, or even Microsoft. There are a total of 4 digits and letters that are placed horizontally. Some of the parts have overlapped in them. They are eliminated and are only in two colors, black and white. For color segmentation to be done, the black and white parts are taken out one after another. They are added to recognize the white components, and any clutter or background loops are cut off. They are added together to make a letter in the end. In 100 sample tests, the success ratio is 82% with sufficient attack speed; 400 different samples had a success ratio of 78.25%. However, serious problems can be caused if two or more of the characters are joined to the black part, as shown in Fig. 34.\nIf the loop is not recognized accurately, a problem can occur. Another similar attack is launched on image-based CAPTCHAs, IMAGINATION, in [162]. They used a color-edge and line-segmentation detection mechanism. One hundred and nine (109) images of the said CAPTCHA scheme were brought together online, and with a success ratio of 74.31%, they broke 81 CAPTCHA images.", "publication_ref": ["b160", "b160", "b161"], "figure_ref": ["fig_14", "fig_38"], "table_ref": []}, {"heading": "Projection-based segmentation.", "text": "To break the CAPTCHA scheme, there are two basic methods; identification and segmentation [163]. The procedure of identification acknowledges a character when it has been segmented well. Letters and clutter were identified separately through label segmentation, and Chellapilla [164] also used it. The segmentation method fails of the difference is not much, and the characters tend to break to eliminate noise. As shown in Fig. 35, projection-based segmentation was used by Huang et al. [163] for Yahoo and MSN CAPTCHAs. The technique used by them had a rate of success of 9% more than the Chellapilla. As it helps to get rid of the clutter and noise, that is the advantage it has over Chellapilla. To analyze the CAPTCHAs, this technique helps to give a new dimension. 6.1.5 DeCAPTCHA. Bursztien and Bethard [81] attacked eBay audio CAPTCHA. They represented a proposal, 'DeCAPTCHA', in order to break the sound-based CAPTCHA schemes. 'CAPTCHA chorus' is made by the scraper to make such an attack. To break Sound CAPTCHAs, we can use Sphinx [165], which is a state-of-the-art sound recognizer. A graph is made when the audio is changed to features to decode the words and letters that are said. For this purpose, auditory and language modules are needed. The DeCAPTCHA broke a total of 75% of the sound-based CAPTCHAs, and the downloads were limited for this reason.\n6.1.6 K-Means layered segmentation. As shown in Fig. 36, there are transactions conducted in the e-banking on the CAPTCHA verification bases to avoid attacks by the bot. They help prevent unauthorized access and keep it safe from attacks by a Man-in-the-Middle (MitM). The pattern detected is processed by a tool, namely K-mean layered segmentation. There are three layers of ebanking CAPTCHAs, the first one having grids that are placed erratically. User birthday entrenched is the second layer, with each letter and digits having font style, location, and random alternation. The final uppermost layer has a transaction date on it. There are several steps to carry the attack out. To better the e-banking CAPTCHA, there are good lines provided. The rate of success is around 100% for breaking e-banking CAPTCHA. Li and Khayam [166] suggested not to use the e-banking CAPTCHA and use hardware security accomplishment instead. 6.1.7 Filter-based segmentation. A low cost yet powerful attack based on Log-Gabor filters is proposed in [53] to break various designed text-based CAPTCHAs. The attack shows a 5% to 77% success rate with less than 5 seconds on average to break a single instance of text CAPTCHA. They also compared Log-Gabor filters accuracy with other filter-based segmentation schemes, such as 2D Gabor filters and steerable filters. The results show that the Log-Gabor filter segmentation outperformed on character extraction than the two, as shown in Fig. 37. ", "publication_ref": ["b162", "b163", "b162", "b80", "b164", "b165", "b52"], "figure_ref": ["fig_39", "fig_40", "fig_41"], "table_ref": []}, {"heading": "ML-and DL-based attacks on CAPTCHAs", "text": "Automated processes can also break CAPTCHAs with ML and speech recognition algorithms. Golle [167] showed that ML-based attacks have a 10.3% success rate on Asirra. Similarly, in [162], an ML-based attack is made on image-based CAPTCHAs with a 40% success rate. Saroha et al. [168] used a backpropagation-based mechanism for CAPTCHA recognition. The following are some ML-based techniques used in CAPTCHA breaking.", "publication_ref": ["b166", "b161", "b167"], "figure_ref": [], "table_ref": []}, {"heading": "Convolutional Neural Network (CNN).", "text": "CNN is used for analyzing visual imagery, and they are good in areas like image classification [169]. The other variants of CNN, such as Regions with CNN features (RCNN) and Fast-RCNN, Faster RCNN, YOLO, and SSD, are integrated with improved security features and object detection accuracy [170], [171], [172], and [173]. CNN is equipped with a better mechanism with enhanced accuracy and time complexity. However, CNN's establishment requires much effort, including pre-trained staff members and much homework [174]. Furthermore, it requires a large quantity of high-quality data along with a dependable neural network. Hence, it requires a high initial cost [159]. A CNN-based Chinese text-based CAPTCHA breaking mechanism is proposed in [175]. Similarly, Stephen and Lu [176] assessed cyber security vulnerabilities by breaking CAPTCHAs using CNN. A semi-supervised DL-based (CNN) approach is used in [177] for breaking common CAPTCHA schemes. [178] proposed non-redundant merging with an accurate filling scheme for cracking the hollow CAPTCHA. In solid characters, they applied the nearest-minimum neighbor merging algorithm for gaining the correct individual characters. They used CNN to obtain the final recognition results with a success rate of 97.50% for individual characters and 91.00% for single images. A depiction is shown in Fig. 38 [170] discussed three different proof-of-concept attacks for selection-based CAPTCHAs, slide-based CAPTCHAs, and click-based CAPTCHAs. They break the CAPTCHA of 10 real-world security systems. They also discussed this method's working efficiency with previous methods, i.e., image recognition service and humans involved in the CAPTCHA solving process. The success rate of the scheme is 85.72%-99.65%.\nA Deep Convolutional Neural Network (DCNN) was presented to break such CAPTCHAs based on a confusion class. However, it has low recognition accuracy. Therefore, the selective-learning confusion class was introduced to overcome this problem for text-based CAPTCHAs in [179]. The process involves a two-stage DCNN framework based on the confusion relation matrix. The partitioning algorithm improved 1.4%-39.4% for confusing characters for confusion class DCNN and the validation and training algorithm. Another DCNN-based attack is made on image-based CAPTCHAs in [180]. They took 25,000 test images, and the accuracy rate is as high as 95.2%. Similarly, Zhang et al. [181] propounded Captchanet as a classification mechanism for Chinese character-based CAPTCHAs with better accuracy than other DL-based mechanisms. Another CAPTCHA recognition scheme is presented by Wand and Shi [182] based on CNN with 99%, 97.84%, and 98.5%, recognition rate.", "publication_ref": ["b168", "b169", "b170", "b171", "b172", "b173", "b158", "b174", "b175", "b176", "b169", "b178", "b179", "b180", "b181"], "figure_ref": ["fig_23"], "table_ref": []}, {"heading": "Deep learning.", "text": "Deep learning is considered the most dominating method among different existing techniques from the last few years. Due to this method, the existing techniques have developed significantly better recognition than humans. Deep neural networks usually are integrated with all the levels of features and end-to-end based classifiers involving the multiple layer fashion enriched with the numbers of depths [183]. They have the degradation issue when these start to converge, which increases with the increasing depth and results in reduced accuracy [184]. This technology is employed in different recognition fields, such as image, text, and audio recognition. These techniques, such as CNN, RNN, LSTM-RNN, are some to mention, which are used in CAPTCHA recognition [67].\nAs discussed earlier, the CNN approach recognises characters' images without extracting the features and is strong in displace, deformation, and scaling. The research [185] shows that the recognition of CAPTCHA with a distributed deep convolutional neural network has an accuracy of 99.8%. However, it cannot be combined with context information recognition due to time constraints. Hence, feedback and time parameters based RNN was proposed for handling time series data. However, despite that, this scheme has a dispersing gradient issue. Therefore, the LSTM approach was proposed [186], using the 2D LSTM-RNN for recognizing CCT CAPTCHAs with the accuracy of 55.2%. This approach was successful in obtaining the relevant information on the horizontal as well as the vertical axis. This paper proposes the generic, simple, and fast attack approach for decoding text CAPTCHA with a superposition challenge. Similarly, Tang et al. [187] proposed a generic, simple, yet fast approach for decoding CAPTCHA schemes with the superposition. The deep learning-based breaking of roman-text-based character CAPTCHA with the success rate of 10.1%-90.0%. The scheme also attacked three Chinese CAPTCHAs with success rates of 93.0%, 32.2% and 28.6%, respectively. Sivakorn et al. [188] designed a novel low-cost attack that controls the semantic annotation of images through deep learning technology on image-reCAPTCHA and Facebook image CAPTCHA schemes. The accuracy rate of the said scheme is 70.78% for image reCAPTCHA and 83.50% for Facebook image CAPTCHA.", "publication_ref": ["b182", "b183", "b66", "b184", "b185", "b186", "b187"], "figure_ref": [], "table_ref": []}, {"heading": "Support Vector Machine (SVM). SVM is also considered a proficient classification technique.", "text": "It is based upon Statistical Learning Theory with many advantages, such as robustness, accuracy, and effectiveness, even with few training samples. They are non-parametric binary classifiers by nature. It works by separating classes through a hyper-plane. The kernel function uses a key, which decodes the original features and converts them into high-dimensional space in a nonlinear way, enhancing the separability for data [67]. They are widely applied in machine vision fields like character, hand-writing digitization, text recognition, and even satellite image classification [189].\nStarostenko et al. [190] presented an innovative approach for solving the automatic segmentation and recognizing reCAPTCHAs and other text-based CAPTCHAs using an SVM-based classifier. Different font sizes having different waving patterns and rotation in this approach collapse in random over-lapping characters. The suggested segmentation process is founded on three-color bar character encoding, which separates the letter in reCAPTCHA. The average segmentation rate was up to 82%, while the SVM classifier success rate was almost 94%. However, this technique fails in decoding the reCAPTCHAs of 2012. Another such technique is proposed in [167], broke image-based CAPTCHAs using SVM with an 82.7% accuracy rate.", "publication_ref": ["b66", "b188", "b189", "b166"], "figure_ref": [], "table_ref": []}, {"heading": "Fuzzy logic.", "text": "Out of other techniques in clustering, the most commonly used algorithms is the Fuzzy C-Means (FCM). Fuzzy logic is widely used for image segmentation. The mechanism is a well-known clustering approach that uses numerical data (k-means method) or large datasets, i.e., a Fig. 40. The GUI visualization of character segmentation and SVM-based recognition used in [190].\ntiered method for solving dissimilarity matrices [191]. It works by partitioning the finite collection into sets of c fuzzy clusters. It results in the formation of clusters involving every element to a certain degree. These elements can also belong to the different clusters at the same time, i.e., soft clustering. A fuzzy logic-based mechanism is propounded in [192] by Fonseca et al. for recognizing geometrical shapes interactively.\nTheir algorithm can easily recognize elementary geometrical shapes like triangles, rectangles, circles, and ellipses. It observes and collects the geometrical features of different shapes from the database and combines them to recognize the final geometrical figure. They used the perimeter and area to recognize features that separate all the geometrical figures, as given by Grahm's Algorithm [193]. After this, each fuzzy set belonging to each feature was used for the recognition of shapes. Sasi et al. [194] studied the application of fuzzy set theory for the classification of handwritten characters sets. Initially, all the hand-written characters were classified into 4x4 matrix cells. They were analyzed and stored in the database under different categories. Another edge corner-based segmentation-recognition mechanism is proposed by Nachar et al. [195] using fuzzy logic for breaking different types of CAPTCHA schemes. The success rate for eBay, Wikipedia, ReCAPTCHA, and Yahoo was 68.2%, 76.7%, 62.5%, and 57.3%, respectively.  ", "publication_ref": ["b189", "b190", "b191", "b193", "b194"], "figure_ref": ["fig_3"], "table_ref": []}, {"heading": "Artificial neural networks (ANN).", "text": "For image recognition, different neural network approaches have been proposed. All interconnected units, called artificial neurons, are trained to solve complex problems. Each neural network consists of hundreds of layers, which are the same as the human brain. However, neural networks require intensive training with thousands of samples along. Moreover, the quality of training data and feature extraction also play an important role in final recognition [67]. Simard et al. [196] came forward with their application for visual documentation analysis. Another ANN-based mechanism is proposed by Koerich et al. [197] using discrete Hidden Markov Models (HMM) for unconstrained hand-written words' recognition and verification. Furthermore, Kaur et al. [198] showed that an ANN system could also be used to recognize the character. Barve et al. [199] showed that an optical character recognition system designed with ANNs could have high noise tolerance. In [186], a BPNN employed a cross entropy method using Recurrent Neural Network (RNN) to calculate the network's performance. The overall precision for the CCT CAPTCHAs of Taobao is 51.3%. It is 27.1% for MSN and 53.2% for the eBay. However, the main problem is the extraction character feature of high quality, limiting the final results.", "publication_ref": ["b66", "b195", "b196", "b197", "b198", "b185"], "figure_ref": [], "table_ref": []}, {"heading": "Generative Adversarial Networks (GAN).", "text": "A GAN uses a generative network for generating mock examples and a discriminate network for distinguishing the produced examples from the actual scenarios. For this purpose, back-propagation is used to train both networks; after some training iterations, the generators give better mock samples. In contrast, the discriminator becomes better using flagging synthetic data [54]. GANs showed the extraordinary results in image [200] [201] and natural language [202][203] processing tasks. However, due to the technique's freshness, no literature work is available where GANs were used for solving the text-based CAPTCHAs. Therefore,a GAN-based bot is proposed in [54] for solving text-based CAPTCHAs. The bot uses training data and can solve a wide range of text-based CAPTCHA schemes. The deviation from the past ML-based attacks requires few newly created CAPTCHAs for building the solver. It is achieved by learning the synthesizer and then generating training data for building a solver base. It them refines the solver through transfer learning on real CAPTCHAs data sets. The main advantage of this approach is that it requires very little human intervention for learning.", "publication_ref": ["b53", "b199", "b200", "b201", "b53"], "figure_ref": [], "table_ref": []}, {"heading": "K-nearest neighbours (KNN)", "text": ". KNN is designed on the category having the nearest k samples for determining the category of a test sample. KNN is the most commonly used recognition classifier for breaking text-based CAPTCHA systems. However, the accuracy of KNN classification depends on the size of samples and the value of k. In [53], several approaches like SVM, BPNN, template matching, CNN, and KNN were tested. The results showed that KNN achieved the highest success rates for most schemes, whereas CNN showed better results in the shortest time.  ", "publication_ref": ["b52"], "figure_ref": [], "table_ref": []}, {"heading": "Distortion estimation technique", "text": "Distortion-estimation techniques break EZ-Gimpy and Gimpy-r CAPTCHAs. A 99% accuracy on Ez-Gimpy and 78% on Gimpy-r CAPTCHAs is projected by Gabial Moy et al. [51]. They used a dictionary of 561-word in breaking Ez-gimpy and a four-letter word dictionary for Gimpy-r CAPTCHAs. The correlation is used in matching words by cores and minipatches identification, as shown in Fig. 43 and44. The correlation mechanism gave high success and accuracy rates; however, it failed in identifying high distorted images. Also, the dictionary used in breaking was small, which made execution ineffective. However, on the increased size of slicing, the execution time increased, as well.", "publication_ref": ["b50"], "figure_ref": ["fig_46", "fig_47"], "table_ref": []}, {"heading": "Dictionary attacks", "text": "In networks, a user is likely to encounter a Denial of Services (DoS) attack [204]. While in an allotted time restriction, if the amount of guesses is incorrectly made, the account becomes locked. The issue is encountered by legitimate users who end up facing service poverty. To get the better of these kinds of issues, EZ-Gimpy and Gimpy CAPTCHAs had been initiated. Mori and Malik [52] struck the mentioned variations of CAPTCHAs, turning it uncertain by virtual brute force strikes. The procedure of this kind of attack is displayed in Fig. 45 and46.\nText-based CAPTCHAs are where brute force attacks are formed, especially those containing a file. If not, then a database is linked alongside them. Yan and Salah [50] used gullible arrangement identification techniques to shatter a category of visual CAPTCHA. The highlighted issue of evident segmentation and pixel counts was conquered with the use of brute force strikes. A word is primarily sent through connection and, after that, from recognition. However, the scheme malfunctions if disconnected or linked letters are greater than 3 in numbers or all displayed or entered letters are joined. Brute force strikes are doable for words that are entered in the English language. However, unsystematic character/inclusion of digit CAPTCHA cannot be fractured by such variations of strikes.", "publication_ref": ["b203", "b51", "b49"], "figure_ref": ["fig_48", "fig_49"], "table_ref": []}, {"heading": "Reverse engineering method", "text": "Hindle and Michael. [205] came up with the suggestion of reverse engineering for breaking a particular CAPTCHA scheme, as shown in Fig. 47. They compared CAPTCHAs' weakness after   breaking them to highlight the way to make them more robust. However, it uses a bit map illustration solely for CAPTCHAs based on text.\nThe accuracy level of the technique used for PHPBB CAPTCHA is 99%. For Rogers CAPTCHAs, it is 95%, for Piratebay is 61% and for Watercap CAPTCHA is 27%. This perspective has provided adequate proposals for building CAPTCHAs more applaudable. However, it is unable to take in the use of sound and visual-based CAPTCHAs.", "publication_ref": ["b204"], "figure_ref": ["fig_50"], "table_ref": []}, {"heading": "CHALLENGES AND OPEN ISSUES IN CAPTCHA BREAKING TECHNIQUES", "text": "As mentioned before, there are different types of CAPTCHAs, such as text, image, audio, or video. They provide security against malevolent bot attacks. Unfortunately, they have the same fate and prone to breaking attacks [206]. Their security and usability, at the same time, is a challenging task. The current study on CAPTCHA reveals that although much work has been done on their security, however, there are still design vulnerabilities that make them insecure [25], [187], [207]. Previously (in this paper), it is observed that several attacks are made on well-known CAPTCHA schemes, such as breaking of reCAPTCHA used extensively by Google. That is because there is no standardized mechanisms and practice for designing robust CAPTCHAs. Therefore, by exploiting their vulnerabilities, the hackers manage to break CAPTCHAs readily to harm the target source.\nAnother important reason behind breaking CAPTCHAs is to find their design vulnerabilities to bring security improvements in their design. There are different steps that are involved in CAPTCHA breaking, such as pre-processing [208], image processing [209], pattern matching [210], ML [211], are just to name a few. The pattern matching-based attacking technique was widely used in the beginning. The downside of this attack is that it requires manual instructions to extract features for different CAPTCHA types. On the contrary, segmentation attacks are the most typical type of attack. Conversely, this method is not suitable for real-time attacks because it requires a prolonged duration, affecting the breaking speed. There are other end-to-end attacking models, which use ML-based models, for example [212], [213], and [174]. However, they require more hardware and computational resources. For instance, a deep learning approach to recognize a CAPTCHA in its entirety requires high hardware requirements. Under the light of our findings, The following points must be considered in designing attacks for breaking a CAPTCHA scheme:\n(1) The CAPTCHAs, especially text-based, are mostly broken using segmentation attacks. Therefore, segmentation-strategies must be revisited to tranche the overlapped text/objects.\n(2) A larger size of dictionary/database must be kept updated to launch dictionary attacks. Besides, pixel statistics should also be revised from time to time. (3) The end-to-end attack is one of the most foremost directives for CAPTCHA breaking [174].\nThese attacks are mostly Dl-based, which pose particular challenges in terms of required resources. Thus, there needs to have a lightweight and more convenient DL-based CAPTCHAbreaking approach. (4) There is a problem associated with ML techniques, which requires a significant number of construed datasets. This problem cannot be disregarded, so much so that a less dependent model on the training dataset is required. (5) An exclusive trained system is required to break different CAPTCHA. A more non-specific network that can be moved to multiple means is needed because dataset labeling is expensive. (6) An ML-based algorithm, such as DL, is a threat to CAPTCHA security. Hence, a new CAPTCHA defense system is needed to be equipped enough to counter it [187]. Multilayer feature representations and abstractions from various kinds of data are the most critical purpose of ML. With deep learning, a convolution neural network was applied to image classification. A myriad of other tasks since 1989, such as [214], [215], [216], [217], [218], and [219] have been proposed. AlexNet, in recent times, has enhanced the architecture of CNN and notably to improve the classification effect [25]. It has also become the customary trainers for CNN on GPUs [26]. (7) There is a limit in ML technology when involved with AI image processing, such as; symmetry [220] and adversarial examples [221] and [222]. According to Osadchy et al. [223], CAPTCHA designed using concerning deep learning limitations is a viable future exploration [221]. (8) Web access and software generation are the two ways in which researchers get the CAPTCHA samples. The importance of standard test databases as a requirement for breaking in databasebased CAPTCHAs, such as traditional test databases, is necessary for an improved text-based CAPTCHA. (9) A database is required to provide dependable testing and training data for analytical work.\nTherefore, to gather, categorize, arrange, and initiate a CAPTCHA database is of high importance. (10) There is a myriad of feature changes in a CAPTCHA. Presently, the efficacious identification of CAPTCHAs by a classifier can only be made when training sets and set types belong to the same class. Therefore, it is quite onerous and necessary to design a standard classifier to identify different CAPTCHA types. (11) The high success rate that has been achieved by Text-based CAPTCHA breaking is astounding.\nSadly, Crowding Characters Together (CCT) strings have been widely used in the text-based CAPTCHA, causing a snag in the results [77]. This drawback is due to the problem associated with the segmentation-free CAPTCHA identification; a situation that requires immediate attention. This problem may be solved using deep learning because of its new ideas and techniques. (12) Machine learning has been found to deliver quality results than other conventional techniques [224]. For instance, CNN and its improved methods, Deep Belief Networks (DBN) [225], RNN [226], and Deep Reinforcement Learning (DRL) [227], are the most applied techniques. However, they still are not frequented in CAPTCHA identification. Although careful analysis, the application of fusion and correlation between the different deep learning types is not thorough. There is still a need for more effective and efficient learning models to enable ease in CAPTCHA identification.   (13) There has been an increase in identification results' dependability due to better breaking CAPTCHA techniques. Therefore, there is a need to certify the correct rejection, dismissal, and improve the accuracy rate of recognition. Rejection as a concept is not well-known in the CAPTCHA recognition field. It is, however, quite clear that it can be developed. (14) In the extraction of features automatically, using ML, characters with similar characteristics are handily muddled. Practically, the accuracy of feature extraction and training methods can be improved by various ML-based techniques, such as DL and its variants [26].", "publication_ref": ["b205", "b24", "b186", "b206", "b207", "b208", "b209", "b210", "b211", "b212", "b173", "b173", "b186", "b213", "b214", "b215", "b216", "b217", "b218", "b24", "b25", "b219", "b220", "b221", "b222", "b220", "b9", "b10", "b76", "b223", "b224", "b225", "b226", "b13", "b25"], "figure_ref": [], "table_ref": []}, {"heading": "Performance analysis of CAPTCHA breaking techniques", "text": "In keeping with our study, Table 5 presents a summary of the comparison among different stateof-the-art CAPTCHA breaking mechanisms. As said earlier, ML-based attacks are widely used in CAPTCHA breaking, out of which DL variants are the most prominent. As depicted in Fig. 48, DCNN [185] outperformed other ML techniques with a 99.8 percent accuracy rate. Similarly, we make a comparison of segmentation-based attacks, shown in Fig. 49. Among all, the K-Meansbased [166] segmentation attack outperformed others with accuracy as high as 100 percent. And then comes the vertical segmentation attack [50] with a 99 percent accuracy rate. However, both the breaking techniques are old and were used a decade before. Thus, they might not work equally well on today's advanced CAPTCHA schemes. We also compared other breaking techniques, whose depiction is shown in Fig. 50.", "publication_ref": ["b184", "b165", "b49"], "figure_ref": [], "table_ref": []}, {"heading": "CONCLUSION", "text": "Deciding whether the user is a human or a malicious bot program is challenging for a web service provider. CAPTCHA is a security mechanism used against automated malicious bot programs. There are different types of CAPTCHA based on their formation and structure for distinguishing humans and machines apart. This survey provided an in-depth analysis of various CAPTCHA schemes categorized as OCR and non-OCR CAPTCHA schemes. We analyzed the usability and the design loopholes of each CAPTCHA type. The most crucial issue in CAPTCHA designing is the deformation and noise, compromising its usability and making it annoying for a human user. This study spotlit the design vulnerabilities and suggestions to the designers for making CAPTCHA schemes more user-friendly yet attack-resistant. Besides, it also highlighted the challenges and open issues in CAPTCHA designing.\nHowever, CAPTCHA security is still a question. They are subject to attacks. There are different braking techniques, such as segmentation, ML-, and DL-based attacks. Among others, it is noted that ML-based, especially DL-based breaking schemes, are more dominantly practiced. This survey showed the vulnerabilities of different CAPTCHAs schemes based on the state-of-the-art CAPTCHA breaking schemes. It also provided an in-depth analysis of these breaking schemes.\nMoreover, it highlighted challenges and open issues in breaking the various CAPTCHA schemes. It also provided a discussion on CAPTCHA breaking techniques that how better breaking techniques might be designed. The study would help in the usable and attack-resistant CAPTCHA designing. In the future, we aim to design a robust and user-friendly image-based CAPTCHA that is also scalable.", "publication_ref": [], "figure_ref": [], "table_ref": []}], "references": [{"ref_id": "b0", "title": "A blockchain-based multi-mobile code-driven trust mechanism for detecting internal attacks in internet of things", "journal": "Sensors", "year": "2021", "authors": "Noshina Tariq; Muhammad Asim; Farrukh Aslam Khan; Thar Baker; Umair Khalid; Abdelouahid Derhab"}, {"ref_id": "b1", "title": "Tweet-based bot detection using big data analytics", "journal": "IEEE Access", "year": "2021", "authors": "Abdelouahid Derhab; Rahaf Alawwad; Khawlah Dehwah; Noshina Tariq; Farrukh Aslam Khan; Jalal Al-Muhtadi"}, {"ref_id": "b2", "title": "Captcha: Impact of website security on user experience", "journal": "", "year": "2019", "authors": "Nitirat Tanthavech; Apichaya Nimkoompai"}, {"ref_id": "b3", "title": "Captcha design and security issues", "journal": "Springer", "year": "2019", "authors": "Yang-Wai Chow; Willy Susilo; Pairat Thorncharoensri"}, {"ref_id": "b4", "title": "Ctrust-rpl: A control layer-based trust mechanism for supporting secure routing in routing protocol for low power and lossy networks-based internet of things applications", "journal": "Transactions on Emerging Telecommunications Technologies", "year": "2021", "authors": "Muhammad Temur Ul Hassan; Thar Asim; Jawad Baker; Noshina Hassan;  Tariq"}, {"ref_id": "b5", "title": "Malicious insiders attack in iot based multi-cloud e-healthcare environment: a systematic literature review", "journal": "Multimedia Tools and Applications", "year": "2018", "authors": "Afsheen Ahmed; Rabia Latif; Seemab Latif; Haider Abbas; Farrukh Aslam Khan"}, {"ref_id": "b6", "title": "Toward an optimal solution against denial of service attacks in software defined networks", "journal": "Future Generation Computer Systems", "year": "2019", "authors": "Muhammad Imran; Muhammad Hanif Durad; Farrukh Aslam Khan; Abdelouahid Derhab"}, {"ref_id": "b7", "title": "A cloud endpoint coordinating captcha based on multi-view stacking ensemble", "journal": "Computers & Security", "year": "2021", "authors": "Zhiyou Ouyang; Xu Zhai; Jinran Wu; Jian Yang; Dong Yue; Chunxia Dou; Tengfei Zhang"}, {"ref_id": "b8", "title": "Secure captcha test", "journal": "US Patent App", "year": "2018-03-01", "authors": "Gil Gonen; Ronen Haber; Arie Haenel"}, {"ref_id": "b9", "title": "An experimental investigation of text-based captcha attacks and their robustness", "journal": "ACM Computing Surveys", "year": "2023", "authors": "Ping Wang; Haichang Gao; Xiaoyan Guo; Chenxuan Xiao; Fuqi Qi; Zheng Yan"}, {"ref_id": "b10", "title": "A secure annuli captcha system", "journal": "Computers & Security", "year": "2023", "authors": "Jie Zhang; Min-Yen Tsai; Kotcharat Kitchat; Min-Te Sun; Kazuya Sakai; Wei-Shinn Ku; Thattapon Surasak; Tipajin Thaipisutikul"}, {"ref_id": "b11", "title": "Extended research on the security of visual reasoning captcha", "journal": "IEEE Transactions on Dependable and Secure Computing", "year": "2023", "authors": "Ping Wang; Haichang Gao; Chenxuan Xiao; Xiaoyan Guo; Yipeng Gao; Yang Zi"}, {"ref_id": "b12", "title": "Securing scada-based critical infrastructures: Challenges and open issues", "journal": "Procedia Computer Science", "year": "2019", "authors": "Noshina Tariq; Muhammad Asim; Farrukh Aslam Khan"}, {"ref_id": "b13", "title": "Benchmarks for designing a secure devanagari captcha", "journal": "SN Computer Science", "year": "2021", "authors": "Mohinder Kumar; Manish Kumar Jindal"}, {"ref_id": "b14", "title": "Match-the-sound captcha", "journal": "Springer", "year": "2018", "authors": "Noshina Tariq; Farrukh Aslam Khan"}, {"ref_id": "b15", "title": "Captcha: Using hard ai problems for security", "journal": "", "year": "2003", "authors": "L Von Ahn; M Blum; N Hopper; J Langford"}, {"ref_id": "b16", "title": "The soundsright captcha: an improved approach to audio human interaction proofs for blind users", "journal": "ACM", "year": "2012", "authors": "Jonathan Lazar; Jinjuan Feng; Tim Brooks; Genna Melamed; Brian Wentz; Jon Holman; Abiodun Olalere; Nnanna Ekedebe"}, {"ref_id": "b17", "title": "Image flip captcha", "journal": "ISC International Journal of Information Security (ISeCure)", "year": "2009", "authors": "M T Banday; N A Shah"}, {"ref_id": "b18", "title": "A survey on adversarial perturbations and attacks on captchas", "journal": "Applied Sciences", "year": "2023", "authors": "A Suliman;  Alsuhibany"}, {"ref_id": "b19", "title": "A systematic survey on captcha recognition: types, creation and breaking techniques", "journal": "Archives of Computational Methods in Engineering", "year": "2022", "authors": "Mohinder Kumar; Munish Jindal;  Kumar"}, {"ref_id": "b20", "title": "A comprehensive study for different types of captcha methods and various attacks", "journal": "", "year": "2021", "authors": "Medhat A Menna Magdy;  Tawfeek; M Hamdy;  Mousa"}, {"ref_id": "b21", "title": "A systematic survey on captcha recognition: Types, creation and breaking techniques", "journal": "Archives of Computational Methods in Engineering", "year": "2021", "authors": "Mohinder Kumar; Munish Jindal;  Kumar"}, {"ref_id": "b22", "title": "Survey on captcha recognition using deep learning", "journal": "Springer", "year": "2021", "authors": "Mohit Srivastava; Shreya Sakshi; Sanghamitra Dutta; Chitrapriya Ningthoujam"}, {"ref_id": "b23", "title": "Captcha techniques of secure web authentication: A survey", "journal": "Springer", "year": "2021", "authors": "Ananth Gannavarapu; Garg Kumar;  Rishav"}, {"ref_id": "b24", "title": "A survey of research on captcha designing and breaking techniques", "journal": "IEEE", "year": "2019", "authors": "Yang Zhang; Haichang Gao; Ge Pei; Sainan Luo; Guoqin Chang; Nuo Cheng"}, {"ref_id": "b25", "title": "A survey of captcha technologies to distinguish between human and computer", "journal": "Neurocomputing", "year": "2020", "authors": "Xin Xu; Lei Liu; Bo Li"}, {"ref_id": "b26", "title": "Machine vs. machine-a systematic classification of automated machine learning-based captcha solvers", "journal": "Computers & Security", "year": "2020", "authors": "Antreas Dionysiou; Elias Athanasopoulos Sok"}, {"ref_id": "b27", "title": "A survey on captcha categories", "journal": "Int. J. Eng. Comput. Sci", "year": "2016", "authors": "N Divyashree;  Kumar"}, {"ref_id": "b28", "title": "Completely automated public physical test to tell computers and humans apart: A usability study on mobile devices", "journal": "Future Generation Computer Systems", "year": "2018", "authors": "Meriem Guerar; Alessio Merlo; Mauro Migliardi"}, {"ref_id": "b29", "title": "Large scale captcha survey", "journal": "", "year": "2018", "authors": "Mecheal Greene"}, {"ref_id": "b30", "title": "A survey and analysis of current captcha approaches", "journal": "J. Web Eng", "year": "2013", "authors": "Narges Roshanbin; James Miller"}, {"ref_id": "b31", "title": "Captcha and its alternatives: A review", "journal": "Security and Communication Networks", "year": "2015", "authors": "Mohammad Moradi; Mohammadreza Keyvanpour"}, {"ref_id": "b32", "title": "How good are humans at solving captchas? a large scale evaluation", "journal": "IEEE", "year": "2010", "authors": "Elie Bursztein; Steven Bethard; Celine Fabry; John C Mitchell; Dan Jurafsky"}, {"ref_id": "b33", "title": "A study of captchas for securing web services", "journal": "", "year": "2011", "authors": "M Tariq; Banday ; Nisar A Shah"}, {"ref_id": "b34", "title": "Labeling images with a computer game", "journal": "ACM", "year": "2004", "authors": "L Von Ahn; L Dabbish"}, {"ref_id": "b35", "title": "Is it human or computer? defending e-commerce with captchas", "journal": "IT professional", "year": "2005", "authors": "Clark Pope; Khushpreet Kaur"}, {"ref_id": "b36", "title": "Preventing multiple accessing attacks via efficient integration of captcha crypto hash functions", "journal": "Int. J. Comput. Sci. Netw. Secur.(IJCSNS)", "year": "2020", "authors": "Nafisah Kheshaifaty; Adnan Gutub"}, {"ref_id": "b37", "title": "Captcha: Machine or human solvers? a game-theoretical analysis", "journal": "IEEE", "year": "2018", "authors": "Zhen Li; Qi Liao"}, {"ref_id": "b38", "title": "Preventing bots from playing online games", "journal": "Computers in Entertainment (CIE)", "year": "2005", "authors": "Philippe Golle; Nicolas Ducheneaut"}, {"ref_id": "b39", "title": "Password-based authentication: Preventing dictionary attacks", "journal": "Computer", "year": "2007", "authors": "Saikat Chakrabarti; Mukesh Singhal"}, {"ref_id": "b40", "title": "A password-based authentication system based on the captcha ai problem", "journal": "IEEE Access", "year": "2020", "authors": "Masoud Alajmi; Ibrahim Elashry; S Hala; Osama S El-Sayed;  Faragallah"}, {"ref_id": "b41", "title": "A captcha-based graphical password with strong password space and usability study", "journal": "IEEE", "year": "2020", "authors": "Altaf Khan; Alexander G Chefranov"}, {"ref_id": "b42", "title": "Handling captcha free web-form spam with spamizer 1.1", "journal": "", "year": "2017", "authors": "Manish Saxena;  Usman;  Hemant"}, {"ref_id": "b43", "title": "Enhancing website security against bots, spam and web attacks using l captcha", "journal": "International Journal of Computers and Applications", "year": "2019", "authors": " Vaithyasubramanian;  Lalitha;  Kirubhashankar"}, {"ref_id": "b44", "title": "Telling humans and computers apart automatically", "journal": "Communications of the ACM", "year": "2004", "authors": "L Von Ahn; M Blum; J Langford"}, {"ref_id": "b45", "title": "Search prevention with captcha against web indexing: A proof of concept", "journal": "IEEE", "year": "2019", "authors": "Donghoon Kim; Luke Sample"}, {"ref_id": "b46", "title": "Video captcha as a graphical password", "journal": "International Research Journal of Engineering and Technology (IRJET)", "year": "2018", "authors": "Pooja Kute; Tejaswini Lokhande; Manasi Kanadi; Sayali Kashid; Ruchira Deshmukh"}, {"ref_id": "b47", "title": "A study of captchas for securing web services", "journal": "", "year": "", "authors": "M T Banday; N A Shah"}, {"ref_id": "b48", "title": "Usability evaluation of novel text captcha schemes based on colors and shapes", "journal": "Springer", "year": "2022", "authors": "Tejaswi Kumar; Navansh Goel; Siddhant Roy; C Oswald"}, {"ref_id": "b49", "title": "Breaking visual captchas with naive pattern recognition algorithms", "journal": "IEEE Computer Society", "year": "2007", "authors": "J Yan; A S El Ahmad"}, {"ref_id": "b50", "title": "Distortion estimation techniques in solving visual captchas", "journal": "", "year": "2004", "authors": "G Moy; N Jones; C Harkless; R Potter"}, {"ref_id": "b51", "title": "Recognizing objects in adversarial clutter: Breaking a visual captcha", "journal": "", "year": "2003", "authors": "G Mori; J Malik"}, {"ref_id": "b52", "title": "A simple generic attack on text captchas", "journal": "", "year": "2016", "authors": "Jeff Yan"}, {"ref_id": "b53", "title": "Yet another text captcha solver: A generative adversarial network based approach", "journal": "ACM", "year": "2018", "authors": "Guixin Ye; Zhanyong Tang; Dingyi Fang; Zhanxing Zhu; Yansong Feng; Pengfei Xu; Xiaojiang Chen; Zheng Wang"}, {"ref_id": "b54", "title": "rtcaptcha: A real-time captcha based liveness detection system", "journal": "", "year": "2018", "authors": "Erkam Uzun; Simon Pak Ho; Irfan Chung; Wenke Essa;  Lee"}, {"ref_id": "b55", "title": "A generative vision model that trains with high data efficiency and breaks text-based captchas", "journal": "Science", "year": "2017", "authors": "Dileep George; Wolfgang Lehrach; Ken Kansky; Miguel Lázaro-Gredilla; Christopher Laan; Bhaskara Marthi; Xinghua Lou; Zhaoshi Meng; Yi Liu; Huayan Wang"}, {"ref_id": "b56", "title": "Robust text captchas using adversarial examples", "journal": "", "year": "2021", "authors": "Rulin Shao; Zhouxing Shi; Jinfeng Yi; Pin-Yu Chen; Cho-Jui Hsieh"}, {"ref_id": "b57", "title": "Design and evaluation of 3d captchas", "journal": "Computers & Security", "year": "2019", "authors": "S Simon;  Woo"}, {"ref_id": "b58", "title": "East: an efficient and accurate scene text detector", "journal": "", "year": "2017", "authors": "Xinyu Zhou; Cong Yao; He Wen; Yuzhi Wang; Shuchang Zhou; Weiran He; Jiajun Liang"}, {"ref_id": "b59", "title": "Dotcha: A 3d text-based scatter-type captcha", "journal": "Springer", "year": "2019", "authors": "Suzi Kim; Sunghee Choi"}, {"ref_id": "b60", "title": "Style-preserving english handwriting synthesis", "journal": "Pattern recognition", "year": "2007", "authors": "Z Lin; L Wan"}, {"ref_id": "b61", "title": "Generating new samples from handwritten numerals based on point correspondence", "journal": "", "year": "2000", "authors": "M Mori; A Suzuki; A Shio; S Ohtsuka"}, {"ref_id": "b62", "title": "Segmentation-validation based handwritten arabic captcha generation", "journal": "Computers & Security", "year": "2020", "authors": "Mohammad Tanvir; Parvez ; Suliman A Alsuhibany"}, {"ref_id": "b63", "title": "An overview of character recognition focused on off-line handwriting", "journal": "Systems, Man, and Cybernetics, Part C: Applications and Reviews, IEEE Transactions on", "year": "2001", "authors": "N Arica; F T Yarman-Vural"}, {"ref_id": "b64", "title": "Synthetic handwritten captchas", "journal": "Pattern Recognition", "year": "2009", "authors": "A O Thomas; A Rusu; V Govindaraju"}, {"ref_id": "b65", "title": "The robustness of hollow captchas", "journal": "ACM", "year": "2013", "authors": "Haichang Gao; Wei Wang; Jiao Qi; Xuqin Wang; Xiyang Liu; Jeff Yan"}, {"ref_id": "b66", "title": "A survey on breaking technique of text-based captcha", "journal": "Security and Communication Networks", "year": "2017", "authors": "Jun Chen; Xiangyang Luo; Yanqing Guo; Yi Zhang; Daofu Gong"}, {"ref_id": "b67", "title": "Captcha smuggling: hijacking web browsing sessions to create captcha farms", "journal": "ACM", "year": "2010", "authors": "M Egele; L Bilge; E Kirda; C Kruegel"}, {"ref_id": "b68", "title": "Spiral captcha with adversarial perturbation and its security analysis with convolutional neural network", "journal": "Springer", "year": "2022", "authors": "Krishna Rama"}, {"ref_id": "b69", "title": "Image recognition captchas", "journal": "Information Security", "year": "2004", "authors": "M Chew; J D Tygar"}, {"ref_id": "b70", "title": "", "journal": "", "year": "2006", "authors": "O Warner;  Kittenauth"}, {"ref_id": "b71", "title": "Asirra: a captcha that exploits interest-aligned manual image categorization", "journal": "CCS", "year": "", "authors": "J Elson; J R Douceur; J Howell; J Saul"}, {"ref_id": "b72", "title": "Image-based captcha system", "journal": "US Patent App", "year": "2012-12-20", "authors": "Prays Nikolay Aleksandrovich; Nikiforov Igor Alekseevich; Maksim Vladykin; Nikiforov Vladimirovich; Prays Aleksey Igorevich; Nikiforova Varvara Borisovna; Igorevna Olga"}, {"ref_id": "b73", "title": "Image-based captcha exploiting context in object recognition", "journal": "US Patent", "year": "2013-07-09", "authors": "Bin Zhu; Jia Liu; Qiujie Li; Shipeng Li; Ning Xu"}, {"ref_id": "b74", "title": "Facedcaptcha: Face detection based color image captcha", "journal": "Future Generation Computer Systems", "year": "2014", "authors": "Gaurav Goswami; Brian M Powell; Mayank Vatsa; Richa Singh; Afzel Noore"}, {"ref_id": "b75", "title": "Generating captcha images using variations of the same object", "journal": "US Patent", "year": "2020-04-07", "authors": "Anh Truong; Jeremy Goodsitt; Galen Rafferty; Vincent Pham; Austin Walters"}, {"ref_id": "b76", "title": "Captcha image generation using style transfer learning in deep neural network", "journal": "Springer", "year": "2019", "authors": "Hyun Kwon; Hyunsoo Yoon; Ki-Woong Park"}, {"ref_id": "b77", "title": "Robust captcha image generation enhanced with adversarial example methods", "journal": "IEICE TRANSACTIONS on Information and Systems", "year": "2020", "authors": "Hyun Kwon; Hyunsoo Yoon; Ki-Woong Park"}, {"ref_id": "b78", "title": "Two-way image based captcha", "journal": "Springer", "year": "2020", "authors": "Poornananda Bhat; Rashmi Naveen; Raj "}, {"ref_id": "b79", "title": "Semantic labeling of nonspeech audio clips", "journal": "EURASIP Journal on Audio, Speech, and Music Processing", "year": "2010", "authors": "M Xiaojuan; F Christiane; C Perry"}, {"ref_id": "b80", "title": "Decaptcha: breaking 75% of ebay audio captchas", "journal": "USENIX Association", "year": "2009", "authors": "E Bursztein; S Bethard"}, {"ref_id": "b81", "title": "Poster: I can't hear this because i am human: A novel design of audio captcha system", "journal": "", "year": "2018", "authors": "Jusop Choi; Taekkyung Oh; William Aiken; Simon S Woo; Hyoungshick Kim"}, {"ref_id": "b82", "title": "Scanning-to-speech challenge-response authentication test for visually impaired", "journal": "Computers & Electrical Engineering", "year": "2021", "authors": " Pl Chithra;  Sathya"}, {"ref_id": "b83", "title": "Attacking and defending behind a psychoacousticsbased captcha", "journal": "IEEE", "year": "2021", "authors": "Chih-Hsiang Huang; Po-Hao Wu; Yi-Wen Liu; Shan-Hung Wu"}, {"ref_id": "b84", "title": "Captcha for blind people", "journal": "IEEE", "year": "2007", "authors": "M Shirali-Shahreza; S Shirali-Shahreza"}, {"ref_id": "b85", "title": "An audio captcha to distinguish humans from computers", "journal": "", "year": "2010", "authors": "G Haichang; H Liu; D Yao; X Liu; U Aickelin"}, {"ref_id": "b86", "title": "Blind and human: Exploring more usable audio {CAPTCHA} designs", "journal": "", "year": "2020", "authors": "Valerie Fanelle; Sepideh Karimi; Aditi Shah; Bharath Subramanian; Sauvik Das"}, {"ref_id": "b87", "title": "Exploring adversaries to defend audio captcha", "journal": "IEEE", "year": "2019", "authors": "Heemany Shekhar; Melody Moh; Teng-Sheng Moh"}, {"ref_id": "b88", "title": "Improved captcha method", "journal": "International Journal of Computer Applications IJCA", "year": "2010", "authors": "R Soni; D Tiwari"}, {"ref_id": "b89", "title": "Hybrid collage captcha", "journal": "International journal of scientific & engineering research", "year": "2013", "authors": "Divya Shankar; Prashant Gupta; Aditya Jaiswal"}, {"ref_id": "b90", "title": "Secure captchas via object segment collages", "journal": "IEEE Access", "year": "2020", "authors": "Zhe Tam V Nguyen; Saiteja Huang; Venkata Bethini;  Sai Prasanth; Phu H Ippagunta;  Phung"}, {"ref_id": "b91", "title": "Drag and drop: A better approach to captcha", "journal": "IEEE", "year": "2009", "authors": "A Desai; P Patadia"}, {"ref_id": "b92", "title": "Mouse intervention captcha", "journal": "", "year": "", "authors": "T Giang; F Liu"}, {"ref_id": "b93", "title": "A highly legible captcha that resists segmentation attacks", "journal": "", "year": "2005", "authors": "H S Baird; M A Moll; S Y Wang"}, {"ref_id": "b94", "title": "An image-based captcha system using click", "journal": "Acta Electronica Malaysia (AEM)", "year": "2019", "authors": "Farah Ruzanna Ridzuan; Hairulnizam Mahdin; Shahreen Kasim; Mohd Sanusi Azmi"}, {"ref_id": "b95", "title": "Enhanced captchas: Using animation to tell humans and computers apart", "journal": "Springer", "year": "2006", "authors": "E Athanasopoulos; S Antonatos"}, {"ref_id": "b96", "title": "Bot or human? a behavior-based online bot detection system", "journal": "Springer", "year": "2018", "authors": "Zi Chu; Steven Gianvecchio; Haining Wang"}, {"ref_id": "b97", "title": "Design of a drag and touch multilingual universal captcha challenge", "journal": "Springer", "year": "2021", "authors": "Abdul Rouf Shah; M Tariq Banday; Shafiya Afzal Sheikh"}, {"ref_id": "b98", "title": "Highly secured intellectual graphical captcha", "journal": "International Journal of Modern Engineering & Management Research", "year": "2018", "authors": "Sanjay Sharma; Devendra Kumar"}, {"ref_id": "b99", "title": "Game controller-based captcha", "journal": "US Patent", "year": "2019-03-19", "authors": "Bryan Cotta; Warren Benedetto"}, {"ref_id": "b100", "title": "Game-like captchas for intrusion detection", "journal": "", "year": "", "authors": "Philip Kirkbride; M Ali Akber Dewan; Fuhua Lin"}, {"ref_id": "b101", "title": "Efficient and secure flash-based gaming captcha", "journal": "Journal of Parallel and Distributed Computing", "year": "2020", "authors": "Monther Aldwairi; Suaad Mohammed; Megana Lakshmi Padmanabhan"}, {"ref_id": "b102", "title": "A non ocr approach for math captcha design based on boolean algebra using digital gates to enhance web security", "journal": "IEEE", "year": "2016", "authors": "Ramanpreet Kaur"}, {"ref_id": "b103", "title": "Question-based captcha", "journal": "IEEE Computer Society", "year": "2007", "authors": "M Shirali-Shahreza; S Shirali-Shahreza"}, {"ref_id": "b104", "title": "Haptic captcha", "journal": "US Patent", "year": "2018-06-05", "authors": "Vincent Levesque"}, {"ref_id": "b105", "title": "The captcha project, completely automatic public turing test to tell computers and humans apart", "journal": "", "year": "", "authors": "M Blum; L A Von Ahn; J Langford; N Hopper"}, {"ref_id": "b106", "title": "Pessimal print: a reverse turing test", "journal": "IEEE", "year": "2001", "authors": "A L Coates; H S Baird;  Faternan"}, {"ref_id": "b107", "title": "Persian/arabic baffletext captcha", "journal": "J. UCS", "year": "2006", "authors": "Mohammad Hassan; Shirali-Shahreza ; Mohammad Shirali-Shahreza"}, {"ref_id": "b108", "title": "Using a text-to-speech synthesizer to generate a reverse turing test", "journal": "", "year": "2003", "authors": "T Y Chan"}, {"ref_id": "b109", "title": "Balancing usability and security in a video captcha", "journal": "ACM", "year": "2009", "authors": "K A Kluever; R Zanibbi"}, {"ref_id": "b110", "title": "Captcha method and system", "journal": "US Patent", "year": "2013-10-29", "authors": "Hui Hu; Hao Fang;  Liu Qingyan"}, {"ref_id": "b111", "title": "Sketcha: a captcha based on line drawings of 3d models", "journal": "ACM", "year": "2010", "authors": "S A Ross; J A Halderman; A Finkelstein"}, {"ref_id": "b112", "title": "Human facial illustrations: Creation and psychophysical evaluation", "journal": "ACM Transactions on Graphics (TOG)", "year": "2004", "authors": "B Gooch; E Reinhard; A Gooch"}, {"ref_id": "b113", "title": "What's up captcha?: a captcha based on image orientation", "journal": "ACM", "year": "2009", "authors": "R Gossweiler; M Kamvar; S Baluja"}, {"ref_id": "b114", "title": "Deviltyper: a game for captcha usability evaluation", "journal": "Computers in Entertainment (CIE)", "year": "2011", "authors": "C J Ho; C C Wu; K T Chen; C L Lei"}, {"ref_id": "b115", "title": "Dynamic cognitive game captcha usability and detection of streaming-based farming", "journal": "", "year": "2014", "authors": "Manar Mohamed; Song Gao; Nitesh Saxena; Chengcui Zhang"}, {"ref_id": "b116", "title": "Hybrid text illusion captcha dealing with partial vision certainty", "journal": "Springer", "year": "2020", "authors": "Arun Pratap Singh; Sanjay Sharma; Vaishali Singh"}, {"ref_id": "b117", "title": "vrcaptcha: Exploring captcha designs in virtual reality", "journal": "", "year": "2021", "authors": "Xiang Li; Yuzheng Chen; Rakesh Patibanda; Florian'floyd' Mueller"}, {"ref_id": "b118", "title": "Adversarial captchas", "journal": "IEEE Transactions on Cybernetics", "year": "2021", "authors": "Chenghui Shi; Xiaogang Xu; Shouling Ji; Kai Bu; Jianhai Chen; Raheem Beyah; Ting Wang"}, {"ref_id": "b119", "title": "Public key-embedded graphic captchas", "journal": "IEEE", "year": "2008", "authors": "S Saklikar; S Saha"}, {"ref_id": "b120", "title": "Localized captcha for illiterate people", "journal": "IEEE", "year": "2007", "authors": "M Hassan; Shirali-Shahreza ; Mohammad Shirali-Shahreza"}, {"ref_id": "b121", "title": "Developing usable captchas for blind users", "journal": "ACM", "year": "2007", "authors": "Jonathan Holman; Jonathan Lazar; Jinjuan Heidi Feng; John D' Arcy"}, {"ref_id": "b122", "title": "Leveraging cognitive factors in securing www with captcha", "journal": "", "year": "2010", "authors": "Amalia I Rusu; Rebecca Docimo; Adrian Rusu"}, {"ref_id": "b123", "title": "Enhancing captcha security using interactivity, dynamism, and mouse movement patterns", "journal": "International Journal of Systems and Service-Oriented Engineering (IJSSOE)", "year": "2016", "authors": "Narges Roshanbin; James Miller"}, {"ref_id": "b124", "title": "Mobile human challenge-response test", "journal": "US Patent", "year": "2015-04-21", "authors": "Avinash Kalgi; Matthew Ward-Steinman; Qian Wang"}, {"ref_id": "b125", "title": "Highlighting captcha", "journal": "IEEE", "year": "2008", "authors": "Mohammad Shirali-Shahreza"}, {"ref_id": "b126", "title": "Multilingual highlighting captcha", "journal": "IEEE", "year": "2011", "authors": "Sajad Shirali; - Shahreza; Mohammad Shirali-Shahreza"}, {"ref_id": "b127", "title": "A new captcha interface design for mobile devices", "journal": "Australian Computer Society, Inc", "year": "2011", "authors": "Rosa Lin; Shih-Yu Huang; Graeme B Bell; Yeuan-Kuen Lee"}, {"ref_id": "b128", "title": "Seesay and hearsay captcha for mobile interaction", "journal": "ACM", "year": "2013", "authors": "Sajad Shirali-Shahreza; Gerald Penn; Ravin Balakrishnan; Yashar Ganjali"}, {"ref_id": "b129", "title": "Combining movement model with finger-stroke level model towards designing a security enhancing mobile friendly captcha", "journal": "", "year": "2020", "authors": "Ahmed Iqbal Pritom; Mehrab Zaman Chowdhury; Joy Protim; Shanto Roy; Md Rashedur Rahman; Sadia Mehnaz; Promi "}, {"ref_id": "b130", "title": "Becaptcha: Bot detection in smartphone interaction using touchscreen biometrics and mobile sensors", "journal": "", "year": "2020", "authors": "Alejandro Acien; Aythami Morales; Julian Fierrez; Ruben Vera-Rodriguez; Oscar Delgado-Mohatar"}, {"ref_id": "b131", "title": "Implementation of captcha suitable for mobile devices", "journal": "IEICE Communications Express", "year": "2019", "authors": "Kentaro Aburada; Shotaro Usuzaki; Hisaaki Yamaba; Tetsuro Katayama; Masayuki Mukunoki; Mirang Park; Naonobu Okazaki"}, {"ref_id": "b132", "title": "oCAPTCHA-Enhanced CAPTCHA Method using Image Orientation", "journal": "", "year": "2019", "authors": "Perera Shakila Lehan"}, {"ref_id": "b133", "title": "Be-captcha: Detecting human behavior in smartphone interaction using multiple inbuilt sensors", "journal": "", "year": "2020", "authors": "Alejandro Acien; Aythami Morales; Julian Fierrez; Ruben Vera-Rodriguez; Ivan Bartolome"}, {"ref_id": "b134", "title": "Becaptcha: Behavioral bot detection using touchscreen and mobile sensors benchmarked on humidb", "journal": "Engineering Applications of Artificial Intelligence", "year": "2021", "authors": "Alejandro Acien; Aythami Morales; Julian Fierrez; Ruben Vera-Rodriguez; Oscar Delgado-Mohatar"}, {"ref_id": "b135", "title": "A new human interactive proofs system for deaf persons", "journal": "IEEE", "year": "2008", "authors": "Sajad Shirali; - Shahreza; Mohammad Shirali-Shahreza"}, {"ref_id": "b136", "title": "Captcha for children", "journal": "IEEE", "year": "2008", "authors": "Sajad Shirali; - Shahreza; Mohammad Shirali-Shahreza"}, {"ref_id": "b137", "title": "3c-click, count, captcha graphical password technique", "journal": "Research Journal of Engineering and Technology", "year": "2018", "authors": "Sheena Mohammed; D Madhuri Dachepally; Mary Angel"}, {"ref_id": "b138", "title": "A new secure and usable captcha-based graphical password scheme", "journal": "Springer", "year": "2018", "authors": "Altaf Khan; Alexander G Chefranov"}, {"ref_id": "b139", "title": "Survey on graphical password authentication system", "journal": "Data Intelligence and Cognitive Informatics", "year": "2021", "authors": "Shikhar Singh; Patel ; Akarsh Jaiswal; Yash Arora; Bharti Sharma"}, {"ref_id": "b140", "title": "Captcha design: Color, usability, and security", "journal": "IEEE Internet Computing", "year": "2011", "authors": "Ahmad Salah; El Ahmad; Jeff Yan; Wai-Yin Ng"}, {"ref_id": "b141", "title": "Text captcha is dead? a large scale deployment and empirical study", "journal": "", "year": "2020", "authors": "Chenghui Shi; Shouling Ji; Qianjun Liu; Changchang Liu; Yuefeng Chen; Yuan He; Z Liu; R Beyah;  Wang"}, {"ref_id": "b142", "title": "Captcha programming", "journal": "Springer", "year": "2020", "authors": "Darko Brodić; Alessia Amelio"}, {"ref_id": "b143", "title": "A bio metric based approach for using captcha-to enhance accessibility for the visually impaired", "journal": "Disability and Rehabilitation: Assistive Technology", "year": "2019", "authors": " Noorjahan"}, {"ref_id": "b144", "title": "Adamas: Interweaving unicode and color to enhance captcha security", "journal": "Future Generation Computer Systems", "year": "2016", "authors": "Narges Roshanbin; James Miller"}, {"ref_id": "b145", "title": "Evaluating existing audio captchas and an interface optimized for non-visual use", "journal": "", "year": "2009", "authors": "P Jeffrey; Anna C Bigham;  Cavender"}, {"ref_id": "b146", "title": "icaptcha: the next generation of captcha designed to defend against 3rd party human attacks", "journal": "IEEE", "year": "2011", "authors": "Christopher F Huy D Truong; Cliff C Turner;  Zou"}, {"ref_id": "b147", "title": "Gaming the game: Defeating a game captcha with efficient and robust hybrid attacks", "journal": "IEEE", "year": "2014", "authors": "Song Gao; Manar Mohamed; Nitesh Saxena; Chengcui Zhang"}, {"ref_id": "b148", "title": "Are captchas preventing robotic intrusion or accessibility for impaired users?", "journal": "IEEE", "year": "2020", "authors": "Rudy Berton; Ombretta Gaggi; Agnieszka Kolasinska; Claudio Enrico Palazzi; Giacomo Quadrio"}, {"ref_id": "b149", "title": "Captcha and accessibility-is this the best we can do?", "journal": "", "year": "2014", "authors": "Lourdes Moreno; María González; Paloma Martínez"}, {"ref_id": "b150", "title": "Applying a partial captcha", "journal": "US Patent", "year": "2019-07-16", "authors": "Mohammed Mujeeb; Kaladgi ; Jameel Ahmed; Kaladgi "}, {"ref_id": "b151", "title": "Collaborative tagging using captcha", "journal": "International Journal of Innovative Technology And Research", "year": "2015", "authors": "Jakeera Me; M Begum; Rao Venkata"}, {"ref_id": "b152", "title": "Leveraging the captcha problem", "journal": "Springer", "year": "2005", "authors": "Daniel Lopresti"}, {"ref_id": "b153", "title": "recaptcha: Human-based character recognition via web security measures", "journal": "Science", "year": "2008", "authors": "Luis Von Ahn; Benjamin Maurer; Colin Mcmillen; David Abraham; Manuel Blum"}, {"ref_id": "b154", "title": "An audio captcha to distinguish humans from computers", "journal": "IEEE", "year": "2010", "authors": "Haichang Gao; Honggang Liu; Dan Yao; Xiyang Liu; Uwe Aickelin"}, {"ref_id": "b155", "title": "Mouse intervention captcha", "journal": "", "year": "2006", "authors": "Triet Giang; Fei Liu"}, {"ref_id": "b156", "title": "Pessimalprint: a reverse turing test", "journal": "International Journal on Document Analysis and Recognition", "year": "2003", "authors": "Allison L Henry S Baird; Richard J Coates;  Fateman"}, {"ref_id": "b157", "title": "Image steganography method to achieve confidentiality using captcha for authentication", "journal": "IEEE", "year": "2020", "authors": "T Kalaichelvi;  Apuroop"}, {"ref_id": "b158", "title": "An optimized system to solve text-based captcha", "journal": "", "year": "2018", "authors": "Ye Wang; Mi Lu"}, {"ref_id": "b159", "title": "Using machine learning to break visual human interaction proofs (hips)", "journal": "Advances in Neural Information Processing Systems", "year": "2004", "authors": "K Chellapilla; P Simard"}, {"ref_id": "b160", "title": "The robustness of a new captcha", "journal": "ACM", "year": "2010", "authors": "A S El Ahmad; J Yan; L Marshall"}, {"ref_id": "b161", "title": "Attacks and design of image recognition captchas", "journal": "", "year": "2010", "authors": "Jeff Bin B Zhu; Qiujie Yan; Chao Li; Jia Yang; Ning Liu; Meng Xu; Kaiwei Yi;  Cai"}, {"ref_id": "b162", "title": "A projection-based segmentation algorithm for breaking msn and yahoo captchas", "journal": "Citeseer", "year": "2008", "authors": "S Y Huang; Y K Lee; G Bell; Z Ou"}, {"ref_id": "b163", "title": "Computers beat humans at single character recognition in reading based human interaction proofs (hips)", "journal": "Citeseer", "year": "2005", "authors": "K Chellapilla; K Larson; P Simard; M Czerwinski"}, {"ref_id": "b164", "title": "Sphinx-4: A flexible open source framework for speech recognition", "journal": "Sun Microsystems, Inc. Mountain View", "year": "2004", "authors": "W Walker; P Lamere; P Kwok; B Raj; R Singh; E Gouvea; P Wolf; J Woelfel"}, {"ref_id": "b165", "title": "Breaking e-banking captchas", "journal": "ACM", "year": "2010", "authors": "S Li; S Shah; M Khan; S A Khayam; A R Sadeghi; R Schmitz"}, {"ref_id": "b166", "title": "Machine learning attacks against the asirra captcha", "journal": "", "year": "2008", "authors": "Philippe Golle"}, {"ref_id": "b167", "title": "Strengthening pix captcha using trainlm function in backpropagation", "journal": "Springer", "year": "2021", "authors": "Renu Saroha; Sumeet Gill"}, {"ref_id": "b168", "title": "Imagenet classification with deep convolutional neural networks", "journal": "", "year": "2012", "authors": "Alex Krizhevsky; Ilya Sutskever; Geoffrey E Hinton"}, {"ref_id": "b169", "title": "Towards understanding the security of modern image captchas and underground captcha-solving services", "journal": "Big Data Mining and Analytics", "year": "2019", "authors": "Haiqin Weng; Binbin Zhao; Shouling Ji; Jianhai Chen; Ting Wang; Qinming He; Raheem Beyah"}, {"ref_id": "b170", "title": "Captcha recognition based on faster r-cnn", "journal": "Springer", "year": "2017", "authors": "Feng-Lin Du; Jia-Xing Li; Zhi Yang; Peng Chen; Bing Wang; Jun Zhang"}, {"ref_id": "b171", "title": "Cnn for breaking text-based captcha with noise", "journal": "International Society for Optics and Photonics", "year": "2017", "authors": "Kaixuan Liu; Rong Zhang; Ke Qing"}, {"ref_id": "b172", "title": "Breaking captcha characters using multi-task learning cnn and svm", "journal": "IEEE", "year": "2020", "authors": "Sumeet Sachdev"}, {"ref_id": "b173", "title": "End-to-end captcha recognition using deep cnn-rnn network", "journal": "IEEE", "year": "2019", "authors": "Yujin Shu; Yongjin Xu"}, {"ref_id": "b174", "title": "An approach for chinese character captcha recognition using cnn", "journal": "Journal of Physics: Conference Series", "year": "2018", "authors": "Yang Jia; Wang Fan; Chen Zhao; Jungang Han"}, {"ref_id": "b175", "title": "An efficient and accurate depth-wise separable convolutional neural network for cybersecurity vulnerability assessment based on captcha breaking", "journal": "Electronics", "year": "2021", "authors": "Stephen Dankwa; Lu Yang"}, {"ref_id": "b176", "title": "Semi-supervised deep learning approach to break common captchas", "journal": "", "year": "2021", "authors": "Ondrej Bostik; Karel Horak; Lukas Kratochvila; Tomas Zemcik; Simon Bilik"}, {"ref_id": "b177", "title": "An attack on hollow captcha using accurate filling and nonredundant merging", "journal": "IETE Technical Review", "year": "2018", "authors": "Jun Chen; Xiangyang Luo; Jianwei Hu; Dengpan Ye; Daofu Gong"}, {"ref_id": "b178", "title": "Selective learning confusion class for text-based captcha recognition", "journal": "IEEE Access", "year": "2019", "authors": "Jun Chen; Xiangyang Luo; Yingying Liu; Jinwei Wang; Yuanyuan Ma"}, {"ref_id": "b179", "title": "A machine vision attack model on image based captchas challenge: Large scale evaluation", "journal": "Springer", "year": "2018", "authors": "Ajeet Singh; Vikas Tiwari; Appala Naidu; Tentu "}, {"ref_id": "b180", "title": "Development of a character captcha recognition system for the visually impaired community using deep learning", "journal": "Machine Vision and Applications", "year": "2021", "authors": "Xiaohui Zhang; Xinhua Liu; Thompson Sarkodie-Gyan; Zhixiong Li"}, {"ref_id": "b181", "title": "Captcha recognition method based on cnn with focal loss", "journal": "Complexity", "year": "2021", "authors": "Zhong Wang; Peibei Shi"}, {"ref_id": "b182", "title": "Pushing stochastic gradient towards second-order methods-backpropagation learning with transformations in nonlinearities", "journal": "Springer", "year": "2013", "authors": "Tommi Vatanen; Tapani Raiko; Harri Valpola; Yann Lecun"}, {"ref_id": "b183", "title": "Deep residual learning for image recognition", "journal": "", "year": "2016", "authors": "Kaiming He; Xiangyu Zhang; Shaoqing Ren; Jian Sun"}, {"ref_id": "b184", "title": "Multi-digit number recognition from street view imagery using deep convolutional neural networks", "journal": "", "year": "2013", "authors": "Ian J Goodfellow; Yaroslav Bulatov; Julian Ibarz; Sacha Arnoud; Vinay Shet"}, {"ref_id": "b185", "title": "A highly reliable captcha recognition algorithm based on rejection", "journal": "Acta Automatica Sinica", "year": "2011", "authors": "Zhang Liang; Huang Shuguang; Shi Zhaoxiang"}, {"ref_id": "b186", "title": "Research on deep learning techniques in breaking text-based captchas and designing image-based captcha", "journal": "IEEE Transactions on Information Forensics and Security", "year": "2018", "authors": "Mengyun Tang; Haichang Gao; Yang Zhang; Yi Liu; Ping Zhang; Ping Wang"}, {"ref_id": "b187", "title": "I am robot:(deep) learning to break semantic image captchas", "journal": "IEEE", "year": "2016", "authors": "Suphannee Sivakorn; Iasonas Polakis; Angelos D Keromytis"}, {"ref_id": "b188", "title": "Classification of images using support vector machines", "journal": "", "year": "2007", "authors": "Gidudu Anthony; Hulley Greg; Marwala Tshilidzi"}, {"ref_id": "b189", "title": "Breaking text-based captchas with variable word and character orientation", "journal": "Pattern Recognition", "year": "2015", "authors": "Oleg Starostenko; Claudia Cruz-Perez; Fernando Uceda-Ponga; Vicente Alarcon-Aquino"}, {"ref_id": "b190", "title": "Divide and conquer: an efficient attack on yahoo! captcha", "journal": "IEEE", "year": "2012", "authors": "Haichang Gao; Wei Wang; Ye Fan"}, {"ref_id": "b191", "title": "Using fuzzy logic to recognize geometric shapes interactively", "journal": "IEEE", "year": "2000", "authors": "J Manuel; Joaquim A Fonseca;  Jorge"}, {"ref_id": "b192", "title": "Computational geometry in C", "journal": "Cambridge university press", "year": "1998", "authors": " Joseph O'rourke"}, {"ref_id": "b193", "title": "Handwritten character recognition using fuzzy logic", "journal": "IEEE", "year": "1994", "authors": "Sreela Sasi; Jatinder Singh Bedi"}, {"ref_id": "b194", "title": "Breaking down captcha using edge corners and fuzzy logic segmentation/recognition technique", "journal": "Security and Communication Networks", "year": "2015", "authors": "Rabih Al Nachar; Elie Inaty; Patrick J Bonnin; Yasser Alayli"}, {"ref_id": "b195", "title": "Best practices for convolutional neural networks applied to visual document analysis", "journal": "Icdar", "year": "2003", "authors": "Patrice Y Simard; David Steinkraus; John C Platt"}, {"ref_id": "b196", "title": "Recognition and verification of unconstrained handwritten words", "journal": "IEEE Transactions on Pattern Analysis and Machine Intelligence", "year": "2005", "authors": "Alessandro L Koerich; Robert Sabourin; Ching Y Suen"}, {"ref_id": "b197", "title": "Artificial intelligent system for character recognition using levenbergmarquardt algorithm", "journal": "International Journal of Advanced Research in Computer Science and Software Engineering", "year": "2012", "authors": "Gaganjot Kaur; Monika Aggarwal"}, {"ref_id": "b198", "title": "Optical character recognition using artificial neural network", "journal": "International Journal of Advanced Research in Computer Engineering & Technology", "year": "2012", "authors": "Sameeksha Barve"}, {"ref_id": "b199", "title": "Image-to-image translation with conditional adversarial networks", "journal": "", "year": "2017", "authors": "Phillip Isola; Jun-Yan Zhu; Tinghui Zhou; Alexei A Efros"}, {"ref_id": "b200", "title": "Unpaired image-to-image translation using cycleconsistent adversarial networks", "journal": "", "year": "2017", "authors": "Jun-Yan Zhu; Taesung Park; Phillip Isola; Alexei A Efros"}, {"ref_id": "b201", "title": "Seqgan: Sequence generative adversarial nets with policy gradient", "journal": "", "year": "2017", "authors": "Lantao Yu; Weinan Zhang; Jun Wang; Yong Yu"}, {"ref_id": "b202", "title": "Adversarial learning for neural dialogue generation", "journal": "", "year": "2017", "authors": "Jiwei Li; Will Monroe; Tianlin Shi; Sébastien Jean; Alan Ritter; Dan Jurafsky"}, {"ref_id": "b203", "title": "The security of big data in fog-enabled iot applications including blockchain: A survey", "journal": "Sensors", "year": "2019", "authors": "Noshina Tariq; Muhammad Asim; Feras Al-Obeidat; Muhammad Zubair Farooqi; Thar Baker; Mohammad Hammoudeh; Ibrahim Ghafir"}, {"ref_id": "b204", "title": "Reverse engineering captchas", "journal": "IEEE", "year": "2008", "authors": "A Hindle; M W Godfrey; R C Holt"}, {"ref_id": "b205", "title": "Detecting and breaking captcha automation scripts and preventing image scraping", "journal": "US Patent", "year": "2015-12-29", "authors": "Kyle Adams"}, {"ref_id": "b206", "title": "CAPTCHA Design and Security Issues", "journal": "Springer", "year": "2019", "authors": "Yang-Wai Chow; Willy Susilo; Pairat Thorncharoensri"}, {"ref_id": "b207", "title": "Captcha recognition based on kohonen maps", "journal": "Springer", "year": "2019", "authors": "Yujia Sun; Jan Platoš"}, {"ref_id": "b208", "title": "Research on optimization of captcha recognition algorithm based on svm", "journal": "", "year": "2019", "authors": "Li Wei; Xiang Li; Tingrong Cao; Quan Zhang; Liangqi Zhou; Wenli Wang"}, {"ref_id": "b209", "title": "Captcha: Novel approach to secure user", "journal": "Pramana Research Journal", "year": "2020", "authors": "Ms Mrunali; S Sonwalkar"}, {"ref_id": "b210", "title": "Is image-based captcha secure against attacks based on machine learning? an experimental study", "journal": "Computers & Security", "year": "2020", "authors": "H Fatmah; Fawaz A Alqahtani;  Alsulaiman"}, {"ref_id": "b211", "title": "An end-to-end attack on text captchas", "journal": "IEEE Transactions on Information Forensics and Security", "year": "2019", "authors": "Yang Zi; Haichang Gao; Zhouhang Cheng; Yi Liu"}, {"ref_id": "b212", "title": "An end-to-end attack on text-based captchas based on cycle-consistent generative adversarial network", "journal": "", "year": "2020", "authors": "Chunhui Li; Xingshu Chen; Haizhou Wang; Yu Zhang; Peiming Wang"}, {"ref_id": "b213", "title": "Genetic optimization of radial basis probabilistic neural networks", "journal": "International Journal of Pattern Recognition and Artificial Intelligence", "year": "2004", "authors": "Wen-Bo Zhao; De-Shuang Huang; Ji-Yan Du; Li-Ming Wang"}, {"ref_id": "b214", "title": "Object detection with deep learning: A review", "journal": "IEEE transactions on neural networks and learning systems", "year": "2019", "authors": "Zhong-Qiu Zhao; Peng Zheng; Shou-Tao Xu; Xindong Wu"}, {"ref_id": "b215", "title": "Corrupted and occluded face recognition via cooperative sparse representation", "journal": "Pattern Recognition", "year": "2016", "authors": "Zhong-Qiu Zhao; Yiu-Ming Cheung; Haibo Hu; Xindong Wu"}, {"ref_id": "b216", "title": "Classification of plant leaf images with complicated background", "journal": "Applied mathematics and computation", "year": "2008", "authors": "Xiao-Feng Wang; De-Shuang Huang; Ji-Xiang Du; Huan Xu; Laurent Heutte"}, {"ref_id": "b217", "title": "Completed local binary count for rotation invariant texture classification", "journal": "IEEE transactions on image processing", "year": "2012", "authors": "Yang Zhao; De-Shuang Huang; Wei Jia"}, {"ref_id": "b218", "title": "Backpropagation applied to handwritten zip code recognition", "journal": "Neural computation", "year": "1989", "authors": "Yann Lecun; Bernhard Boser; John S Denker; Donnie Henderson; Richard E Howard; Wayne Hubbard; Lawrence D Jackel"}, {"ref_id": "b219", "title": "ieee conference on computer vision and pattern recognition (cvpr)", "journal": "IEEE", "year": "2016", "authors": "Xiangyu He; Shaoqing Zhang; Jian Ren;  Sun"}, {"ref_id": "b220", "title": "No bot expects the deepcaptcha! introducing immutable adversarial examples with applications to captcha", "journal": "IACR Cryptol. ePrint Arch", "year": "2016", "authors": "Margarita Osadchy; Julio Hernandez-Castro; Stuart J Gibson; Orr Dunkelman; Daniel Pérez-Cabo"}, {"ref_id": "b221", "title": "Intriguing properties of neural networks", "journal": "", "year": "2013", "authors": "Christian Szegedy; Wojciech Zaremba; Ilya Sutskever; Joan Bruna; Dumitru Erhan; Ian Goodfellow; Rob Fergus"}, {"ref_id": "b222", "title": "No bot expects the deepcaptcha! introducing immutable adversarial examples, with applications to captcha generation", "journal": "IEEE Transactions on Information Forensics and Security", "year": "2017", "authors": "Margarita Osadchy; Julio Hernandez-Castro; Stuart Gibson; Orr Dunkelman; Daniel Pérez-Cabo"}, {"ref_id": "b223", "title": "Breaking captchastar using the basecass methodology", "journal": "ACM Transactions on Internet Technology", "year": "2023", "authors": "Carlos Hernández-Castro; David F Barrero; Maria Dolores; R-Moreno "}, {"ref_id": "b224", "title": "Dbn-dnn: discrimination and classification of vng sequence using deep neural network framework in the emd domain", "journal": "Computer Methods in Biomechanics and Biomedical Engineering: Imaging & Visualization", "year": "2020", "authors": "Amine Ben Slama; Hanene Sahli; Aymen Mouelhi; Jihene Marrakchi; Mounir Sayadi; Hedi Trabelsi"}, {"ref_id": "b225", "title": "Alec: An accurate, light and efficient network for captcha recognition", "journal": "Springer", "year": "2020", "authors": "Nan Li; Qianyi Jiang; Qi Song; Rui Zhang; Xiaolin Wei"}, {"ref_id": "b226", "title": "Efficient object detection in large images using deep reinforcement learning", "journal": "", "year": "2020", "authors": "Burak Uzkent; Christopher Yeh; Stefano Ermon"}], "figures": [{"figure_label": "1", "figure_type": "figure", "figure_id": "fig_0", "figure_caption": "Fig. 1 .1Fig. 1. Different kinds of text CAPTCHAs.", "figure_data": ""}, {"figure_label": "2", "figure_type": "figure", "figure_id": "fig_1", "figure_caption": "Fig. 2 .2Fig. 2. The proposed taxonomy of CAPTCHA types.", "figure_data": ""}, {"figure_label": "3", "figure_type": "figure", "figure_id": "fig_2", "figure_caption": "Fig. 3 .3Fig. 3. Text CAPTCHAs at CAPTCHAservice.org.", "figure_data": ""}, {"figure_label": "4", "figure_type": "figure", "figure_id": "fig_3", "figure_caption": "Fig. 4 .4Fig. 4. EZ-Gimpy challenge image.", "figure_data": ""}, {"figure_label": "5", "figure_type": "figure", "figure_id": "fig_4", "figure_caption": "Fig. 5 .5Fig. 5. Gimpy-r challenge image.", "figure_data": ""}, {"figure_label": "6", "figure_type": "figure", "figure_id": "fig_5", "figure_caption": "Fig. 6 .6Fig. 6. A DotCHA image.", "figure_data": ""}, {"figure_label": "7", "figure_type": "figure", "figure_id": "fig_6", "figure_caption": "Fig. 7 .7Fig. 7. Showing synthesized handwritten CAPTCHA.", "figure_data": ""}, {"figure_label": "8", "figure_type": "figure", "figure_id": "fig_7", "figure_caption": "Fig. 8 .8Fig. 8. Showing hollow CAPTCHAs.", "figure_data": ""}, {"figure_label": "31", "figure_type": "figure", "figure_id": "fig_8", "figure_caption": "4. 3 . 131Image-based CAPTCHAs. Progress made in the making of CAPTCHAs has turned towards image-based CAPTCHAs", "figure_data": ""}, {"figure_label": "9", "figure_type": "figure", "figure_id": "fig_9", "figure_caption": "Fig. 9 .9Fig. 9. Different image-based challenges.", "figure_data": ""}, {"figure_label": "10", "figure_type": "figure", "figure_id": "fig_10", "figure_caption": "Fig. 10 .10Fig. 10. Images with various orientation properties.", "figure_data": ""}, {"figure_label": "11", "figure_type": "figure", "figure_id": "fig_11", "figure_caption": "Fig. 11 .11Fig. 11. An ASIRRA challenge.", "figure_data": ""}, {"figure_label": "12", "figure_type": "figure", "figure_id": "fig_12", "figure_caption": "Fig. 12 .12Fig. 12. An example of text CAPTCHA.", "figure_data": ""}, {"figure_label": "13", "figure_type": "figure", "figure_id": "fig_13", "figure_caption": "Fig. 13 .13Fig. 13. Example of audio CAPTCHA.", "figure_data": ""}, {"figure_label": "33", "figure_type": "figure", "figure_id": "fig_14", "figure_caption": "4. 3 . 333Collage CAPTCHAs. CAPTCHAs mainly established on Non-OCR methods are the collage CAPTCHAs. It usually has contorted shapes that asks for the user to select a certain one. A certain Collage CAPTCHA was presented by Ritury soni[89]. On the left of the screen, the image of objects is displayed. However, on the right side, it displays other images with the name of the left image, as shown in Fig.14. The user selects both the left image and the most appropriate word image from the right of the screen. The user in the given box would type the name in.Similarly, Shanker et al.[90] introduced another hybrid Collage CAPTCHA to reduce CAPTCHA attacks.", "figure_data": ""}, {"figure_label": "14", "figure_type": "figure", "figure_id": "fig_15", "figure_caption": "Fig. 14 .14Fig. 14. A collage challenge.", "figure_data": ""}, {"figure_label": "15", "figure_type": "figure", "figure_id": "fig_16", "figure_caption": "Fig. 15 .15Fig. 15. An example of SCAPTCHA along with a text-based and reCAPTCHA example.", "figure_data": ""}, {"figure_label": "16", "figure_type": "figure", "figure_id": "fig_17", "figure_caption": "Fig. 16 .16Fig. 16. Mouse-intervention CAPTCHA.", "figure_data": ""}, {"figure_label": "17", "figure_type": "figure", "figure_id": "fig_18", "figure_caption": "Fig. 17 .17Fig. 17. DND CAPTHA image.", "figure_data": ""}, {"figure_label": "18", "figure_type": "figure", "figure_id": "fig_19", "figure_caption": "Fig. 18 .18Fig. 18. DND CAPTCHA right or wrong placed.", "figure_data": ""}, {"figure_label": "19", "figure_type": "figure", "figure_id": "fig_20", "figure_caption": "Fig. 19 .19Fig. 19. A sample Question.", "figure_data": ""}, {"figure_label": "20", "figure_type": "figure", "figure_id": "fig_21", "figure_caption": "Fig. 20 .20Fig. 20. An example of video CAPTCHA.", "figure_data": ""}, {"figure_label": "21", "figure_type": "figure", "figure_id": "fig_22", "figure_caption": "Fig. 21 .21Fig. 21. A drawing CAPTCHA.", "figure_data": ""}, {"figure_label": "38", "figure_type": "figure", "figure_id": "fig_23", "figure_caption": "4. 3 . 838Game CAPTCHAs. CAPTCHAs are mainly seen in the form of various numbers, letters, and a variety of pictures. The core reason for CAPTCHAs appearance on screen is to ward off users from bot programs. Not only do suspicious users get this unrelenting task of solving a CAPTCHA, but the genuine users also receive them. Judging this uncomfortably from the user end, Chein-Ju et al.[115] came up with a great initiative, namely \"DevilType. \" The maximum numbers of devils are overthrown by using CAPTCHA tests, as shown in image Fig.22 and 23.    ", "figure_data": ""}, {"figure_label": "22", "figure_type": "figure", "figure_id": "fig_24", "figure_caption": "Fig. 22 .22Fig. 22. A CAPTCHA is attached to each devil.", "figure_data": ""}, {"figure_label": "23", "figure_type": "figure", "figure_id": "fig_25", "figure_caption": "Fig. 23 .23Fig. 23. The devil moves from upside to downside.", "figure_data": ""}, {"figure_label": "", "figure_type": "figure", "figure_id": "fig_26", "figure_caption": "proposed a relay attack-resistant Dynamic Cognitive Game (DCG) CAPTCHA. It had simple moving objects. The user plays an object matching game to pass the test, as shown in Fig. 24 and 25.", "figure_data": ""}, {"figure_label": "24", "figure_type": "figure", "figure_id": "fig_27", "figure_caption": "Fig. 24 .24Fig. 24. An example of parking games.", "figure_data": ""}, {"figure_label": "25", "figure_type": "figure", "figure_id": "fig_28", "figure_caption": "Fig. 25 .25Fig. 25. An example of ships games.", "figure_data": ""}, {"figure_label": "26", "figure_type": "figure", "figure_id": "fig_29", "figure_caption": "Fig. 26 .26Fig. 26. Flash-Based Gaming CAPTCHA.", "figure_data": ""}, {"figure_label": "27", "figure_type": "figure", "figure_id": "fig_30", "figure_caption": "Fig. 27 .27Fig. 27. A taxonomy of Hybrid CAPTCHA schemes.", "figure_data": ""}, {"figure_label": "28", "figure_type": "figure", "figure_id": "fig_31", "figure_caption": "Fig. 28 .28Fig. 28. The proposed taxonomy of CAPTCHA breaking techniques.", "figure_data": ""}, {"figure_label": "29", "figure_type": "figure", "figure_id": "fig_32", "figure_caption": "Fig. 29 .29Fig. 29. A generic view of CAPTCHA breaking steps.", "figure_data": ""}, {"figure_label": "11", "figure_type": "figure", "figure_id": "fig_33", "figure_caption": "6. 1 . 111Vertical segmentation. Many visual CAPTCHA schemes are attached by Chellapilla et al.[160].", "figure_data": ""}, {"figure_label": "30", "figure_type": "figure", "figure_id": "fig_34", "figure_caption": "Fig. 30 .30Fig. 30. Showing vertical segmentation.", "figure_data": ""}, {"figure_label": "31", "figure_type": "figure", "figure_id": "fig_35", "figure_caption": "Fig. 31 .31Fig. 31. Letter A-Z and their pixel count.", "figure_data": ""}, {"figure_label": "32", "figure_type": "figure", "figure_id": "fig_36", "figure_caption": "Fig. 32 .32Fig. 32. Snake segmentation:(a) Pre-processing,(b) Prior to segmentation(c) After segmentation.", "figure_data": ""}, {"figure_label": "33", "figure_type": "figure", "figure_id": "fig_37", "figure_caption": "Fig. 33 .33Fig. 33. Component identification:(a) Original CAPTCHA(b) Background removal(c) Loop removal.", "figure_data": ""}, {"figure_label": "34", "figure_type": "figure", "figure_id": "fig_38", "figure_caption": "Fig. 34 .34Fig. 34. Final recognized characters.", "figure_data": ""}, {"figure_label": "35", "figure_type": "figure", "figure_id": "fig_39", "figure_caption": "Fig. 35 .35Fig. 35. (a) Test image (b) Projection-based image.", "figure_data": ""}, {"figure_label": "36", "figure_type": "figure", "figure_id": "fig_40", "figure_caption": "Fig. 36 .36Fig. 36. Segmentation results of a Ge-Captcha image.", "figure_data": ""}, {"figure_label": "37", "figure_type": "figure", "figure_id": "fig_41", "figure_caption": "Fig. 37 .37Fig. 37. character component extraction using Gabor filters.", "figure_data": ""}, {"figure_label": "38", "figure_type": "figure", "figure_id": "fig_42", "figure_caption": "Fig. 38 .38Fig. 38. CNN network structure.", "figure_data": ""}, {"figure_label": "39", "figure_type": "figure", "figure_id": "fig_43", "figure_caption": "Fig. 39 .39Fig. 39. LeNet-5 feed-forward architecture.", "figure_data": ""}, {"figure_label": "41", "figure_type": "figure", "figure_id": "fig_44", "figure_caption": "Fig. 41 .41Fig. 41. Edge corner-based fuzzy logic segmentation and recognition.", "figure_data": ""}, {"figure_label": "42", "figure_type": "figure", "figure_id": "fig_45", "figure_caption": "Fig. 42 .42Fig. 42. A GAN-based Pre-processing model proposed in [54].", "figure_data": ""}, {"figure_label": "43", "figure_type": "figure", "figure_id": "fig_46", "figure_caption": "Fig. 43 .43Fig. 43. Identifying 24 minipatches in the image.", "figure_data": ""}, {"figure_label": "44", "figure_type": "figure", "figure_id": "fig_47", "figure_caption": "Fig. 44 .44Fig. 44. Gimpy-r challenge with background removal.", "figure_data": ""}, {"figure_label": "45", "figure_type": "figure", "figure_id": "fig_48", "figure_caption": "Fig. 45 .45Fig. 45. A basic attack: a failing example where segmentation is not possible between 'k' and 's'.", "figure_data": ""}, {"figure_label": "46", "figure_type": "figure", "figure_id": "fig_49", "figure_caption": "Fig. 46 .46Fig. 46. A basic attack with dictionary enhancement.", "figure_data": ""}, {"figure_label": "47", "figure_type": "figure", "figure_id": "fig_50", "figure_caption": "Fig. 47 .47Fig. 47. Model of computer CAPTCHA solving.", "figure_data": ""}, {"figure_label": "48", "figure_type": "figure", "figure_id": "fig_51", "figure_caption": "Fig. 48 .48Fig. 48. Accuracy comparison of different ML-based attacks.", "figure_data": ""}, {"figure_label": "49", "figure_type": "figure", "figure_id": "fig_52", "figure_caption": "Fig. 49 .49Fig. 49. Accuracy comparison of different segmentation attacks.", "figure_data": ""}, {"figure_label": "50", "figure_type": "figure", "figure_id": "fig_53", "figure_caption": "Fig. 50 .50Fig. 50. Accuracy comparison of miscellaneous attacks.", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Comparison among state-of-the-art surveys", "figure_data": "Ref.YearType-basedAttack-basedApplicationsTaxonomyChallenges & Open issuesRecommendationsThis paper2023✓✓✓✓✓✓[19]2023"}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "Performance analysis of different CAPTCHA Types. Special purpose CAPTCHA schemes: Special purpose CAPTCHA schemes are meant for special people, such as visually or deaf and hard of hearing people. The examples of specialpurpose CAPTCHAs include", "figure_data": "TypesCAPTCHADictionary-basedDatabase-basedUsabilityVulnerabilitySpeed and Storage costOCRText-Based✓✓LowHighLowOCR3D-text✓✓MediumMediumlowOCRHand-written✓✓LowHighLowNON-OCRImage-based×✓HighLowMediumNON-OCRAudio×✓LowLowHighNON-OCRCollage×✓MediumMediumHighNON-OCRMouse-intervention✓✓highMediumMediumNON-OCRVideo×✓HighLowMediumNON-OCRSketcha×✓HighMediumMediumNON-OCRPublic key embedded×✓HighMediumLowNON-OCRGame×✓LowLowHighNON-OCRQuestion-based×✓LowMediumLow-"}, {"figure_label": "3", "figure_type": "table", "figure_id": "tab_2", "figure_caption": "Comparison among different CAPTCHA techniques", "figure_data": "Reference YearTypeTechniqueCharacteristicsClutter/Noise Deformation Orientation Overlapping User-friendly Scalability[18]Non-OCRImage✓✓✓×MediumLow[15]Non-OCRMatch the sound××××HighLow[50]OCRGoogle, MSN×✓✓✓MediumLow[51]OCRGimpy-r and EZ-Gimpy✓✓×✓LowLow[58]OCR3D DotCHA×✓✓×LowLow[64]OCRHand written✓✓×✓LowLow[66]OCRHollow text✓✓×✓LowLow[72]Non-OCRASIRRA✓✓✓×HighLow[73]Non-OCRImage✓✓✓✓HighLow[74]Non-OCRObject recognition✓××✓HighLow[78]Non-OCRFGSM, I-FGSM✓✓××HighLow[81]Non-OCR Automated Speech Recognition (ASR)✓×××MediumLow[85]Non-OCRText to Speech (TTS)✓×××HighMedium[86]Non-OCRWaveform diagrams✓×××HighMedium[17]Non-OCRAudio✓✓✓✓HighMedium[88]Non-OCRContemporary architecture✓✓✓✓HighMedium[90]Non-OCRHybrid✓✓✓×HighMedium[91]Non-OCRObject Segmentation✓✓✓✓HighLow[92]Non-OCRDND draggable character×✓×✓HighMedium[104]Non-OCRQuestion-based×✓××Highlow[108]Non-OCRPersian and Arabic writing✓××✓MediumLow[110]Non-OCRKerckhoffs' Principle✓✓✓✓MediumLow[111]Non-OCRVideo-based✓×✓✓MediumMedium[112]Non-OCRDrawing CAPTCHA××✓×HighMedium[115]Non-OCRA DevilType, Video Captcha×××✓HighLow[116]Non-OCRDynamic Cognitive Game (DCG)"}, {"figure_label": "4", "figure_type": "table", "figure_id": "tab_3", "figure_caption": "Pixel-count lookup table.", "figure_data": "AlphabetPixel-countA183B217C159D192E163F133G190H186I121J111K178L111M233N239O178P162Q229R208S194T175U164V162W234X181Y153Z193"}, {"figure_label": "5", "figure_type": "table", "figure_id": "tab_4", "figure_caption": "A summary of different CAPTCHA breaking techniques", "figure_data": "Attack typeAlgorithmSummaryRef.Year Accuracy Samples CAPTCHAMachine learningDistortion estimation[51]200499%561TextK-nearest neighbors[53]201677.2%-TextGAN[54]201887.4-90%500TextCNN[67]201891%200TextCNN[159] 201899.75%-TextML[162] 201040%800ImageSVM[167] 200882.7%13KImageML[180] 201895.2%25KImageDCNN[185] 201499.8%100kTextRNN[186] 201127-53.2%-TextDL[188] 201670.78%700ImageDL[188] 201683.50%700ImageFuzzy logic[195] 2015 57.3-76.7%-TextSegmentationSnake[50]200794%100TextVertical[50]200799%100TextDivide and Conquer[66]201383%1kTextColour filling[161] 201078%400TextColor-edge & line segmentation [162] 201074.31%109ImageProjection[163] 200875%-TextK-Means[166] 2010100%100TextDictionaryOCR[50]200799%100TextTM/OCR[159] 201898.98%-TextDistortion EstimationReverse engineering[205] 200893%100TextSoftware-basedDecaptcha[81]201175%26kAudio"}], "formulas": [{"formula_id": "formula_0", "formula_text": "✓ × × × × × [20] 2022 ✓ ✓ ✓ × × × [21] 2021 ✓ ✓ × ✓ × × [22] 2021 ✓ ✓ ✓ × × × [23] 2021 × ✓ × × × × [24] 2021 ✓ × ✓ × × × [25] 2019 ✓ ✓ × × ✓ × [26] 2020 ✓ ✓ × × × × [27] 2020 × ✓ × × × × [28] 2016 ✓ × ✓ × × × [29] 2018 ✓ × × × × × [30] 2018 ✓ ✓ × × × × [31] 2013 ✓ ✓ × × ✓ × [32] 2015 ✓ × × × × × [33] 2010 ✓ × × × × × [34] 2011 ✓ ✓ × × × ×", "formula_coordinates": [4.0, 85.06, 123.04, 303.59, 116.78]}, {"formula_id": "formula_1", "formula_text": "× × ✓ × High Low [102] Non-OCR Flash-based × × ✓ × Medium Medium [120] Non-OCR Hybrid ✓ × × × High Medium [154] OCR reCAPTCHA ✓ ✓ ✓ ✓ Low Low [155] Non-OCR Audio ✓ × × × High Medium [156] Non-OCR Mouse Intervention × × ✓ × High Low [157]", "formula_coordinates": [21.0, 56.05, 308.78, 378.65, 50.58]}], "doi": "10.1145/1122445.1122456"}
